{"version":"1","records":[{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains"},"type":"lvl1","url":"/chapter4","position":0},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains"},"content":"Rocks often contain assemblages of ferromagnetic minerals dispersed within a matrix of diamagnetic and paramagnetic minerals. In later chapters, we will be concerned with the magnetization of these assemblages, but here we continue our investigation of the behavior of individual particles.\nIn Chapter 3, we learned that in some crystals electronic spins work in concert to create a spontaneous magnetization that remains in the absence of an external field. The basis of paleomagnetism is that these ferromagnetic particles carry the record of ancient magnetic fields. What allows the magnetic moments to come into equilibrium with the geomagnetic field and then what fixes that equilibrium magnetization into the rock so that we may measure it millions or even billions of years later? We will begin to answer these questions over the next few chapters.\n\nWe will start with the second part of the question: what fixes magnetizations in particular directions? A basic principle is that ferromagnetic particles have various contributions to the magnetic energy which controls their magnetization. No matter how simple or complex the combination of energies may become, the grain will seek the configuration of magnetization which minimizes its total energy. The short answer to our question is that certain directions within magnetic crystals are at lower energy than others. To shift the magnetization from one “easy” direction to another requires energy. If the barrier is high enough, the particle will stay magnetized in the same direction for a very long time—say, billions of years. In this chapter, we will address the causes and some of the consequences of these energy barriers for the magnetization of rocks. Note that in this chapter we will be dealing primarily with energy densities (volume normalized energies) as opposed to energy. We will distinguish the two by the convention that energies are given with the symbol E and energy densities with \\epsilon.\n\nIn Chapter 6, we will discuss the behavior of common magnetic minerals, but to develop the general theory, it is easiest to focus on a single mineral. We choose here magnetite \n\nFigure 4.1, as it has a simple cubic structure and has been the subject of intensive study. However, we will occasionally introduce concepts appropriate for other magnetic minerals when it will be informative.\n\n\n\nFigure 4.1:a) A magnetite octahedron. [Photo of Lou Perloff in The Photo-Atlas of Minerals.] b) Internal crystal structure. Directions of the body diagonal ([111] direction) and orthogonal to the cubic faces ([001] direction) are shown as arrows. Big red dots are the oxygen anions. The blue dots are iron cations in octahedral coordination and the yellow dots are in tetrahedral coordination. Fe^{3+} sits on the A sites and Fe^{2+} and Fe^{3+} sit on the B sites. c) Magnetocrystalline anisotropy energy as a function of direction within a magnetite crystal at room temperature. The easiest direction to magnetize (the direction with the lowest energy — note dimples in energy surface) is along the body diagonal (the [111] direction). [Figure from \n\nWilliams & Dunlop (1995).]\n\nThe simplest permanently magnetized particles are uniformly magnetized and are called single domain (SD). It is only in the smallest grains that such parallel alignment of spins is the lowest energy state. As particles get larger, the energy landscape changes and energy is minimized by spins curling around within a grain to form a vortex. This vortex state can be stable and long-lived and have behavior similar to single-domain grains which has led to such grains being referred to as pseudo-single domain (PSD). In grains that are larger still, spins organize themselves into regions with quasi-uniform magnetization (magnetic domains) separated by domain walls and are called multi-domain (MD) particles. These more complicated spin structures are challenging to model and most paleomagnetic theory is based on single domain behavior. Therefore, we begin with a discussion of the energies of uniformly magnetized (single-domain) particles.","type":"content","url":"/chapter4","position":1},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl2":"The magnetic energy of particles"},"type":"lvl2","url":"/chapter4#the-magnetic-energy-of-particles","position":2},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl2":"The magnetic energy of particles"},"content":"","type":"content","url":"/chapter4#the-magnetic-energy-of-particles","position":3},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Exchange energy","lvl2":"The magnetic energy of particles"},"type":"lvl3","url":"/chapter4#sect-exchange","position":4},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Exchange energy","lvl2":"The magnetic energy of particles"},"content":"We learned in Chapter 3 that some crystalline states are capable of ferromagnetic behavior because of quantum mechanical considerations. Electrons in neighboring orbitals in certain crystals “know” about each other’s spin states. In order to avoid sharing the same orbital with the same spin (hence having the same quantum numbers — not allowed by Pauli’s exclusion principle), electronic spins in such crystals act in a coordinated fashion. They will be either aligned parallel or antiparallel according to the details of the interaction. This exchange energy density (\\epsilon_e) is the source of spontaneous magnetization and is given for a pair of spins by:\\epsilon_e = -2J_e \\mathbf{S}_i \\cdot \\mathbf{S}_j,\n\nwhere J_e is the exchange integral and \\mathbf{S}_i and \\mathbf{S}_j are spin vectors. Depending on the details of the crystal structure (which determines the size and sign of the exchange integral), exchange energy is at a minimum when electronic spins are aligned parallel or anti-parallel.\n\nWe define here a parameter that we will use later: the exchange constant A=J_eS^2/a where a is the interatomic spacing. A = 1.33 × 10^{-11} Jm^{-1} for magnetite, a common magnetic mineral.\n\nRecalling the discussion in Chapter 3, while s orbitals are spherical, the 3d electronic orbitals “poke” in certain directions. Hence spins in some directions within crystals will be easier to coordinate than in others. We can illustrate this using the example of magnetite, a common magnetic mineral (\n\nFigure 4.1a).\nMagnetite octahedra (\n\nFigure 4.1a), when viewed at the atomic level (\n\nFigure 4.1b) are composed of one ferrous (Fe^{2+}) cation, two ferric (Fe^{3+}) cations and four O^{2-} anions. Each oxygen anion shares an electron with two neighboring cations in a covalent bond.\n\nIn Chapter 3, we mentioned that in some crystals, spins are aligned anti-parallel, yet there is still a net magnetization, a phenomenon we called ferrimagnetism. This can arise from the fact that not all cations have the same number of unpaired spins. Magnetite, with its ferrous (4 m_b) and ferric (5 m_b) states is a good example. There are three iron cations in a magnetite crystal giving a total of 14 m_b to play with. Magnetite is very magnetic, but not that magnetic! From \n\nFigure 4.1b we see that the ferric ions all sit on the tetrahedral (A) lattice sites and there are equal numbers of ferrous and ferric ions sitting on the octahedral (B) lattice sites. The unpaired spins of the cations in the A and B lattice sites are aligned anti-parallel to one another because of superexchange (Chapter 3) so we have 9 m_b on the B sites minus 5 m_b on the A sites for a total of 4 m_b per unit cell of magnetite.","type":"content","url":"/chapter4#sect-exchange","position":5},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Magnetic moments and external fields","lvl2":"The magnetic energy of particles"},"type":"lvl3","url":"/chapter4#magnetic-moments-and-external-fields","position":6},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Magnetic moments and external fields","lvl2":"The magnetic energy of particles"},"content":"We know from experience that there are energies associated with magnetic fields. Just as a mass has a potential energy when it is placed in the gravitational field of another mass, a magnetic moment has an energy when it is placed in a magnetic field. This energy has many names (magnetic energy, magnetostatic energy, Zeeman energy, etc.). Here we will work with the volume normalized magnetostatic interaction energy density (\\epsilon_m). This energy density essentially represents the interaction between the magnetic lines of flux and the magnetic moments of the electronic spins. It is energy that aligns magnetic compass needles with the ambient magnetic field. We find the volume-normalized form (in units of J m^{-3}) by noting that magnetization is moment per unit volume, \\mathbf{M} = \\mathbf{m}/v (see Chapter 1)::\\epsilon_m = - \\mathbf{M} \\cdot \\mathbf{B}.\n\n\\epsilon_m is at a minimum when \\mathbf{M} is aligned with \\mathbf{B}, so the magnetostatic energy acts to rotate the magnetization toward the applied field. Single-domain particles have a quasi-uniform magnetization and the application of a magnetic field does not change the net magnetization, which remains at saturation (M_s). Although the magnetostatic energy favors alignment with the applied field, the magnetizations in many particles do not rotate freely (or we would not have paleomagnetism!). There is another contribution to the energy of the magnetic particle associated with the magnetic crystal itself. This energy depends on the direction of magnetization in the crystal — it is anisotropic — and is called anisotropy energy. Anisotropy energy creates barriers to free rotation of the magnetization within the magnetic crystal, which lead to energetically preferred directions for the magnetization within individual single-domain grains.\n\nThere are many causes of anisotropy energy. The most important ones derive from the details of crystal structure (magnetocrystalline anisotropy energy), the state of stress within the particle (magnetostriction), and the shape of the particle, (shape anisotropy). We will consider these briefly in the following subsections.","type":"content","url":"/chapter4#magnetic-moments-and-external-fields","position":7},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Magnetocrystalline anisotropy energy","lvl2":"The magnetic energy of particles"},"type":"lvl3","url":"/chapter4#magnetocrystalline-anisotropy-energy","position":8},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Magnetocrystalline anisotropy energy","lvl2":"The magnetic energy of particles"},"content":"For equant single-domain particles or particles with low saturation magnetizations, the crystal structure dominates the magnetic energy. The so-called easy directions of magnetization are crystallographic directions along which magnetocrystalline energy is at a minimum.\n\nFor a cubic crystal like magnetite at room temperature, the magnetocrystalline anisotropy energy density is expressed in terms of the direction cosines \\alpha_1, \\alpha_2, \\alpha_3 — the cosines of the angles between the magnetization direction and the crystallographic axes [100], [010], [001] (see Appendix for review of direction cosines):\\epsilon_a = K_1(\\alpha_1^2 \\alpha_2^2 + \\alpha_2^2\\alpha^2_3 + \\alpha_3^2\\alpha_1^2) + K_2\\alpha_1^2\\alpha_2^2\\alpha_3^2,\n\nwhere K_1 and K_2 are empirically determined magnetocrystalline anisotropy constants with units of Jm^{-3} (so \\epsilon_a is an energy density). Magnetite (cubic above 120 K) has K_1 = −1.35 × 10^4 Jm^{-3} at room temperature. The result of this equation with these constants is that the easy directions are along the [111] body diagonals and the hard directions are along [100]. The interactive visualization below lets you explore this energy surface in 3D: the bulges along the hard [100] directions (red axes) and the dimples along the easy [111] directions (blue dashed axes) are a direct result of of \n\n(4.3). The energy is minimized along the [111] body diagonals with energy barriers between them due to the hard directions. Toggle between “Energy Landscape” and “Crystal Geometry” to compare the energy surface with the physical cubic crystal geometry.\n\nimport plotly.graph_objects as go\nimport numpy as np\nimport itertools\n\ndef format_miller(h, k, l):\n    \"\"\"Converts indices to standard crystallographic string with overbars.\"\"\"\n    def to_char(n):\n        if n < 0:\n            return f\"{abs(n)}\\u0305\"\n        return str(n)\n    return f\"[{to_char(h)}{to_char(k)}{to_char(l)}]\"\n\ndef plot_magnetocrystalline_anisotropy(K1, K2, radius_nm, temperature, cbar_max=None):\n    \"\"\"Plot 3D magnetocrystalline anisotropy energy surface for magnetite.\n\n    Creates an interactive 3D visualization showing the magnetocrystalline\n    anisotropy energy as a function of magnetization direction. The energy\n    surface is color-coded and includes crystallographic axes for reference.\n\n    Args:\n        K1 (float): First magnetocrystalline anisotropy constant (J/m³).\n        K2 (float): Second magnetocrystalline anisotropy constant (J/m³).\n        radius_nm (float): Grain radius in nanometers.\n        temperature (float): Temperature in Kelvin.\n        cbar_max (float, optional): Maximum value for colorbar. If None,\n            uses the actual maximum energy. Useful for comparing multiple\n            plots with consistent color scales.\n\n    Returns:\n        tuple: (fig, energy_max) where fig is the Plotly figure object and\n            energy_max is the maximum energy barrier value (J).\n    \"\"\"\n    exaggeration = 0.6   # Geometric distortion factor\n    cube_scale = 1.5     # Reference cube size\n\n    # --- 1. MATH: Energy Surface ---\n    phi = np.linspace(0, 2 * np.pi, 100)\n    theta = np.linspace(0, np.pi, 100)\n    phi, theta = np.meshgrid(phi, theta)\n\n    # Direction Cosines\n    a1 = np.sin(theta) * np.cos(phi)\n    a2 = np.sin(theta) * np.sin(phi)\n    a3 = np.cos(theta)\n\n    # Energy Density (Eq. 4.3)\n    term1 = (a1**2 * a2**2) + (a2**2 * a3**2) + (a3**2 * a1**2)\n    term2 = a1**2 * a2**2 * a3**2\n    E_density = (K1 * term1) + (K2 * term2)\n\n    # Convert to Total Energy (J) and Normalize\n    r_particle = radius_nm * 1e-9\n    Volume = (4/3) * np.pi * r_particle**3\n    E_total = E_density * Volume\n    E_norm = E_total - E_total.min()\n\n    # Store actual max for return value\n    energy_max = E_norm.max()\n\n    # Use provided cbar_max or calculated energy_max for consistent scaling\n    cmax_val = cbar_max if cbar_max is not None else energy_max\n\n    # Map energy to radius (Geometric Scaling) - use cmax_val for consistent comparison\n    r_blob = 1.0 + (exaggeration * (E_norm / cmax_val))\n\n    x_blob = r_blob * np.sin(theta) * np.cos(phi)\n    y_blob = r_blob * np.sin(theta) * np.sin(phi)\n    z_blob = r_blob * np.cos(theta)\n\n    # --- 2. GEOMETRY: The Reference Cube ---\n    v_val = 0.6 * cube_scale\n    x_cube = [v_val, v_val, -v_val, -v_val, v_val, v_val, -v_val, -v_val]\n    y_cube = [v_val, -v_val, -v_val, v_val, v_val, -v_val, -v_val, v_val]\n    z_cube = [v_val, v_val, v_val, v_val, -v_val, -v_val, -v_val, -v_val]\n\n    i_ind = [7, 0, 0, 0, 4, 4, 6, 6, 4, 0, 3, 2]\n    j_ind = [3, 4, 1, 2, 5, 6, 5, 2, 0, 1, 6, 3]\n    k_ind = [0, 7, 2, 3, 6, 7, 1, 1, 5, 5, 7, 6]\n\n    # --- 3. PLOTTING ---\n    fig = go.Figure()\n\n    # TRACE 0: Energy Surface\n    fig.add_trace(go.Surface(\n        z=z_blob, x=x_blob, y=y_blob,\n        surfacecolor=E_norm,\n        cmin=0,\n        cmax=cmax_val,\n        colorscale='magma_r',\n        colorbar=dict(title='Energy<br>Barrier (J)', len=0.5, thickness=15, x=0.9, exponentformat='e'),\n        opacity=1.0,\n        hoverinfo='none',\n        contours_x=dict(highlight=False), contours_y=dict(highlight=False), contours_z=dict(highlight=False),\n        name='Energy'\n    ))\n\n    # TRACE 1: Reference Cube\n    fig.add_trace(go.Mesh3d(\n        x=x_cube, y=y_cube, z=z_cube, i=i_ind, j=j_ind, k=k_ind,\n        color='silver', opacity=1, flatshading=True, lighting=dict(ambient=0.5, diffuse=0.8),\n        hoverinfo='skip', visible=False, name='Cube'\n    ))\n\n    # --- 4. AXIS GENERATION ---\n    max_extent = max(1.0 + exaggeration, v_val)\n    axis_scale = max_extent + 0.5\n\n    # Hard axes <100> (red, solid)\n    hard_axes = [([1,0,0]), ([-1,0,0]), ([0,1,0]), ([0,-1,0]), ([0,0,1]), ([0,0,-1])]\n    for vec in hard_axes:\n        v = np.array(vec) * axis_scale\n        fig.add_trace(go.Scatter3d(x=[0, v[0]], y=[0, v[1]], z=[0, v[2]], mode='lines', line=dict(color='red', width=5), hoverinfo='skip', showlegend=False))\n        fig.add_trace(go.Scatter3d(x=[v[0]], y=[v[1]], z=[v[2]], mode='text', text=[f\"{format_miller(*vec)}\"], textfont=dict(color='red', size=12), hoverinfo='skip', showlegend=False))\n\n    # Easy axes <111> (blue, dashed)\n    for x, y, z in itertools.product([1, -1], repeat=3):\n        vec = np.array([x, y, z])\n        v = (vec / np.linalg.norm(vec)) * axis_scale\n        fig.add_trace(go.Scatter3d(x=[0, v[0]], y=[0, v[1]], z=[0, v[2]], mode='lines', line=dict(color='blue', width=4, dash='dash'), hoverinfo='skip', showlegend=False))\n        fig.add_trace(go.Scatter3d(x=[v[0]], y=[v[1]], z=[v[2]], mode='text', text=[f\"{format_miller(x,y,z)}\"], textfont=dict(color='blue', size=11), hoverinfo='skip', showlegend=False))\n\n    # --- 5. LAYOUT ---\n    n_traces = len(fig.data)\n    vis_energy = [True, False] + [True] * (n_traces - 2)\n    vis_cube   = [False, True] + [True] * (n_traces - 2)\n\n    fig.update_layout(\n        width=650, height=470,\n        margin=dict(r=180, b=0, l=10, t=0),\n        title=dict(text=f'Magnetocrystalline anisotropy (equant grain, diameter = {radius_nm*2} nm; temp = {temperature} K)', x=0.0, y=0.99, font=dict(size=13)),\n        hovermode=False,\n        updatemenus=[dict(\n            type=\"buttons\", direction=\"left\", x=0.5, xanchor=\"center\", y=0.0, yanchor=\"top\",\n            bgcolor=\"rgba(255, 255, 255, 0.9)\",\n            pad=dict(t=0, b=2, l=0, r=0),\n            font=dict(size=11),\n            buttons=list([\n                dict(label=\"Energy Landscape\", method=\"update\",\n                     args=[{\"visible\": vis_energy}, {\"title\": f\"Magnetite Energy Surface (equant grain, diameter = {radius_nm*2} nm; temperature = {temperature} K)\"}]),\n                dict(label=\"Crystal Geometry\", method=\"update\",\n                     args=[{\"visible\": vis_cube}, {\"title\": f\"Physical Crystal Shape (equant grain, diameter = {radius_nm*2} nm)\"}]),\n            ]),\n        )],\n        scene=dict(xaxis=dict(visible=False), yaxis=dict(visible=False), zaxis=dict(visible=False),\n            aspectmode='data', camera=dict(eye=dict(x=1.2, y=0.6, z=0.9)), dragmode='orbit'),\n    )\n\n    return fig, energy_max\n\n# --- Generate visualization at 300 K ---\nfig_300K, energy_max = plot_magnetocrystalline_anisotropy(\n    K1=-1.35e4,  # J/m³\n    K2=-0.44e4,  # J/m³\n    radius_nm=25,\n    temperature=300\n)\nfig_300K.show()\n\n\n\nAs a consequence of the magnetocrystalline anisotropy energy, once the magnetization is aligned with an easy direction, work must be done to change it. In order to switch from one easy axis to another (e.g. from one direction along the body diagonal to the opposite for cubic magnetite), the magnetization has to traverse a path over an energy barrier which is the difference between the energy in the easy direction and that in the intervening hard direction. In the case of magnetite at room temperature, this energy barrier is \\epsilon_{[110]}-\\epsilon_{[111]} = K_1/4 - K_1/3 = -K_1/12 = |K_1|/12 (for K_1<0)","type":"content","url":"/chapter4#magnetocrystalline-anisotropy-energy","position":9},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl4":"Temperature dependence of anisotropy","lvl3":"Magnetocrystalline anisotropy energy","lvl2":"The magnetic energy of particles"},"type":"lvl4","url":"/chapter4#temperature-dependence-of-anisotropy","position":10},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl4":"Temperature dependence of anisotropy","lvl3":"Magnetocrystalline anisotropy energy","lvl2":"The magnetic energy of particles"},"content":"Because electronic interactions depend heavily on interatomic spacing, magnetocrystalline anisotropy constants are a strong function of temperature. The effect of this is dramatic in magnetite with K_1 progressively changing until it becomes zero at 130 K — this temperature is known as the isotropic point (\n\nFigure 4.2).\n\nTemperature Scales in Paleomagnetism\n\nWe often use the Kelvin scale when discussing magnetic properties because it is the SI standard for thermodynamic temperature. The conversion from Celsius is straightforward: K = °C + 273.15. Room temperature is commonly approximated as 300 K (27°C; 80°F). While this is slightly warmer than typical indoor temperatures, the round number simplifies calculations and discussions. Magnetite’s isotropic point of 130 K corresponds to approximately -143°C, very chilly 🥶!\n\n\n\nFigure 4.2:Variation of K_1 and K_2 of magnetite as a function of temperature. Solid lines are data from \n\nSyono & Ishikawa (1963). Dashed lines are data from \n\nFletcher & O'Reilly (1974).\n\nGiven that K_1=0 at the isotropic point, there is minimal magnetocrystalline anisotropy at 130 K. The large energy barriers that act to keep the magnetizations parallel to the body diagonal are gone and the spins can wander more freely through the crystal. The interactive visualization below shows the energy landscape at 130 K, where the anisotropy energy is nearly uniform in all directions.\n\n# --- Generate visualization at isotropic point (130 K) ---\nfig_130K, _ = plot_magnetocrystalline_anisotropy(\n    K1=0.0,      # At isotropic point\n    K2=-0.44e4,  # J/m³ (approximately same as 300 K)\n    radius_nm=25,\n    temperature=130,\n    cbar_max=energy_max  # Use same colorbar scale as 300 K for comparison\n)\nfig_130K.show()\n\n\n\nThe change in magnetocrystalline anisotropy at low temperature can have a profound effect on the magnetization. As temperature decreases from room temperature, K_1 passes through zero at about 130 K — the isotropic point (T_i). Below the isotropic point, the energy barriers rise again, but with a different topology: the cube axes become the energy minima and the body diagonals become the high energy directions — the reverse of the room-temperature situation. At still lower temperature (~120 K), the crystal structure of magnetite distorts from cubic to monoclinic at the Verwey temperature (T_v). This distortion is driven by charge ordering: above T_v, the extra electron shared between Fe²⁺ and Fe³⁺ on the octahedral lattice sites hops rapidly, making the sites equivalent; below T_v, the charges localize into an ordered arrangement of Fe²⁺ and Fe³⁺, and the size difference between these ions distorts the lattice.\n\nThe combined effect of these transitions on magnetization is illustrated in \n\nFigure 4.3, which shows the remanence of a sample magnetized to saturation at room temperature, then cooled to low temperature and rewarmed. On cooling, the magnetization progressively decreases through the isotropic point — where the anisotropy momentarily drops to zero and the easy axes switch — and drops further through the Verwey transition where the crystal structure changes. On rewarming, only partial recovery occurs. This is the basis for low-temperature demagnetization (LTD). The remanence loss is predominantly a multidomain effect: loosely pinned domain walls reorganize as the anisotropy changes and do not all return to their original positions on rewarming. The portion that survives — the low-temperature memory — includes the remanence of single-domain grains (which are largely unaffected by LTD) as well as remanence held by strongly pinned domain walls in larger grains.\n\n\n\nFigure 4.3:The magnetization of magnetite-bearing basaltic dike specimen that was given a saturating isothermal remanent magnetization at room temperature (RTSIRM) before being cooled to 10 K and warmed back up to 300 K. On cooling, the magnetization decreases through the isotropic point (~130 K) and drops sharply at the Verwey transition (~120 K). On rewarming, only partial recovery occurs — the difference is the multidomain remanence lost during LTD. Data from \n\nSwanson-Hysell et al. (2021) available in the MagIC database \n\nhttps://​earthref​.org​/MagIC​/20213.","type":"content","url":"/chapter4#temperature-dependence-of-anisotropy","position":11},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl4":"Uniaxial magnetocrystalline anisotropy","lvl3":"Magnetocrystalline anisotropy energy","lvl2":"The magnetic energy of particles"},"type":"lvl4","url":"/chapter4#uniaxial-magnetocrystalline-anisotropy","position":12},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl4":"Uniaxial magnetocrystalline anisotropy","lvl3":"Magnetocrystalline anisotropy energy","lvl2":"The magnetic energy of particles"},"content":"Cubic symmetry (as in the case of magnetite) is just one of many types of crystal symmetries. Another important form is uniaxial symmetry which can arise from crystal shape or structure. The energy density for uniaxial magnetic anisotropy is:\\epsilon_a  = K_{u1} \\sin^2 \\theta + K_{u2} \\sin^4 \\theta + \\ldots\n\nHere the magnetocrystalline constants have been designated K_{u1}, K_{u2} to distinguish them from K_1, K_2 used before. When K_{u1} > 0, the symmetry axis itself is the easy direction — an easy axis. When K_{u1} is negative, the symmetry axis is energetically unfavorable and the magnetization is confined to the plane perpendicular to it — an easy plane.\n\nAn example of a mineral dominated by uniaxial anisotropy is hematite. The magnetization of hematite is complicated, as we shall learn in Chapters 6 and 7, but one source of magnetization is spin-canting (see Chapter 3) within the basal plane. The uniaxial anisotropy perpendicular to the basal plane is very strong (K_{u1} < 0), confining the magnetization to the easy plane. Within the basal plane, the anisotropy is orders of magnitude weaker so the magnetization theoretically wanders fairly freely. In reality, stress anisotropy from defects and internal strain (see next section) pins the magnetization direction within the basal plane much more effectively than magnetocrystalline anisotropy alone would predict.\n\nThe interactive visualization below demonstrates the energy landscape for hematite’s uniaxial anisotropy. The perpendicular anisotropy constant is K₁ = -1.2 × 10⁶ J/m³ \n\nDunlop & Özdemir (1997), while the in-plane anisotropy is much weaker at 0-13 J/m³ \n\nMartı́n-Hernández & Guerrero-Suárez (2012). The energy surface shows high energy along the c-axis (hard direction) and low energy in the basal plane (easy directions).\n\nimport plotly.graph_objects as go\nimport numpy as np\n\ndef plot_hematite_anisotropy(K1, K3, radius_nm, temperature):\n    \"\"\"Plot 3D hematite magnetocrystalline anisotropy energy surface.\n\n    Creates an interactive 3D visualization showing the energy landscape for\n    hematite's uniaxial anisotropy with easy plane behavior.\n\n    Args:\n        K1 (float): Perpendicular anisotropy constant (J/m³). Use negative for easy plane.\n        K3 (float): In-plane (basal plane) anisotropy constant (J/m³).\n        radius_nm (float): Grain radius in nanometers.\n        temperature (float): Temperature in Kelvin.\n\n    Returns:\n        tuple: (fig, energy_max) - Plotly figure and maximum energy value\n    \"\"\"\n\n    exaggeration = 1.8  # Geometric distortion factor (increased to show energy variations)\n    crystal_scale = 2.0   # Reference crystal size (increased for visibility)\n\n    # --- 1. MATH: Energy Surface ---\n    phi = np.linspace(0, 2 * np.pi, 100)\n    theta = np.linspace(0, np.pi, 100)\n    phi_grid, theta_grid = np.meshgrid(phi, theta)\n\n    # Hematite anisotropy energy\n    # Hematite is rhombohedral (R3̄c) but conventionally indexed on hexagonal axes\n    #\n    # K1 = -1.2e6 J/m³: c-axis perpendicular anisotropy (Dunlop & Özdemir 1997, Table 3.1)\n    #     Sign convention: negative means easy plane (basal plane is energetically favorable)\n    # K3 = 13 J/m³: maximum triaxial in-plane anisotropy (Martín-Hernández & Guerrero-Suárez 2012)\n    #     This is ~5 orders of magnitude smaller than |K1|\n    #\n    # The 6-fold cos(6φ) term reflects the trigonal symmetry of the basal plane\n    # projected onto the hexagonal setting\n    E_density = K1 * np.sin(theta_grid)**2 + K3 * np.sin(theta_grid)**4 * np.cos(6 * phi_grid)\n\n    # Convert to Total Energy (J) and Normalize\n    r_particle = radius_nm * 1e-9\n    Volume = (4/3) * np.pi * r_particle**3\n    E_total = E_density * Volume\n    E_norm = E_total - E_total.min()\n    energy_max = E_norm.max()\n\n    # Map energy to radius (Geometric Scaling)\n    r_blob = 1.0 + (exaggeration * (E_norm / energy_max))\n\n    x_blob = r_blob * np.sin(theta_grid) * np.cos(phi_grid)\n    y_blob = r_blob * np.sin(theta_grid) * np.sin(phi_grid)\n    z_blob = r_blob * np.cos(theta_grid)\n\n    # --- 2. GEOMETRY: Hexagonal Plate ---\n    # Hematite has rhombohedral symmetry (space group R3̄c) but commonly forms\n    # hexagonal plate crystals (platy habit) due to strong easy-plane anisotropy\n    # Create hexagonal plate with c-axis vertical (short axis)\n\n    # Scale factor\n    r_hex = 0.9 * crystal_scale  # radius of hexagonal plate\n    c_height = 0.15 * crystal_scale  # height along c-axis (very short for platy habit)\n\n    # Create 6 vertices for hexagonal outline\n    angles_hex = np.linspace(0, 2*np.pi, 7)[:-1]  # 6 vertices, evenly spaced\n\n    x_hex = []\n    y_hex = []\n    z_hex = []\n\n    # Bottom hexagon (6 vertices)\n    for angle in angles_hex:\n        x_hex.append(r_hex * np.cos(angle))\n        y_hex.append(r_hex * np.sin(angle))\n        z_hex.append(-c_height/2)\n\n    # Top hexagon (6 vertices)\n    for angle in angles_hex:\n        x_hex.append(r_hex * np.cos(angle))\n        y_hex.append(r_hex * np.sin(angle))\n        z_hex.append(c_height/2)\n\n    # Define triangular faces\n    # 12 vertices total: 0-5 bottom hexagon, 6-11 top hexagon\n    i_ind = []\n    j_ind = []\n    k_ind = []\n\n    # Bottom cap (6 triangles forming hexagon)\n    for i in range(6):\n        i_next = (i + 1) % 6\n        i_ind.append(0)\n        j_ind.append(i)\n        k_ind.append(i_next)\n\n    # Top cap (6 triangles forming hexagon)\n    for i in range(6):\n        i_next = (i + 1) % 6\n        i_ind.append(6)\n        j_ind.append(6 + i)\n        k_ind.append(6 + i_next)\n\n    # Side faces (12 triangles, 2 per rectangular face)\n    for i in range(6):\n        i_next = (i + 1) % 6\n        # Two triangles per side face\n        i_ind.extend([i, i_next])\n        j_ind.extend([6+i, 6+i_next])\n        k_ind.extend([i_next, 6+i])\n\n    # --- 3. PLOTTING ---\n    fig = go.Figure()\n\n    # TRACE 0: Energy Surface\n    fig.add_trace(go.Surface(\n        z=z_blob, x=x_blob, y=y_blob,\n        surfacecolor=E_norm,\n        cmin=0,\n        colorscale='plasma',\n        colorbar=dict(title='Energy<br>Barrier (J)', len=0.5, thickness=15, x=0.9, exponentformat='e'),\n        opacity=1.0,\n        hoverinfo='none',\n        contours_x=dict(highlight=False), contours_y=dict(highlight=False), contours_z=dict(highlight=False),\n        name='Energy'\n    ))\n\n    # TRACE 1: Hexagonal Plate\n    fig.add_trace(go.Mesh3d(\n        x=x_hex, y=y_hex, z=z_hex, i=i_ind, j=j_ind, k=k_ind,\n        color='lightcoral', opacity=0.9, flatshading=True,\n        lighting=dict(ambient=0.5, diffuse=0.8),\n        hoverinfo='skip', visible=False, name='Crystal'\n    ))\n\n    # --- 4. AXIS GENERATION ---\n    max_extent = max(1.0 + exaggeration, r_hex, c_height/2)\n    axis_scale = max_extent + 0.3  # Reduced to keep c-axis label visible\n\n    # For hematite: c-axis is hard (red), basal plane is easy (blue)\n    hard_color = 'red'\n    easy_color = 'blue'\n\n    # Hard axis along z (c-axis)\n    fig.add_trace(go.Scatter3d(x=[0, 0], y=[0, 0], z=[-axis_scale, axis_scale],\n                               mode='lines', line=dict(color=hard_color, width=5, dash='dash'),\n                               hoverinfo='skip', showlegend=False))\n    fig.add_trace(go.Scatter3d(x=[0], y=[0], z=[axis_scale], mode='text',\n                               text=['c-axis<br>(hard)'], textfont=dict(color=hard_color, size=12),\n                               hoverinfo='skip', showlegend=False))\n\n    # Easy directions in basal plane (6-fold symmetry from hexagonal setting)\n    basal_angles = np.linspace(0, 2*np.pi, 6, endpoint=False)\n    for angle in basal_angles:\n        x_end = axis_scale * 0.7 * np.cos(angle)\n        y_end = axis_scale * 0.7 * np.sin(angle)\n        fig.add_trace(go.Scatter3d(x=[0, x_end], y=[0, y_end], z=[0, 0],\n                                   mode='lines', line=dict(color=easy_color, width=4),\n                                   hoverinfo='skip', showlegend=False))\n\n    # --- 5. LAYOUT ---\n    n_traces = len(fig.data)\n    vis_energy = [True, False] + [True] * (n_traces - 2)\n    vis_crystal = [False, True] + [True] * (n_traces - 2)\n\n    # Format anisotropy constants for display\n    K1_abs = abs(K1)\n    K3_val = K3\n\n    fig.update_layout(\n        width=650, height=470,\n        margin=dict(r=180, b=0, l=10, t=0),\n        title=dict(text=f'Hematite uniaxial anisotropy — easy plane (diameter = {radius_nm*2} nm; temp = {temperature} K)',\n                   x=0.0, y=0.99, font=dict(size=13)),\n        hovermode=False,\n        annotations=[\n            dict(\n                text=f'K<sub>u1</sub> = {K1_abs:.1e} J/m³ (c-axis, hard); in-plane K₃ ≈ 0–{K3_val:.0f} J/m³',\n                xref='paper', yref='paper',\n                x=0.5, y=0.06,\n                xanchor='center', yanchor='top',\n                showarrow=False,\n                font=dict(size=10, color='rgba(0,0,0,0.6)'),\n                bgcolor='rgba(255,255,255,0.8)',\n                borderpad=4\n            )\n        ],\n        updatemenus=[dict(\n            type=\"buttons\", direction=\"left\", x=0.5, xanchor=\"center\", y=0.0, yanchor=\"top\",\n            bgcolor=\"rgba(255, 255, 255, 0.9)\",\n            pad=dict(t=0, b=2, l=0, r=0),\n            font=dict(size=11),\n            buttons=list([\n                dict(label=\"Energy Landscape\", method=\"update\",\n                     args=[{\"visible\": vis_energy},\n                           {\"title\": f\"Hematite Energy Surface (diameter = {radius_nm*2} nm; temp = {temperature} K)\"}]),\n                dict(label=\"Hematite Crystal\", method=\"update\",\n                     args=[{\"visible\": vis_crystal},\n                           {\"title\": f\"Hematite Crystal (platy habit, diameter = {radius_nm*2} nm)\"}]),\n            ]),\n        )],\n        scene=dict(xaxis=dict(visible=False), yaxis=dict(visible=False), zaxis=dict(visible=False),\n            aspectmode='data', camera=dict(eye=dict(x=1.8, y=1.0, z=1.3)), dragmode='orbit'),\n    )\n\n    return fig, energy_max\n\n# --- Generate hematite visualization ---\n# K1 = 1.2e6 J/m³ (Dunlop & Özdemir 1997, Table 3.1)\n# Use negative sign for easy plane behavior (sin²θ energy form)\n# K3 = 13 J/m³ (Martín-Hernández & Guerrero-Suárez 2012)\nfig_hematite, _ = plot_hematite_anisotropy(\n    K1=-1.2e6,   # J/m³ (negative for easy plane)\n    K3=13,       # J/m³ (in-plane anisotropy)\n    radius_nm=200,\n    temperature=300\n)\nfig_hematite.show()\n\n\n\n","type":"content","url":"/chapter4#uniaxial-magnetocrystalline-anisotropy","position":13},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Magnetostriction — stress anisotropy","lvl2":"The magnetic energy of particles"},"type":"lvl3","url":"/chapter4#magnetostriction-stress-anisotropy","position":14},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Magnetostriction — stress anisotropy","lvl2":"The magnetic energy of particles"},"content":"Exchange energy depends strongly on the details of the physical interaction between orbitals in neighboring atoms with respect to one another, hence changing the positions of these atoms will affect that interaction. Put another way, straining a crystal will alter its magnetic behavior. Similarly, changes in the magnetization can change the shape of the crystal by altering the shapes of the orbitals. This is the phenomenon of magnetostriction. The magnetic energy density caused by the application of stress to a crystal can be approximated by:\\epsilon_{\\sigma} = \\frac{3}{2} \\bar{\\lambda} \\sigma \\sin^2 \\theta,\n\nwhere \\bar{\\lambda} is an experimentally derived constant, \\sigma is the stress, and \\theta is the angle of the stress with respect to the c crystallographic axis. \n\nMoskowitz (1993) measured the magnetostriction constants parallel to [111] and [100] in magnetite and found \\lambda_{111} and \\lambda_{100} to be 78.2 \\times 10^{-6} and -21.8 \\times 10^{-6}, respectively. \\bar{\\lambda} is given by:\\bar{\\lambda} = \\frac{2}{5} \\lambda_{100} + \\frac{3}{5} \\lambda_{111},\n\nso \\bar{\\lambda} for magnetite is about 38 × 10^{-6}. Stress has units of Nm^{-2} which have the same fundamental units as Jm^{-3}, so \\bar{\\lambda} is dimensionless. Note the similarity in form of magnetostriction and uniaxial anisotropy giving rise to a single “easy axis” within the crystal.","type":"content","url":"/chapter4#magnetostriction-stress-anisotropy","position":15},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Magnetostatic (shape) anisotropy","lvl2":"The magnetic energy of particles"},"type":"lvl3","url":"/chapter4#sect-shape","position":16},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Magnetostatic (shape) anisotropy","lvl2":"The magnetic energy of particles"},"content":"There is one more important source of magnetic anisotropy: shape. To understand how crystal shape controls magnetic energy, we need to understand the concept of the internal demagnetizing field of a magnetized body. In \n\nFigure 4.4a we show the magnetic vectors within a ferromagnetic crystal. These produce a magnetic field external to the crystal that is proportional to the magnetic moment (see Chapter 1). This external field is identical to a field produced by a set of free poles distributed over the surface of the crystal (\n\nFigure 4.4b). The surface poles do not just produce the external field, they also produce an internal field shown in \n\nFigure 4.4c. The internal field is known as the demagnetizing field (H_d). H_d is proportional to the magnetization of the body and is sensitive to the shape. For a simple sphere in \n\nFigure 4.4a and applied field condition shown in \n\nFigure 4.4d, the demagnetizing field is given by:\\mathbf{H}_d = -N \\mathbf{M},\n\nwhere N is a demagnetizing factor determined by the shape. In fact, the demagnetizing factor depends on the orientation of \\mathbf{M} within the crystal and therefore is a tensor (see Appendix for review of tensors). The more general equation is \\mathbf{H}_d = \\mathbf{N} \\cdot \\mathbf{M} where \\mathbf{H}_d and \\mathbf{M} are vectors and \\mathbf{N} is a 3 × 3 tensor. For now, we will simplify things by considering the isotropic case of a sphere in which \\mathbf{N} reduces to the single value scalar quantity N.\n\n\n\nFigure 4.4:a) Internal magnetizations within a ferromagnetic crystal. b) Generation of an identical external field from a series of surface monopoles. c) The internal “demagnetizing” field resulting from the surface monopoles. [Redrawn from \n\nO'Reilly (1984).] d) Surface monopoles on a sphere. e) Surface monopoles on an ellipse, with the magnetization parallel to the elongation. f) Demagnetizing field \\mathbf{H}_d resulting from magnetization M at angle \\theta from a axis in prolate ellipsoid.\n\nFor a sphere, the surface poles are distributed over the surface such that there are none at the “equator” and most at the “pole” (see \n\nFigure 4.4d). Potential field theory shows that the external field of a uniformly magnetized body is identical to that of a centered dipole moment of magnitude m=v M (where v is volume). At the equator of the sphere as elsewhere, \\mathbf{H}_d = -N\\mathbf{M}. But the external field at the equator is equal to the demagnetizing field just inside the body because the field is continuous across the body. We can find the equatorial (tangential) demagnetizing field at the equator by substituting in the equatorial colatitude \\theta=90° into H_{\\theta} from Chapter 1, so:H_d = -\\frac{m}{4\\pi r^3}.\n\nUsing the fact that magnetization (in units of Am^{-1}) is the moment (in units of Am^2) per unit volume (in units of m^3) and the volume of a sphere is \\frac{4}{3} \\pi r^3, we have:m=\\frac{4}{3} \\pi r^3 M,\n\nso substituting and solving for H_d we get H_d=-\\frac{1}{3} M, hence N=\\frac{1}{3}.\n\nDifferent directions within a non-spherical crystal will have different distributions of free poles (see \n\nFigure 4.4e,f). In fact, the surface density of free poles is given by \\sigma_m=\\mathbf{M}\\cdot \\hat{r}. Because the surface pole density depends on the direction of magnetization, so too will N. In the case of a prolate ellipsoid magnetized parallel to the elongation axis a (\n\nFigure 4.4e), the free poles are farther apart than across the grain, hence, intuitively, the demagnetizing field, which depends on 1/r^2, must be less than in the case of a sphere. Thus, N_a < \\frac{1}{3}. Similarly, if the ellipsoid is magnetized along b (\n\nFigure 4.4e), the demagnetizing field is stronger or N_b>\\frac{1}{3}.\n\nGetting back to the magnetostatic energy density, \\epsilon_m = -\\mathbf{M} \\cdot \\mathbf{B}, remember that \\mathbf{B} includes both the external field \\mathbf{H}_e and the internal demagnetizing field \\mathbf{H}_d = -\\mathbf{N}\\cdot\\mathbf{M}. Therefore, magnetostatic energy density from both the external and internal fields is given by:\\epsilon_{ms} = -\\mu_o \\mathbf{M} \\cdot \\mathbf{H}_e + \\frac{1}{2} \\mu_o \\mathbf{M} \\cdot \\mathbf{N} \\cdot \\mathbf{M}.\n\nThe two terms in \n\nEquation 4.10 are the by now familiar magnetostatic energy density \\epsilon_m, and the magnetostatic self energy density or the demagnetizing energy density \\epsilon_{d}. \\epsilon_d can be estimated by “building” a magnetic particle and considering the potential energy gained by each incremental volume dv as it is brought in (-\\mu_o \\mathbf{M} dv \\cdot \\mathbf{H}_d) and integrating. The \\frac{1}{2} appears in order to avoid counting each volume element twice and the v disappears because all the energies we have been discussing are energy densities — the energy per unit volume.\n\nFor the case of a uniformly magnetized sphere, we get back to the relation \\mathbf{H}_d = -N\\mathbf{M} and \\epsilon_d simplifies to:\\epsilon_d = -\\frac{1}{2} \\mu_o N M^2.\n\nIn the more general case of a prolate ellipsoid, \\mathbf{M} can be represented by the two components parallel to the a and b axes (see \n\nFigure 4.4f) with unit vectors parallel to them \\hat{a}, \\hat{b}. So, \\mathbf{M} = M\\cos \\theta  \\hat{a} + M\\sin \\theta \\hat{b}. Each component of \\mathbf{M} has an associated demagnetizing field \\mathbf{H}_d= -N_a M \\cos  \\theta \\hat{a} - N_b M \\sin \\theta \\hat{b} where N_a, N_b are the eigenvalues of the tensor \\mathbf{N} (the values of the demagnetizing tensor along the principal axes a and b). In this case, the demagnetizing energy can be written as:\\epsilon_d =-\\frac{1}{2} \\mu_o(N_a \\cos^2 \\theta + N_b \\sin^2 \\theta)M^2\n = -\\frac{1}{2} \\mu_o(N_a + (N_b-N_a)\\sin^2 \\theta)M^2\n = -\\frac{1}{2} \\mu_o(N_b\\sin^2 \\theta)M^2.\n\nIn an ellipsoid with three unequal axes a,b,c, N_a+N_b+N_c =1 (in SI; in cgs units the sum is 4\\pi). For a long needle-like particle, N_a\\simeq 0 and N_b = N_c \\simeq \\frac{1}{2}.\nA useful approximation for nearly spherical particles is N_a = \\frac{1}{3} [ 1 - \\frac{2}{5}(2 - \\frac{b}{a} - \\frac{c}{a} )] \n\nStacey & Banerjee (1974). For more spheroids, see \n\nNagata (1961) (p. 70) and for the general case, see \n\nDunlop & Özdemir (1997).\nIn the absence of an external field, the magnetization will be parallel to the long axis (\\theta=0) and the magnetostatic energy density (also known as the ‘self’ energy) is given by:\\epsilon_{ms}= -\\frac{1}{2} \\mu_o \\Delta N M^2=-\\frac{1}{2} \\mu_o N_c M^2.\n\nNote that the demagnetizing energy in \n\nEquation 4.12 has a uniaxial form, directionally dependent only on \\theta, with the constant of uniaxial anisotropy K_u = \\frac{1}{2} \\Delta N \\mu_o M^2. \\Delta N is the difference between the largest and smallest values of the demagnetizing tensor N_c-N_a.\n\nFor a prolate ellipsoid N_c=N_b and choosing for example a/c = 1.5 we find that N_a-N_c \\approx 0.16. The magnetization of magnetite is 480 kAm^{-1}, so K_u \\simeq 2.7 × 10^4 Jm^{-3}. This is somewhat larger than the absolute value of K_1 for magnetocrystalline anisotropy in magnetite (K_1= −1.35 × 10^{4} Jm^{-3}), so the magnetization for even slightly elongate grains will be dominated by uniaxial anisotropy controlled by shape. Minerals with low saturation magnetizations (like hematite) will not be prone to shape dominated magnetic anisotropy, however.","type":"content","url":"/chapter4#sect-shape","position":17},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Magnetic energy and magnetic stability","lvl2":"The magnetic energy of particles"},"type":"lvl3","url":"/chapter4#sect-coercivity","position":18},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl3":"Magnetic energy and magnetic stability","lvl2":"The magnetic energy of particles"},"content":"Paleomagnetists worry about how long a magnetization can remain fixed within a particle and we will begin to discuss this issue later in the chapter. It is worth pointing out here that any discussion of magnetic stability will involve magnetic anisotropy energy because this controls the energy required to change a magnetic moment from one easy axis to another. One way to accomplish this change is to apply a magnetic field sufficiently large that its magnetic energy exceeds the anisotropy energy. The magnetic field capable of flipping the magnetization of an individual uniformly magnetized particle (at saturation, or M_s) over the magnetic anisotropy energy barrier is the microscopic coercivity H_k. For uniaxial anisotropy (K=K_u) and for cubic magnetocrystalline anisotropy (K=K_1), microscopic coercivity is given by:H_k = \\frac{2 K_u}{\\mu_o M}   = \\frac{4}{3} \\frac{|K_1|}{\\mu_o M_s}.\n\nrespectively (see \n\nDunlop & Özdemir (1997) for a more complete derivation). For elongate particles dominated by shape anisotropy, H_k reduces to \\Delta NM. [Note that the units for coercivity as derived here are in Am^{-1}, although they are often measured using instruments calibrated in tesla. Technically, because the field doing the flipping is inside the magnetic particle and \\mathbf{B} (measured in tesla) depends on the magnetization \\mathbf{M} as well as the field \\mathbf{H}, coercivity should be written as \\mu_o H_k if the units are quoted in tesla.] Microscopic coercivity is another parameter with many names: flipping field, switching field, intrinsic coercivity and also more loosely, the coercive field and coercivity. We will come back to the topic of coercivity in Chapter 5.","type":"content","url":"/chapter4#sect-coercivity","position":19},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl2":"Magnetic domains"},"type":"lvl2","url":"/chapter4#magnetic-domains","position":20},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl2":"Magnetic domains"},"content":"So far we have been discussing hypothetical magnetic particles that are uniformly magnetized. Particles with strong magnetizations (like magnetite) have self energies that quickly become quite large because of the dependence on the square of the magnetization. We have been learning about several mechanisms that tend to align magnetic spins. In very small particles of magnetite (less than 60 nm for equant grains \n\nNagy et al. (2017)), exchange energy dominates and the spins are uniformly aligned — the particle is single domain (SD). In larger particles, the self energy increasingly competes with the exchange and magnetocrystalline energies, and crystals develop distinctly non-uniform states of magnetization.\n\n\n\nFigure 4.5:Micromagnetic simulations of remanent domain states in magnetite computed using MERRILL \n\nWilliams et al., 2024. The elongate particles have an aspect ratio (c/a) of 2.25 while the equant particles are equidimensional. The numbers above the grains correspond to the equivalent spherical volume diameters (which is effectively the diameter for the equant ones; and a way to succinctly summarize the grain length for the elongate ones). The arrows show local magnetization direction while the colors indicate alignment with magnetocrystalline easy axes. For the elongate grains, the 90 nm grain has single-domain behavoir\n\nThe 80 nm equant grain is in a single-domain state, while the For the equant grains, we see dominantly single-domain behavoir in the  flower states emerge above ~60 nm and vortex states above ~80 nm \n\nNagy et al., 2017\n\nWilliams et al., 2024\n\n(a,d) Single domain. (e) Flower/vortex transition. (b,c,f) Single-vortex states. . ; elongation shifts both thresholds to larger \n\nsizes.pro [From \n\nWilliams et al. (2024).]\n\nThere are multiple strategies for magnetic particles to reduce self energy. Numerical models (called micromagnetic models) can find internal magnetization configurations that minimize the energies discussed in the preceding sections. Modern micromagnetic codes such as MERRILL \n\nÓ Conbhuí et al., 2018 allow us to peer into the state of magnetization inside magnetic particles. \n\nFigure 4.5 shows the progression of remanent states as particle size increases, computed using MERRILL \n\nWilliams et al., 2024. In the smallest grains, the exchange energy overwhelms the self energy and the magnetization is nearly uniform — the SD state. As equant grains grow beyond about 60 nm, the self energy becomes large enough to perturb the magnetization near particle surfaces, causing spins at the edges to splay outward while the interior remains broadly aligned. This is the flower state (\n\nFigure 4.5e), so named because the fanning spins at the surface resemble the opening of a flower. By about 80 nm, the self energy is large enough that the magnetization curls into a closed loop, forming a vortex state (\n\nFigure 4.5b,c,f) with a narrow core of spins \n\nNagy et al., 2017. The net remanent moment of a vortex particle is carried almost entirely by this core, since the curling spins surrounding it largely cancel. In elongated grains, shape anisotropy aligns both the vortex core and the overall remanence along the long axis of the particle (\n\nFigure 4.5a–c). The curling magnetization dramatically reduces the external field of the particle (and hence its self energy), while the exchange energy cost remains modest because neighboring spins change direction only gradually. In the smallest particles, the spins would have to curl too tightly and the exchange energy cost keeps them uniformly magnetized in the SD state. Particles with vortex cores share many properties of SD grains — in particular, they can carry extremely stable magnetic remanence with relaxation times exceeding the age of the Solar System \n\nNagy et al., 2017 — which has led to them being termed pseudo-single domain (PSD) particles.\n\nAs particles grow larger (>~200 nm), they break into multiple magnetic domains, separated by narrow zones of rapidly changing spin directions called domain walls. Magnetic domains can take many forms. We illustrate a few in \n\nFigure 4.6. The uniform case (single domain) is shown in \n\nFigure 4.6a. The external field is very large because the free poles are far apart (at opposite ends of the particle). When the particle organizes itself into two domains (\n\nFigure 4.6b), the external field is reduced by about a factor of two. In the case of four lamellar domains (\n\nFigure 4.6c), the external field is quite small. The introduction of closure domains as in \n\nFigure 4.6d reduces the external field to nothing.\n\n\n\nFigure 4.6:A variety of domain structures of a given particle. a) Uniformly magnetized (single domain). [Adapted from \n\nTipler (1999).] b) Two domains. c) Four domains in a lamellar pattern. d) Essentially two domains with two closure domains.\n\nAs you might already suspect, domain walls are not “free”, energetically speaking. If, as in \n\nFigure 4.7a, the spins simply switch from one orientation to the other abruptly, the exchange energy cost would be very high. One way to get around this is to spread the change over several hundred atoms, as sketched in \n\nFigure 4.7b. The wall width \\delta is wider and the exchange energy price is much less. However, there are now spins in unfavorable directions from a magnetocrystalline point of view (they are in “hard” directions). Exchange energy therefore favors wider domain walls while magnetocrystalline anisotropy favors thin walls. With some work (see e.g., \n\nDunlop & Özdemir (1997), pp. 117–118), it is possible to come up with the following analytical expressions for wall width (\\delta_w) and wall energy density (\\epsilon_w):\\delta_w = \\pi \\left(\\frac{A}{K}\\right)^{1/2}, \\quad \\epsilon_w = 2\\pi (AK)^{1/2},\n\nwhere A is the exchange constant (see \n\nSection 4.1.1) and K is the magnetic anisotropy constant (e.g., K_u or K_1). Note that \\epsilon_w is the energy density per unit wall area, not per volume. Plugging in values for magnetite given previously we get \\delta_w = 90 nm and \\epsilon_w = 3×10^{-3} Jm^{-2}.\n\n\n\nFigure 4.7:Examples of possible domain walls. a) There is a 180° switch from one atom to the next. The domain wall is very thin, but the exchange price is very high. b) There is a more gradual switch from one direction to the other [note: each arrow represents several 10’s of unit cells]. The exchange energy price is lower, but there are more spins in unfavorable directions from a magnetocrystalline point of view.\n\nIn \n\nFigure 4.8 we plot the self energy (\n\nEquation 4.13) and the wall energy (\\epsilon_w from \n\nEquation 4.15) for spheres of magnetite. We see that the wall energy in particles with diameters of some 50 nm is less than the self energy, yet the width of the walls is about twice as wide as that. So the smallest wall is really more like the vortex state and it is only for particles larger than a few tenths of a micron that true domains separated by discrete walls can form. Interestingly, this is precisely what is predicted from micromagnetic modelling (e.g., \n\nFigure 4.5).\n\n\n\nFigure 4.8:Comparison of “self” energy versus the energy of the domain wall in magnetite spheres as a function of particle size.\n\nHow can we test the theoretical predictions of domain theory? Do domains really exist? Are they the size and shape we expect? Are there as many as we would expect? In order to address these questions we require a way of imaging magnetic domains. \n\nBitter (1931) devised a way for doing just that. Magnetic domain walls are regions with large stray fields (as opposed to domains in which the spins are usually parallel to the sides of the crystals to minimize stray fields). In the Bitter technique magnetic colloid material is drawn to the regions of high field gradients on highly polished sections allowing the domain walls to be observed (see \n\nFigure 4.9a).\n\n\n\nFigure 4.9:a) Bitter patterns from an oriented polished section of magnetite. [Figure from \n\nÖzdemir et al. (1995).] b) Domains revealed by longitudinal magneto-optical Kerr effect. [Image from \n\nHeider & Hoffmann (1992).] c–e) Magnetic force microscopy technique. [Images from \n\nFeinberg et al. (2005).] c) Image of topography of surface of a magnetite inclusion in a non-magnetic matrix. d) Magnetic image from MFM technique. e) Interpretation of magnetizations of magnetic domains.\n\nThere are by now other ways of imaging magnetic domains. We will not review them all here, but will just highlight the ways that are more commonly used in rock and paleomagnetism. The magneto-optical Kerr effect or MOKE uses the interaction between polarized light and the surface magnetic field of the target. The light interacts with the magnetic field of the sample which causes a small change in the light’s polarization and ellipticity. The changes are detected by reflecting the light into nearly-crossed polarizers. The longitudinal Kerr effect can show the alignment of magnetic moments in the surface plane of the sample. Domains with different magnetization directions show up as lighter or darker regions in the MOKE image (see \n\nFigure 4.9b.)\n\nAnother common method for imaging magnetic domains employs a technique known as magnetic force microscopy. Magnetic force microscopy (MFM) uses a scanning probe microscope that maps out the vertical component of the magnetic fields produced by a highly polished section. The measurements are made with a cantilevered magnetic tip that responds to the magnetic field of the sample. In practice, the measurements are made in two passes. The first establishes the topography of the sample (\n\nFigure 4.9c). Then in the second pass, the tip is raised slightly above the surface and by subtracting the “topographic only” signal the attraction of the magnetic surface can be mapped (\n\nFigure 4.9d). \n\nFigure 4.9e shows an interpretation of the magnetic directions of different magnetic domains.","type":"content","url":"/chapter4#magnetic-domains","position":21},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl2":"Thermal energy"},"type":"lvl2","url":"/chapter4#sect-tau","position":22},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl2":"Thermal energy"},"content":"We have gone some way toward answering the questions posed at the beginning of the chapter. We see now that anisotropy energy, with contributions from crystal structure, shape and stress, inhibits changes in the magnetic direction thereby offering a possible mechanism whereby a given magnetization could be preserved for posterity. We also asked the question of what allows the magnetization to come into equilibrium with the applied magnetic field in the first place; this question requires a little more work to answer. The key to this question is to find some mechanism which allows the moments to “jump over” magnetic anisotropy energy barriers. One such mechanism is thermal energy E_T, which was given in Chapter 3 as:E_T = kT.\n\nWe know from statistical mechanics that the probability P of finding a grain with a given thermal energy sufficient to overcome some anisotropy energy E_a and change from one easy axis to another is P=\\exp (-E_a/E_T ). Depending on the temperature, such grains may be quite rare, and we may have to wait some time t for a particle to work itself up to jumping over the energy barrier.\n\nImagine a block of material containing a random assemblage of magnetic particles that are for simplicity uniformly magnetized and dominated by uniaxial anisotropy. Suppose that this block has some initial magnetization M_o and is placed in an environment with no ambient magnetic field. Anisotropy energy will tend to keep each tiny magnetic moment in its original direction and the magnetization will not change over time. At some temperature, certain grains will have sufficient energy to overcome the anisotropy energy and flip their moments to the other easy axis. As a result, over time, the magnetic moments will become random. Therefore, the magnetization as a function of time in this simple scenario will decay to zero. The equation governing this decay is:M(t) = M_o \\exp \\left(\\frac{-t}{\\tau}\\right),\n\nwhere t is time and \\tau is an empirical constant called the relaxation time. Relaxation time is the time required for the remanence to decay to 1/e of M_o. This equation is the essence of what is called Néel theory (see, e.g., \n\nNéel (1955)). The value of \\tau depends on the competition between magnetic anisotropy energy and thermal energy. It is a measure of the probability that a grain will have sufficient thermal energy to overcome the anisotropy energy and switch its moment. Therefore in zero external field:\\tau = \\frac{1}{C} \\exp \\frac{Kv}{kT},\n\nwhere C is a frequency factor with a value of something like \n\n1010 s^{-1}. The anisotropy energy is given by the dominant anisotropy parameter K (either K_u, K_1, or \\lambda) times the grain volume v.\n\nThus, the relaxation time is proportional to anisotropy constant and volume, and is inversely related to temperature. Relaxation time \\tau varies rapidly with small changes in v and T. To see how this works, we can take K_u for slightly elongate cuboids of magnetite (length to width ratio of 1.3 to 1) and evaluate relaxation time as a function of particle width (see \n\nFigure 4.10). There is a sharp transition between grains with virtually no stability (\\tau is on the order of seconds) and grains with stabilities of billions of years.\n\n\n\nFigure 4.10:Relaxation time in magnetite ellipsoids as a function of grain width in nanometers (all length to width ratios of 1.3:1.)\n\nGrains with \\tau \\simeq 10^2 - 10^3 seconds have sufficient thermal energy to overcome the anisotropy energy frequently and are unstable on a laboratory time scale. In zero field, these grain moments will tend to rapidly become random, and in an applied field, also tend to align rapidly with the field. The net magnetization is related to the field by a Langevin function (see Chapter 3). Therefore, this behavior is quite similar to paramagnetism, hence these grains are called superparamagnetic (SP). Such grains can be distinguished from paramagnets, however, because the field required to saturate the moments is typically much less than a tesla, whereas that for paramagnets can exceed hundreds of tesla.","type":"content","url":"/chapter4#sect-tau","position":23},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl2":"Putting it all together"},"type":"lvl2","url":"/chapter4#putting-it-all-together","position":24},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl2":"Putting it all together"},"content":"We are now in a position to pull together all the threads we have considered in this chapter and make a plot of what sort of magnetic particles behave as superparamagnets, which should be single domain and which should be multi-domain according to our simple theories. We can estimate the superparamagnetic to single domain threshold for magnetite as a function of particle shape by finding the length (2a) that gives a relaxation time of 100 seconds as a function of width-to-length ratio (b/a) for parallelepipeds of magnetite (heavy blue line in \n\nFigure 4.11). To do this, we follow the logic of \n\nEvans & McElhinny (1969) and \n\nButler & Banerjee (1975). In this Evans diagram, we estimated relaxation time using \n\nEquation 4.18, plugging in values of K as either the magnetocrystalline effective anisotropy constant (\\frac{1}{12}K_1) or the shape anisotropy constant (\\frac{1}{2} \\Delta N \\mu_o M^2), whichever was less. We also show the curve at which relaxation time is equal to 1 Gyr, reinforcing the point that very small changes in crystal size and shape make profound differences in relaxation time.\nThe figure also predicts the boundary between the single domain field and the two domain field, when the energy of a domain wall is less than the self energy of a particle that is uniformly magnetized. This can be done by evaluating wall energy with \n\nEquation 4.15 for a wall along the length of a parallelepiped and area (4ab) as compared to the self energy (\\frac{1}{2} \\mu_o N_a M^2v) for a given length and width-to-length ratio. When the wall energy is less than the self energy, we are in the two domain field.\n\n\n\nFigure 4.11:Expected domain states for various sizes and shapes of parallelepipeds of magnetite at room temperature. The parameters a and b are as in \n\nFigure 4.4e. Heavy blue (thin green) line is the superparamagnetic threshold assuming a relaxation time of 100s (1 Gyr). Dashed red line marks the SD/MD threshold size. Calculations done using assumptions and parameters described in the text.\n\nFigure 4.11 suggests that there is virtually no SD stability field for equant magnetite; particles are either SP or MD (multi-domain). As the width-to-length ratio decreases (the particle gets longer), the stability field for SD magnetite expands. Of course micromagnetic modelling shows that there are several transitional states between uniform magnetization (SD) and MD, i.e. the flower and vortex remanent states (see \n\nFabian et al. (1996)), but \n\nFigure 4.11 has enormous predictive power and the version of \n\nButler & Banerjee (1975) (which is slightly different in detail) continues to be used extensively. It is worth pointing out however, that the size at which domain walls appear in magnetite is poorly constrained because it depends critically on the exact shape of the particle, its state of stress and even its history of exposure to past fields. Estimates in the literature range from as small as 20 nm to much larger (up to 100 nm) depending on how the estimates are made. Nonetheless, it is probably true that truly single domain magnetite is quite rare in nature, yet more complicated states are difficult to treat theoretically. Therefore most paleomagnetic studies rely on predictions made for single domain particles.\n\nSupplemental Reading: \n\nDunlop & Özdemir (1997), Chapters 2.8 and 5.","type":"content","url":"/chapter4#putting-it-all-together","position":25},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl2":"Problems"},"type":"lvl2","url":"/chapter4#problems","position":26},{"hierarchy":{"lvl1":"Chapter 4: Magnetic Anisotropy and Domains","lvl2":"Problems"},"content":"Problem 1\n\nAssume that the magnetization of magnetite is about 4.8 × 10^5 Am^{-1}. Using values for other parameters from the text, write a Python program to calculate the following:\n\na) Self energy (or magnetostatic energy) for a sphere 1, 10 and 100 \\mum in diameter. [Hint: see \n\nEquation 4.13 for the ‘self’ energy density. Also, remember the difference between energy and energy density!]\\epsilon_{ms}= -\\frac{1}{2} \\mu_o N_c M^2.\n\nb) Magnetostatic (shape) anisotropy energy for an ellipsoid whose principal semi-axis is 1 \\mum and whose major and minor semi-axes are each 0.25 \\mum. You may use the “nearly spherical” approximation in the text.\n\nc) The critical radius of a sphere at which wall energy equals self energy.\n\nProblem 2\n\nCalculate grain diameter for magnetite spheres with \\taus of 10^{-1}, 10, 10^2, 10^3, 10^5, 10^9, 10^{15} seconds. Use values for Boltzmann’s constant, C (the frequency factor) and |K_1| at room temperature (300K).\n\nProblem 3 [From Jeff Gee]\n\na) Consider a highly elongate rod (needle-shaped grain) of magnetite. Explain why the demagnetizing factor along the long axis of the rod is about zero while that across the long axis is about one half.\n\nb) The file Chapter_4/prolate.txt gives the values of demagnetizing factors for a prolate ellipsoid (with axes a > b = c). For an elongate rod of magnetite with range of aspect ratios (AR = c:b) provided in the table, plot the magnetostatic self energy density in the absence of an external field. Use this plot to estimate the aspect ratio at which shape anisotropy will be equal to that of magnetocrystalline anisotropy (use a value of K_1 at room temperature (300K) of −1.43 × 10^4 J/m^3).\n\nc) What is the maximum microscopic coercivity (H_k) for such an elongate grain of magnetite (assume an infinitely long grain)? Coercivities are more commonly reported in units of T so provide this corresponding value as well.","type":"content","url":"/chapter4#problems","position":27},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis"},"type":"lvl1","url":"/chapter5","position":0},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis"},"content":"In \n\nChapter 4, we discussed the energies that control the state of magnetization within ferromagnetic particles. Particles will tend to find a configuration of internal magnetization directions that minimizes the energies (although meta-stable states with local energy minima or LEMs are a possibility). The longevity of a particular magnetization state has to do with the depth of the energy well that the magnetization is in and the energy available for hopping over barriers.\n\nThe ease with which particles can be coerced into changing their magnetizations in response to external fields can tell us much about the overall stability of the particles and perhaps also something about their ability to carry a magnetic remanence over the long haul. The concepts of long-term stability, incorporated into the concept of relaxation time and the response of the magnetic particles to external magnetic fields are therefore linked through the anisotropy energy constant K (see \n\nChapter 4) which dictates the magnetic response of particles to changes in the external field. This chapter will focus on the response of magnetic particles to changing external magnetic fields.","type":"content","url":"/chapter5","position":1},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl2":"The “flipping” field"},"type":"lvl2","url":"/chapter5#sect-flipping","position":2},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl2":"The “flipping” field"},"content":"Magnetic remanence is the magnetization in the absence of an external magnetic field. If we imagine a particle with a single “easy” axis — a so-called “uniaxial” particle with magnetic anisotropy constant K_u, the magnetic energy density (energy per unit volume) of a particle whose magnetic moment makes an angle \\theta to the easy axis direction (\n\nFigure 5.1a) can be expressed as:\\epsilon_a = K_u\\sin^2\\theta.\n\nAs the moment swings around with angle \\theta to the easy axis, the anisotropy energy density \\epsilon_a will change as sketched in \n\nFigure 5.1b. The energy minima are when \\theta is aligned parallel to the easy axis (an axis means either direction along the axis, so we pick one direction as being 0° and the other as 180°). In the absence of a magnetic field, the moment will lie along one of these two directions. [In reality, thermal energy will perturb this direction somewhat, depending on the balance of anisotropy to thermal energy, but for the present discussion, we are assuming that thermal energy can be neglected.]\n\n\n\nFigure 5.1:a) Sketch of a prolate spheroid magnetic particle (magnetite, elongation q = 2) with easy axis along the long dimension. In response to a magnetic field \\mathbf{B}, applied at an angle \\phi to the easy axis, the particle moment \\mathbf{m} rotates, making an angle \\theta with the easy axis. b) Variation of the anisotropy energy density \\epsilon_a = K_u\\sin^2\\theta as a function of \\theta for the particle with \\phi=45° as shown in a). The \\theta associated with the minimum energy is indicated by \\epsilon_{min}. B = 0 mT. c) Same as in b) but for B = 30 mT. Also shown are the interaction energy density \\epsilon_m=-M_s B\\cos (\\phi-\\theta) and the total energy density \\epsilon_t=\\epsilon_a+\\epsilon_m. d) Same as in c) but for B = 500 mT, showing how a strong applied field can dominate the anisotropy energy and shift the energy minimum toward the field direction.\n\nWhen an external field is applied at an angle \\phi to the easy axis (and an angle \\phi-\\theta with the magnetic moment; see \n\nFigure 5.1a), the magnetostatic interaction energy density \\epsilon_m given by the dot product of the magnetization and the applied field (\n\nEquation 4.2 in Chapter 4) or:\\epsilon_m = -\\mathbf{M} \\cdot \\mathbf{B} = -MB \\cos(\\phi-\\theta).\n\nThe two energy densities (\\epsilon_a and \\epsilon_m) are shown as the thin solid and dashed lines in \n\nFigure 5.1c for an applied field of 30 mT aligned with an angle of 45° to the easy axis. There is a competition between the anisotropy energy (tending to keep the magnetization parallel to the easy axis) and the interaction energy (tending to line the magnetization up with the external magnetic field). Assuming that the magnetization is at saturation, we get the total energy density of the particle to be:\\epsilon_t = K_u\\sin^2\\theta - M_s B \\cos (\\phi-\\theta).\n\nThe total energy density \\epsilon_t is shown as the heavy solid line in \n\nFigure 5.1c.\n\nThe magnetic moment of a uniaxial single domain grain will find the angle \\theta that is associated with the minimum total energy density (\\epsilon_{min}; see \n\nFigure 5.1b,c). For low external fields, \\theta will be closer to the easy axis and for higher external fields (e.g., 30 mT; \n\nFigure 5.1c), \\theta will be closer to the applied field direction (\\phi).\n\nThe interactive visualization below demonstrates Stoner-Wohlfarth magnetization reversal for a prolate spheroid magnetite particle (aspect ratio q = 1.5). Use the slider to gradually increase the applied field and observe how the energy landscape evolves with the initial magnetization staying in a local energy minima until the magnetization flips. This flip happens the the energy barrier goes away which corresponds to when the second derivative of the total energy curve goes to zero.\n\nfrom IPython.display import HTML\nfrom pathlib import Path\nimport base64\n\n# Read the HTML widget file\nwidget_path = Path('..') / 'figures' / 'chapter5' / 'flipping_field_widget.html'\nwith open(widget_path, 'r', encoding='utf-8') as f:\n    html_content = f.read()\n\n# Encode as base64 data URI and embed in iframe\nhtml_b64 = base64.b64encode(html_content.encode('utf-8')).decode('utf-8')\niframe_html = f'''\n<iframe\n    src=\"data:text/html;base64,{html_b64}\"\n    width=\"700\"\n    height=\"720\"\n    frameborder=\"0\"\n    style=\"border: 1px solid #ddd;\">\n</iframe>\n'''\nHTML(iframe_html)\n\n\n\nWhen a magnetic field that is large enough to overcome the anisotropy energy is applied in a direction opposite to the magnetization vector, the moment will jump over the energy barrier and stay in the opposite direction when the field is switched off. The field necessary to accomplish this feat is called the flipping field (\\mu_oH_f) (also sometimes the “switching field”). [Note the change to the use of H for internal fields where M cannot be considered zero.] We introduced this parameter in Chapter 4 (see \n\nEquation 4.14) as the microscopic coercivity. \n\nStoner & Wohlfarth (1948) showed that the flipping field can be found from the condition that d\\epsilon_t/d\\theta = 0 and d^2\\epsilon_t/d\\theta^2 = 0. We will call this the “flipping condition”. The necessary equations can be found by differentiating \n\nEquation 5.3:\\frac{d\\epsilon}{d\\theta} = 2 K_u \\sin \\theta \\cos \\theta - M_s B \\sin (\\phi - \\theta),\n\nand again\\frac{d^2 \\epsilon}{d\\theta^2} = 2 K_u \\cos (2\\theta) + M_s B \\cos (\\phi - \\theta).\n\nSolving these two equations for B and substituting \\mu_oH for B, we get after some trigonometric trickery:\\mu_o H_f = \\frac{2K_u}{M_s} \\frac{(1-t^2 + t^4)^{1/2}}{1 + t^2} = \\frac{2K_u}{M_s} \\frac{1}{(\\cos^{2/3} \\phi + \\sin^{2/3} \\phi)^{3/2}},\n\nwhere t= \\tan^{1/3} \\phi. In this equation, \\phi is the angle between the applied field and the easy axis direction opposite to m.\n\nNow we can derive the so-called “microscopic coercivity” (H_k) introduced in \n\nSection 4.1.6 in Chapter 4. Microscopic coercivity is the maximum flipping field for a particle. When magnetic anisotropy of a particle is dominated by uniaxial anisotropy constant K_u and \\phi is zero (antiparallel to the easy direction nearest the moment), \\mu_o H_k = 2K_u/M_s. Using the values appropriate for magnetite (K_u = 1.4 × 10^4 Jm^{-3} and M_s = 480 kAm^{-1}) we get \\mu_o H_k = 58 mT. To see why this would indeed result in a flipped moment, we visualize the behavior of \n\nEquations 5.3 – \n\n5.5 in the interactive \n\nNotebook-code. When the applied field reaches the flipping field, the minimum in total energy \\epsilon_t occurs at an angle of \\theta = 180° (the upper panel) and the first and second derivatives satisfy the flipping condition by having a common zero crossing at the occupied state (the lower panel). At lower field values (e.g., 30 mT), the flipping condition is not met and the magnetization remains trapped in its initial orientation.\n\n\n\nFigure 5.2:The flipping field \\mu_oH_f required to irreversibly switch the magnetization vector from one easy direction to the other in a single domain particle dominated by uniaxial anisotropy. Note that \\phi is the angle with the easy axis, but must be the opposite direction from \\mathbf{m}.\n\nThe flipping condition depends not only on the applied field magnitude but also on the direction that it makes with the easy axis (see \\mu_oH_f versus \\phi in \n\nFigure 5.2). When \\phi is parallel to the easy axis (zero) (and anti-parallel to \\mathbf{m}), \\mu_oH_f is 58 mT as we found before. \\mu_oH_f drops steadily as the angle between the field and the easy axis increases until an angle of 45° when \\mu_oH_f starts to increase again. According to \n\nEquation 5.6, \\mu_oH_f is undefined when \\phi = 90°, so when the field is applied at right angles to the easy axis, there is no field sufficient to flip the moment.","type":"content","url":"/chapter5#sect-flipping","position":3},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl2":"Hysteresis loops"},"type":"lvl2","url":"/chapter5#hysteresis-loops","position":4},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl2":"Hysteresis loops"},"content":"In this section we will develop the theory for predicting the response of substances to the application of external fields, in experiments that generate hysteresis loops. We will define a number of parameters which are useful in rock and paleomagnetism.\n\nLet us begin by considering what happens to single particles when subjected to applied fields in the cycle known as the hysteresis loop. From the last section, we know that when a single domain, uniaxial particle is subjected to an increasing magnetic field the magnetization is gradually drawn into the direction of the applied field. If the flipping condition is not met, then the magnetization will return to the original direction when the magnetic field is removed. If the flipping condition is met, then the magnetization undergoes an irreversible change and will be in the opposite direction when the magnetic field is removed.","type":"content","url":"/chapter5#hysteresis-loops","position":5},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl3":"Uniaxial anisotropy","lvl2":"Hysteresis loops"},"type":"lvl3","url":"/chapter5#sect-uniaxial","position":6},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl3":"Uniaxial anisotropy","lvl2":"Hysteresis loops"},"content":"Imagine a single domain particle with uniaxial anisotropy. Because the particle is single domain, the magnetization is at saturation and, in the absence of an applied field is constrained to lie along the easy axis. Now suppose we apply a magnetic field in the opposite direction (see track #1 in \n\nFigure 5.3a). When B reaches \\mu_oH_f in magnitude, the magnetization flips to the opposite direction (track #2 in \n\nFigure 5.3) and will not change further regardless of how high the field goes. The field then is decreased to zero and then increased along track #3 in \n\nFigure 5.3 until \\mu_oH_f is reached again. The magnetization then flips back to the original direction (track #4 in \n\nFigure 5.3a).\n\nApplying fields at arbitrary angles to the easy axis results in loops of various shapes (see \n\nFigure 5.3b). As \\phi approaches 90°, the loops become thinner. Remember that the flipping fields for \\phi = 22° and \\phi = 70° are similar (see \n\nFigure 5.2) and are lower than that when \\phi=0°, but the flipping field for \\phi = 90° is infinite, so that “loop” is closed and completely reversible.\n\n\n\nFigure 5.3:a) Moment measured for the particle (\\phi=0°) with applied field starting at 0 mT and increasing in the opposite direction along track #1. When the flipping field \\mu_oH_f is reached, the moment switches to the other direction along track #2. The field then switches sign and decreases along track #3 to zero, then increases again to the flipping field. The moment flips and the field increases along track #4. b) The component of magnetization parallel to +B_{max} versus B for field applied with various angles \\phi.\n\nBefore we go on, it is useful to consider for a moment how hysteresis measurements are made in practice. Measurements of magnetic moment m as a function of applied field B are made on a variety of instruments, such as a vibrating sample magnetometer (VSM) or alternating gradient force magnetometer (AGFM). In the latter, a specimen is placed on a thin stalk between pole pieces of a large magnet. There is a probe mounted behind the specimen that measures the applied magnetic field. There are small coils on the pole pieces that modulate the gradient of the applied magnetic field (hence alternating gradient force). The specimen vibrates in response to changing magnetic fields and the amplitude of the vibration is proportional to the moment in the axis of the applied field direction. The vibration of the specimen stalk is measured and calibrated in terms of magnetic moment. The magnetometer is only sensitive to the induced component of \\mathbf{m} parallel to the applied field \\mathbf{B}_o, which is m_{||}= m \\cos \\phi (because the off axis terms are squared and very small, hence can be neglected.) In the hysteresis experiment, therefore, the moment parallel to the field m_{||} is measured as a function of applied field B.\n\n\n\nFigure 5.4:a) Net response of a random assemblage of uniaxial single domain particles. Snap shots of magnetization states (squares labelled 1 to 4) for representative particles are shown in the balloons labelled State 1–4. The initial demagnetized state is “State 1”. The initial slope as the field is increased from zero is the low-field susceptibility \\chi_{lf}. If the field returns to zero after some flipping fields have been exceeded, there is a net isothermal remanence (IRM). When all the moments are parallel to the applied field (State 2), the magnetization is at saturation M_s. When the field is returned to zero, the magnetization is a saturation remanence (M_r; State 3). When the field is applied in the opposite direction and has remagnetized half the moments (State 4), the field is the bulk coercive field \\mu_oH_c. When a field is reached that when reduced to zero leaves zero net remanence, that field is the coercivity of remanence (here labelled \\mu_oH_{cr}'). b) Curve obtained by subtracting the ascending curve in a) from the descending curve. The field at which half the moments have flipped, leaving a magnetization of one half of saturation is another measure of the coercivity of remanence, here labelled \\mu_oH_{cr}.\n\nIn rocks with an assemblage of randomly oriented particles with uniaxial anisotropy, we would measure the sum of all the millions of tiny individual loops. A specimen from such a rock would yield a loop similar to that shown in \n\nFigure 5.4a. If the field is first applied to a demagnetized specimen, the initial slope is the (low field) magnetic susceptibility (\\chi_{lf}) first introduced in Chapter 1. From the treatment in \n\nSection 5.1 it is possible to derive the equation \\chi_{lf} = \\mu_o M_s^2/3K_u for this initial (ferromagnetic) susceptibility (for more, see \n\nO'Reilly (1984)).\n\nIf the field is increased beyond the flipping field of some of the magnetic grains and returned to zero, the net remanence is called an isothermal remanent magnetization (IRM). If the field is increased to +B_{max}, all the magnetizations are drawn into the field direction and the net magnetization is equal to the sum of all the individual magnetizations and is the saturation magnetization M_s. When the field is reduced to zero, the moments relax back to their individual easy axes, many of which are at a high angle to the direction of the saturating field and cancel each other out. A loop that does not achieve a saturating field (red in \n\nFigure 5.4a) is called a minor hysteresis loop, while one that does is called the outer loop.\n\n\n\nFigure 5.5:Heavy green line: initial behavior of demagnetized specimen as applied field ramps up from zero field to a saturating field. The initial slope is the initial or low-field susceptibility \\chi_{lf}. After saturation is achieved the slope is the high-field susceptibility \\chi_{hf} which is the non-ferromagnetic contribution, in this case the paramagnetic susceptibility (because \\chi_{hf} is positive.) The dashed blue line is the hysteresis loop after the paramagnetic slope has been subtracted. Saturation magnetization M_s is the maximum value of magnetization after slope correction. Saturation remanence M_r is the value of the magnetization remaining in zero applied field. Coercivity (\\mu_o H_c) and coercivity of remanence \\mu_oH_{cr}' are as in \n\nFigure 5.4a.\n\nThe net remanence after saturation is termed the saturation remanent magnetization M_r (and sometimes the saturation isothermal remanence sIRM). For a random assemblage of single domain uniaxial particles, M_r/M_s = 0.5. The field necessary to reduce the net moment to zero is defined as the coercive field (\\mu_oH_c) (or coercivity).\n\nThe coercivity of remanence \\mu_o H_{cr} is defined as the magnetic field required to irreversibly flip half the magnetic moments (so the net remanence after application of a field equal to -\\mu_oH_{cr} to a saturation remanence is 0). The coercivity of remanence is always greater than or equal to the coercivity and the ratio H_{cr}/H_c for our random assemblage of uniaxial SD particles is 1.09 \n\nWohlfarth (1958). Here we introduce two ways of estimating coercivity of remanence, illustrated in \n\nFigure 5.4. If, after taking the field up to some saturating field +B_{max}, one first turned the field off (the descending curve), then increased the field in the opposite direction to the point labeled \\mu_oH'_{cr}, and one were to then switch the field off again, the magnetization would follow the dashed curve up to the origin. For single domain grains, the dashed curve would be parallel to the lower curve (the ascending curve). So, if one only measured the outer loop, one could estimate the coercivity of remanence by simply tracing the curve parallel to the lower curve (dashed line) from the origin to the point of intersection with the upper curve (circled in \n\nFigure 5.4a). This estimate is only valid for single domain grains, hence the prime in \\mu_oH_{cr}'.\n\nAn alternative means of estimating coercivity of remanence is to use a so-called \\Delta M curve \n\nJackson et al. (1988) which is obtained by subtracting the ascending loop from the descending loop (see \n\nFigure 5.4b). When all the moments are flipped into the new field, the ascending and descending loops join together and \\Delta M is 0. \\Delta M is at 50% of its initial value at the field at which half the moments are flipped (the definition of coercivity of remanence); this field is here termed \\mu_oH_{cr}.","type":"content","url":"/chapter5#sect-uniaxial","position":7},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl3":"Magnetic susceptibility","lvl2":"Hysteresis loops"},"type":"lvl3","url":"/chapter5#sect-chi","position":8},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl3":"Magnetic susceptibility","lvl2":"Hysteresis loops"},"content":"Figure 5.4a is the loop created in the idealized case in which only uniaxial ferromagnetic particles participated in the hysteresis measurements; in fact the curve is entirely theoretical. In “real” specimens there can be paramagnetic, diamagnetic AND ferromagnetic particles and the loop may well look like that shown in \n\nFigure 5.5. The initial slope of a hysteresis experiment starting from a demagnetized state in which the field is ramped from zero up to higher values is the low field magnetic susceptibility or \\chi_{lf} (see \n\nFigure 5.5). If the field is then turned off, the magnetization will return again to zero. But as the field increases past the lowest flipping field, the remanence will no longer be zero but some isothermal remanence. Once all particle moments have flipped and saturation magnetization has been achieved, the slope relating magnetization and applied field reflects only the non-ferromagnetic (paramagnetic and/or diamagnetic) susceptibility, here called high field susceptibility, \\chi_{hf}. In order to estimate the saturation magnetization and the saturation remanence, we must first subtract the high field slope. So doing gives us the blue dashed line in \n\nFigure 5.5 from which we may read the various hysteresis parameters illustrated in \n\nFigure 5.4b.","type":"content","url":"/chapter5#sect-chi","position":9},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl3":"Cubic anisotropy","lvl2":"Hysteresis loops"},"type":"lvl3","url":"/chapter5#cubic-anisotropy","position":10},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl3":"Cubic anisotropy","lvl2":"Hysteresis loops"},"content":"In the case of equant grains of magnetite for which magnetocrystalline anisotropy dominates, there are four easy axes, instead of two as in the uniaxial case (see \n\nChapter 4). The maximum angle \\phi between an easy axis and an applied field direction is 55°. Hence there is no individual loop that goes through the origin (see \n\nFigure 5.6). A random assemblage of particles with cubic anisotropy will therefore have a much higher saturation remanence. In fact, the theoretical ratio of M_r/M_s for such an assemblage is 0.87, as opposed to 0.5 for the uniaxial case \n\nJoffe & Heuberger (1974).\n\n\n\nFigure 5.6:Heavy lines: theoretical behavior of cubic grains of magnetite. Dashed lines are the responses along particular directions. Light grey lines: hysteresis response for single particles with various orientations with respect to the applied field. [Figure from \n\nTauxe et al. (2002).]","type":"content","url":"/chapter5#cubic-anisotropy","position":11},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl3":"Superparamagnetic particles","lvl2":"Hysteresis loops"},"type":"lvl3","url":"/chapter5#superparamagnetic-particles","position":12},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl3":"Superparamagnetic particles","lvl2":"Hysteresis loops"},"content":"In superparamagnetic (SP) particles, the total magnetic energy E_t=\\epsilon_tv (where v is volume) is balanced by thermal energy kT. This behavior can be modeled using statistical mechanics in a manner similar to that derived for paramagnetic grains in Chapter 3. In fact,\\frac{M}{M_s} = N\\left(\\coth \\gamma - \\frac{1}{\\gamma}\\right),\n\nwhere \\gamma = M_sBv/(kT) and N is the number of particles of volume v, is a reasonable approximation. The end result, \n\nEquation 5.7, is the familiar Langevin function from our discussion of paramagnetic behavior (see Chapter 3); hence the term “superparamagnetic” for such particles.\n\n\n\nFigure 5.7:a) The contribution of SP particles with saturation magnetization M_s and cubic edge length d. \\gamma = BM_s d^3/kT. There is no hysteresis. b) The field at which the magnetization reaches 90% of the maximum B_{90} is when M_s d^3/kT\\simeq 10. [Figure from \n\nTauxe et al. (1996).]\n\nThe contribution of SP particles for which the Langevin function is valid with given M_s and d is shown in \n\nFigure 5.7a. The field at which the population reaches 90% saturation B_{90} occurs at \\gamma \\sim 10. Assuming particles of magnetite (M_s = 480 kAm^{-1}) and room temperature (T=300 K), B_{90} can be evaluated as a function of d (see \n\nFigure 5.7b). Because of its inverse cubic dependence on d, B_{90} rises sharply with decreasing d and is hundreds of tesla for particles a few nanometers in size, approaching paramagnetic values. B_{90} is a quick guide to the SP slope (the SP susceptibility \\chi_{sp}) contributing to the hysteresis response and was used by \n\nTauxe et al. (1996) as a means of explaining distorted loops sometimes observed for populations of SD/SP mixtures. B_{90} (and \\chi_{sp}) is very sensitive to particle size with very steep slopes for the particles at the SP/SD threshold. The exact threshold size is still rather controversial, but \n\nTauxe et al. (1996) argue that it is ~20 nm.\n\nFor low magnetic fields, the Langevin function can be approximated as \\sim \\frac{1}{3} \\gamma. So we have:\\frac{M}{M_s} = \\frac{1}{3} \\frac{M_sBv}{kT}.\n\nIf we substitute \\mu_o H for B and rearrange this equation, we can get the superparamagnetic susceptibility \\chi_{sp} as:\\frac{M}{H} = \\frac{\\mu_o M_s^2v}{3kT}.\n\nWe can rearrange \n\nEquation 4.18 in Chapter 4 to solve for the volume at which a uniaxial grain passes through the superparamagnetic threshold we find:v_b = \\frac{kT \\ln (C\\tau)}{K_u}.\n\nFinally, we can substitute this volume into \n\nEquation 5.9 as the maximum volume of an SP grain, giving us:\\chi_{sp} = \\frac{\\mu_o M_s^2 \\ln (C\\tau)}{3K_u}.\n\nComparing this expression with that derived for ferromagnetic susceptibility in \n\nSection 5.2.1, we find that \\chi_{sp} is a factor of \\ln(C\\tau)\\simeq 27 larger than the equivalent single domain particle.","type":"content","url":"/chapter5#superparamagnetic-particles","position":13},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl3":"Particles with domain walls","lvl2":"Hysteresis loops"},"type":"lvl3","url":"/chapter5#sect-day","position":14},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl3":"Particles with domain walls","lvl2":"Hysteresis loops"},"content":"Moving domain walls around is much easier than flipping the magnetization of an entire particle coherently. The reason for this is the same as the reason that it is easier to move a rug by lifting up a small wrinkle and pushing that through the rug, than to drag the whole rug by the same amount. Because of the greater ease of changing magnetic moments in multidomain (MD) grains, they have lower coercive fields and saturation remanence is also much lower than for uniformly magnetized particles (see typical MD hysteresis loop in \n\nFigure 5.8a.)\n\n\n\nFigure 5.8:a) Typical hysteresis loop from a multi-domain assemblage. b) Theoretical behavior for the region in the inset to a). c) Theoretical relationship between M_r/M_s and H_{cr}/H_c for constant \\chi_iH_c/M_s = 0.1. Heavy red line is the theoretical linear mixing curve of SD/MD end-members. (See text.)\n\nThe key to understanding multi-domain hysteresis is the reduction in multi-domain magnetic susceptibility \\chi_{md} from “true” magnetic susceptibility (\\chi_i) because of self-demagnetization. The true susceptibility would be that obtained by measuring the magnetic response of a particle to the internal field \\mathbf{H}_i (applied field minus the demagnetizing field -N\\mathbf{M} — see \n\nSection 4.1.5; see Dunlop, 2002a \n\nDunlop (2002)). Recalling that the demagnetizing factor is N, the so-called screening factor f_s is (1 + N\\chi_i)^{-1} and \\chi_{md} = f_s \\chi_i. If we assume that \\chi_{md} is linear for fields less than the coercivity, then by definition \\chi_{md} = M_r/H_c (see \n\nFigure 5.8b). From this, we get:\\frac{M_r}{M_s} = \\chi_{md} \\frac{H_c}{M_s} = f_s \\chi_i \\frac{H_c}{M_s}.\n\nIn the case of multi-domain susceptibility, \\chi_i is much larger than \\chi_{md} and M_r = H_c/N.\n\nBy a similar argument, coercivity of remanence (H_{cr}) is suppressed by the screening factor which gives coercivity so:H_c = f_s H_{cr},\n\nfrom which we get the ratio:\\frac{H_{cr}}{H_c} = \\frac{1}{f_s}.\n\nPutting all this together leads us to the remarkable relationship noted by \n\nDay et al. (1977) (see also \n\nDunlop (2002)):\\frac{M_r}{M_s} \\cdot \\frac{H_{cr}}{H_c} = \\chi_i \\frac{H_c}{M_s}.\n\nWhen \\chi_i H_c/M_s is constant, \n\nEquation 5.15 is a hyperbola. For a single mineralogy, we can expect M_s to be constant, but H_c depends on grain size and the state of stress which are unlikely to be constant for any natural population of magnetic grains. Dunlop (2002a) \n\nDunlop (2002) argues that if the main control on susceptibility and coercivity is domain wall motion through a terrain of variable wall energies, then \\chi_i and H_c would be inversely related and gives a tentative theoretical value for \\chi_iH_c in magnetite of about 45 kAm^{-1}. This, combined with the value of M_s for magnetite of 480 kAm^{-1} gives a value for \\chi_i H_c/M_s \\sim 0.1. When anchored by the theoretical maximum for uniaxial single domain ratio of M_r/M_s = 0.5, we get the curve shown in \n\nFigure 5.8c. The major control on coercivity is grain size, so the trend from the SD limit down toward low M_r/M_s ratios is increasing grain size.\n\n\n\nFigure 5.9:Interaction of a domain wall and a void. When the void is within a domain, free poles create a magnetic field which creates a self energy (Chapter 4). When a domain wall intersects the void, the self-energy is reduced. There are no exchange or magnetocrystalline anisotropy energy terms within the void, so the wall energy is reduced.\n\nThere are several possible causes of variability in wall energy within a magnetic grain, for example, voids, lattice dislocations, stress, etc. The effect of voids is perhaps the easiest to visualize, so we will consider voids as an example of why wall energy varies as a function of position within the grain. We show a particle with lamellar domain structure and several voids in \n\nFigure 5.9. When the void occurs within a uniformly magnetized domain (left of figure), the void sets up a demagnetizing field as a result of the free poles on the surface of the void. There is therefore, a self-energy associated with the void. When the void is traversed by a wall, the free pole area is reduced, reducing the demagnetizing field and the associated self-energy. Therefore, the energy of the void is reduced by having a wall bisect it. Furthermore, the energy of the wall is also reduced, because the area of the wall in which magnetization vectors are tormented by exchange and magnetocrystalline energies is reduced. The wall gets a “free” spot if it bisects a void. The wall energy E_w therefore is lower as a result of the void.\n\n\n\nFigure 5.10:a) Schematic view of wall energy across a transect of a multi-domain grain. Inset: Placement of domain walls in the demagnetized state. [Domain observations from \n\nHalgedahl & Fuller (1983).] b–g) Schematic view of the magnetization process in MD grain shown in previous figure. b) Demagnetized state, c) in the presence of a saturating field, d) field lowered to +3 mT, e) remanent state, f) backfield of −3 mT, g) resulting loop. Inset shows detail of domain walls moving by small increments called Barkhausen jumps. [Domain wall observations from \n\nHalgedahl & Fuller (1983); schematic loop after \n\nO'Reilly (1984).]\n\nIn \n\nFigure 5.10, we show a sketch of a hypothetical transect of E_w across a particle. There are four LEMs labelled a–d. Domain walls will distribute themselves throughout the grain in order to minimize the net magnetization of the grain and also to try to take advantage of LEMs in wall energy.\n\nDomain walls move in response to external magnetic fields (see \n\nFigure 5.10b–g). Starting in the demagnetized state (\n\nFigure 5.10b), we apply a magnetic field that increases to saturation (\n\nFigure 5.10c). As the field increases, the domain walls move in sudden jerks as each successive local wall energy high is overcome. This process, known as Barkhausen jumps, leads to the stair-step like increases in magnetization (shown in the inset of \n\nFigure 5.10g). At saturation, all the walls have been flushed out of the crystal and it is uniformly magnetized. When the field decreases again, to say +3 mT (\n\nFigure 5.10d), domain walls begin to nucleate, but because the energy of nucleation is larger than the energy of denucleation, the grain is not as effective in cancelling out the net magnetization, hence there is a net saturation remanence (\n\nFigure 5.10e). The walls migrate around as a magnetic field is applied in the opposite direction (\n\nFigure 5.10f) until there is no net magnetization. The difference in nucleation and denucleation energies was called on by \n\nHalgedahl & Fuller (1983) to explain the high stability observed in some large magnetic grains.","type":"content","url":"/chapter5#sect-day","position":15},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl2":"Hysteresis of mixtures of SP, SD and MD grains"},"type":"lvl2","url":"/chapter5#sect-mixtures","position":16},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl2":"Hysteresis of mixtures of SP, SD and MD grains"},"content":"Day et al. (1977) popularized the use of diagrams like that shown in \n\nFigure 5.8c which are known as Day diagrams. They placed quasi-theoretical bounds on the plot whereby points with M_r/M_s ratios above 0.5 were labelled single domain (SD), and points falling in the box bounded by 0.5>M_r/M_s>0.05 and 1.5<H_{cr}/H_c < 5 were labelled pseudo-single domain (PSD). Points with M_r/M_s below 0.05 were labelled multi-domain (MD). This paper has been cited over 800 times in the literature and the Day plot still serves as the principal way that rock and paleomagnetists determined domain state and grain size.\n\nThe problem with the Day diagram is that virtually all paleomagnetically useful specimens yield hysteresis ratios that fall within the PSD box. In the early 90s, paleomagnetists began to realize that many things besides the trend from SD to MD behavior control where points fall on the Day diagram. \n\nPick & Tauxe (1994) pointed out that mixtures of SP and SD grains would have reduced M_r/M_s ratios and enhanced H_{cr}/H_c ratios. \n\nTauxe et al. (1996) modelled distributions of SP/SD particles and showed that the SP-SD trends always fall above those observed from MD particles (modelled in \n\nFigure 5.8c).\n\nDunlop (2002) argued that because M_r for SP grains is zero, the suppression of the ratio M_r/M_s is directly proportional to the volume fraction of the SP particles. Moreover, coercivity of remanence remains unchanged, as it is entirely due to the non-SP fraction. Deriving the relationship of coercivity, however, is not so simple. It depends on the superparamagnetic susceptibility (\\chi_{sp}), which in turn depends on the size of the particle and also the applied field (see \n\nParagraph). In his simplified approach, Dunlop could only use a single (small) grain size, whereas in natural samples, there will always be a distribution of grain sizes. It is also important to remember that volume goes as the cube of the radius and for a mixture to display any SP suppression of M_r/M_s almost all of the particles must be SP. It is impossible that these would all be of a single radius (say 10 or 15 nm); there must be a distribution of sizes. Moreover, \n\nDunlop (2002) neglected the complication in SP behavior as the particles reach the SD threshold size, whereas it is expected that many (if not most) natural samples containing both SP and SD grain sizes will have a large volume fraction of the largest SP sizes, making their neglect problematic.\n\nHysteresis ratios of mixtures of SD and MD particles will also plot in the “PSD” box. \n\nDunlop (2002) derived the theoretical behavior of such mixtures on the Day diagram. The key equations are 1) Equation 9 from \n\nDunlop (2002) which governs the behavior of the ratio M_r/M_s as a function of the volume fraction of single domain material (f_{SD}) and multi-domain material (f_{MD}):M_r/M_s = f_{SD} (M_r/M_s)_{SD} + f_{MD} (M_r/M_s)_{MD},\n\nEquation 10 from \n\nDunlop (2002) which governs the behavior of coercivity:H_c = \\frac{f_{SD} \\chi_{SD} (H_c)_{SD} + f_{MD} \\chi_{MD} (H_c)_{MD}}{f_{SD} \\chi_{SD} + f_{MD} \\chi_{MD}},\n\nand 3) Equation 11 from \n\nDunlop (2002) which governs the behavior of coercivity of remanence in SD/MD mixtures:H_{cr} = \\frac{f_{SD}( \\chi_r)_{SD} (H_{cr})_{SD} + f_{MD}( \\chi_r)_{MD} (H_{cr})_{MD}}{f_{SD} (\\chi_r)_{SD} + f_{MD} (\\chi_r)_{MD}}\n\nwhere \\chi_{SD} and \\chi_{MD} are the susceptibilities of the SD and MD fractions respectively and (\\chi_r)_{SD} and (\\chi_r)_{MD} are the M_r vs H_{cr} slopes of the SD and MD remanences respectively. What we need to calculate the SD/MD mixing curve are values for the various parameters for single domain and multi domain end-members. These were measured empirically for the MV1H bacterial magnetosomes (see Chapter 6) and commercial magnetite (041183 of Wright Company) by \n\nDunlop & Carter-Stiglitz (2006) and shown in the table below.\n\nSD/MD\n\nM_r/M_s\n\n\\chi (A m^{-1}T^{-1})\n\n\\chi_r (MA m^{-1}T^{-1})\n\n\\mu_o H_c (mT)\n\n\\mu_o H_{cr} (mT)\n\nSD\n\n0.5\n\n5.2\n\n4.55\n\n46\n\n52.5\n\nMD\n\n0.02\n\n4.14\n\n0.88\n\n5.56\n\n26.1\n\n: Empirical values for hysteresis parameters measured for single domain (SD) and multi-domain (MD) end-members of \n\nDunlop & Carter-Stiglitz (2006).\n\nUsing the linear mixing model of \n\nDunlop (2002), we plot the theoretical mixing curve predicted for these empirically constrained end-members as the heavy red line in \n\nFigure 5.8c.\n\nIf a population of SD particles are so closely packed as to influence one another, there will be an effect of particle interaction. This will also tend to suppress the M_r/M_s ratio, drawing the hysteresis ratios down into the PSD box. Finally, the PSD box could be populated by pseudo-single domain grains themselves. Here we will dwell for a moment on the meaning of the term “pseudo-single domain”, which has evolved from the original posed by \n\nStacey (1961) (see discussion in \n\nTauxe et al. (2002)). In an attempt to explain trends in TRM acquisition Stacey envisioned that irregular shapes caused unequal domain sizes, which would give rise to a net moment that was less than the single domain value, but considerably higher than the very low efficiency expected for large MD grains. The modern interpretation of PSD behavior is complicated micromagnetic structures that form between classic SD (uniformly magnetized grains) and MD (domain walls) such as the flower or vortex remanent states (see, e.g., \n\nFigure 4.5 in Chapter 4). Taking all these factors into account means that interpretation of the Day diagram is far from unique. The simple calculations of \n\nDunlop (2002) are likely to be inappropriate for almost all natural samples.","type":"content","url":"/chapter5#sect-mixtures","position":17},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl2":"First order reversal curves"},"type":"lvl2","url":"/chapter5#first-order-reversal-curves","position":18},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl2":"First order reversal curves"},"content":"Hysteresis loops can yield a tremendous amount of information yet much of this is lost by simply estimating the set of parameters M_r, M_s, H_{cr}, H_c, \\chi_i, \\chi_{hf}, etc. \n\nMayergoyz (1986) developed a method using what are known as First Order Reversal Curves or FORCs to represent hysteresis data. The most recent way of dealing with FORCs is that of \n\nHarrison & Feinberg (2008) which is illustrated in \n\nFigure 5.11. In the FORC experiment, a specimen is subjected to a saturating field, as in most hysteresis experiments. The field is lowered to some field \\mu_oH_a, then increased again through some value \\mu_oH_b to saturation (see \n\nFigure 5.11a). The magnetization curve between \\mu_o H_a and \\mu_oH_b is a “FORC”. A series of FORCs (see \n\nFigure 5.11b) can be generated to the desired resolution.\n\n\n\nFigure 5.11:a) Dashed line is the descending magnetization curve taken from a saturating field to some field H_a. Red line is the first order reversal curve (FORC) from H_a returning to saturation. At any field H_b>H_a there is a value for the magnetization M(H_a,H_b). b) A series of FORCs for a single domain assemblage of particles. At any point there are a set of related “nearest neighbor” measurements (circles in inset). A least-squares fit to \n\nEquation 5.19 can be determined for each point. c) A contour plot of the FORC density surface for data in b). Specimen is of the Tiva Canyon Tuff, courtesy of the Institute for Rock Magnetism.\n\nTo transform FORC data into some useful form, Harrison and Feinberg (2008) use a locally-weighted regression smoothing technique (LOESS). For a given measurement point P LOESS fits a second-order polynomial function of the formM(H_a,H_b)= a_1 + a_2H_a + a_3H_a^2 + a_4H_b +a_5H_b^2 +a_6H_aH_b,\n\nto the measured magnetization surface in a specified region (for example the circle shown in \n\nFigure 5.11b) where the a_i are fitted coefficients. The LOESS technique takes a user defined number of the nearest neighbors (see inset to \n\nFigure 5.11b) for an arbitrary shaped region over which the data are smoothed. The coefficient -a_6(H_a,H_b) is the FORC density at the point. A FORC diagram is the contour plot of the FORC densities, rotated such that \\mu_oH_c = \\mu_o(H_b-H_a)/2 and \\mu_oH_u = \\mu_o(H_a+H_b)/2. Please note that because H_a<H_b, data are only possible for positive H_c.\n\n\n\nFigure 5.12:a) A series of FORCs for a “pseudo-single domain” specimen. b) FORC diagram for data in a). Specimen is of the Stillwater Layered Intrusion, courtesy of J.S. Gee.\n\nImagine we travel down the descending magnetization curve (dashed line in \n\nFigure 5.11a) to a particular field \\mu_o H_a less than the smallest flipping field in the assemblage. If the particles are single domain, the behavior is reversible and the first FORC will travel back up the descending curve. It is only when |\\mu_o H_a| exceeds the flipping field of some of the particles that the FORC will trace a new curve on the inside of the hysteresis loop. In the simple single domain, non-interacting, uniaxial magnetite case, the FORC density in the quadrants where H_a and H_b are of the same sign must be zero. Indeed, FORC densities will only be non-zero for the range of flipping fields because these are the bounds of the flipping field distribution. So the diagram in \n\nFigure 5.11c is nearly that of an ideal uniaxial SD distribution.\n\nConsider now the case in which a specimen has magnetic grains with non-uniform magnetizations such as vortex structures or domain walls. Walls and vortices can move much more easily than flipping the moment of an entire grain coherently. In fact, they begin to move in small jumps (from LEM to LEM) as soon as the applied field changes. If a structure nucleates while the field is decreasing and the field is then ramped back up, the magnetization curve will not be reversible, even though the field never changed sign or approached the flipping field for coherent rotation. The resulting FORC for such behavior would have much of the “action” in the region where H_a is positive. When transformed to H_u and H_c, the diagram will have the high densities for small H_c but over a range of \\pm H_u. The example shown in \n\nFigure 5.12 is of a specimen that has been characterized as “pseudo-single domain”. The FORC diagram in \n\nFigure 5.12b has some of the FORC densities concentrated along the H_c axis characteristic of single domain specimens (e.g., \n\nFigure 5.11c), but there is also concentration along the H_u axis characteristic of PSD and MD specimens.\n\n\n\nFigure 5.13:a) Illustration of a Zero FORC (ZFORC) whereby the descending loop from saturation is terminated at zero field and the field is then ramped back up to saturation. The transient hysteresis (TH) of \n\nFabian (2003) is the shaded area between the two curves. b) Micromagnetic model of a ZFORC for a 100 nm cube of magnetite. Two snap shots of the internal magnetization on the descending and ascending loops are shown in the insets. [Figure redrawn from \n\nYu & Tauxe (2005).]\n\nIn many cases the most interesting thing one learns from FORC diagrams is the degree to which there is irreversible behavior when the field is reduced to zero then ramped back up to saturation (see \n\nFigure 5.13). Such irreversible behavior in what \n\nYu & Tauxe (2005) call the “Zero FORC” or ZFORC can arise from particle interactions, domain wall jumps or from the formation and destruction of vortex structures in the magnetic grains.\n\nFabian (2003) defined a parameter called “transient hysteresis” which is the area between the ascending and descending loops of a ZFORC (shaded area in \n\nFigure 5.13). This is defined as:TH= \\mu_o\\sum_0^{H_s} [M_{descending} - M_{ascending}] \\cdot \\Delta H.\n\nwhere \\Delta H is the field increment used in the hysteresis measurement. When normalized by M_s, TH has units of tesla. Transient hysteresis is thought to result from self demagnetization, for example shifting of domain walls or the formation and destruction of vortex structures. An example of what might be causing transient hysteresis at the macro scale is shown for micromagnetic modelling of a single particle in \n\nFigure 5.13b \n\nYu & Tauxe (2005). The ZFORC starts and ends at saturation. On the descending loop, a vortex structure suddenly forms, at the point on the hysteresis loop labelled a), sharply reducing the magnetization. The magnetization state just before the jump is shown as snapshot labelled “descending branch”. The vortex remains along the ascending branch until much higher fields (see snapshot labelled “ascending branch”). The irreversible behavior of millions of particles with different sizes and shapes leads to the total transient hysteresis of the macro specimen. In general, \n\nYu & Tauxe (2005) showed that the larger the particle, the greater the transient hysteresis, until truly multi-domain behavior essentially closed the loop, precluding the observation of TH (or of a FORC diagram for that matter).\n\nSupplemental Reading: \n\nDunlop & Özdemir (1997), chapters 5 and 11; \n\nO'Reilly (1984), pp 69–87; \n\nDunlop (2002); \n\nDunlop (2002).","type":"content","url":"/chapter5#first-order-reversal-curves","position":19},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl2":"Problems"},"type":"lvl2","url":"/chapter5#problems","position":20},{"hierarchy":{"lvl1":"Chapter 5: Magnetic Hysteresis","lvl2":"Problems"},"content":"Problem 1\n\nFor a grain with uniaxial anisotropy in an external field, the direction of magnetization in this grain will be controlled entirely by the uniaxial anisotropy energy density \\epsilon_a and the magnetic interaction energy \\epsilon_m. The total energy can be written:\\epsilon_{tot} = \\epsilon_a + \\epsilon_m = K_u \\sin^2 \\theta - \\mu_o H M_s \\cos (\\phi -\\theta),\n\nwhere \\phi is the angle of the applied field relative to the easy axis of magnetization and \\theta is the angle of the moment relative to the easy direction. Show that the flipping field of a grain whose moment is initially antiparallel to the field, i.e. \\phi = 180°, is given by:H_c = \\frac{2K_u}{\\mu_o M_s}.\n\nProblem 2 [From Jeff Gee]\n\nIn this problem, we will begin to use some real data. The data files used with this book are part of the PmagPy distribution, which you should have already downloaded and installed. [See Preface for instructions.]\n\nThe file hysteresis.txt in the Chapter_5 directory contains data for a single hysteresis loop. Note that the units are as measured: H (Oe), moment (emu) and it is fine to leave them in these units.\n\na) Read the data into a Pandas DataFrame. Determine the high field slope at |H| > 4000 Oe. Typically one calculates separate slopes for the +H data and -H data and averages these. A general least squares polynomial fit (numpy.polyfit) should do the trick.\n\nb) Use the slope you determined to plot both the original hysteresis loop and the slope-corrected loop (i.e. removing the high field paramagnetic slope).\n\nc) What is the ratio M_r/M_s (saturation remanence/saturation magnetization) for this sample? The coercivity of remanence (H_{cr}) for this sample was estimated at 264 Oe. Based on the M_r/M_s and H_{cr}/H_c ratios, is this sample more likely to contain single domain or multidomain grains?\n\nd) This small sample has a mass of 10.6 mg. Assuming the magnetic material is magnetite, estimate the mass fraction of magnetite (92 Am^2/kg; note 1 emu/gm is equivalent to 1 Am^2/kg).","type":"content","url":"/chapter5#problems","position":21},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy"},"type":"lvl1","url":"/chapter6","position":0},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy"},"content":"Background: \n\nEvans & Heller (2003), Chapter 3.\n\nAn essential part of every paleomagnetic study is a discussion of what is carrying the magnetic remanence and how the rocks got magnetized. For this, we need some knowledge of what the important natural magnetic phases are, how to identify them, how they formed, and what their magnetic behavior is. In this chapter, we will cover a brief description of geologically important magnetic phases. Useful magnetic characteristics of important minerals can be found in \n\nTable 6.1 at the end of this chapter.\n\nIron is by far the most abundant transition element in the solar system, so most paleomagnetic studies depend on the magnetic iron bearing minerals: the iron-nickels (which are particularly important for extra-terrestrial magnetic studies), the iron-oxides such as magnetite, maghemite and hematite, the iron-oxyhydroxides such as goethite and ferrihydrite, and the iron-sulfides such as greigite and pyrrhotite. We are concerned here with the latter three as iron-nickel is very rare in terrestrial paleomagnetic studies.","type":"content","url":"/chapter6","position":1},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"Iron-oxides"},"type":"lvl2","url":"/chapter6#iron-oxides","position":2},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"Iron-oxides"},"content":"The minerals we will be discussing are mostly solid solutions which the American Heritage dictionary defines as:\n\nA homogeneous crystalline structure in which one or more types of atoms or molecules may be partly substituted for the original atoms and molecules without changing the structure.\n\nIn iron oxides, titanium commonly substitutes for iron in the crystal structure. Because the titanium ion Ti^{4+} has no unpaired spins (see Chapter 3) and is a different size, the magnetic properties of titano-magnetite are different from magnetite with no titanium.\n\nTwo solid solution series are particularly important in paleomagnetism: the ulvöspinel-magnetite and ilmenite-hematite series. Both titanomagnetites and hemoilmenites crystallize at about 1300°C. Above about 600°C, there is complete solid solution between magnetite and ulvöspinel and above about 800°C between hematite and ilmenite. This means that all compositions are “allowed” in the crystal structure at the crystallization temperature. As the temperature decreases, the thermodynamic stability of the crystals changes. If a mineral has a given composition, say 60% titanium substitution (green dot in \n\nFigure 6.1a), when the temperature cools to intersect the red line, that composition is no longer thermodynamically stable and the two phases to either side are the equilibrium compositions. By 400°C the two equilibrium phases are ~0.25 and ~0.9 Ti substitution. To achieve the separation, the cations diffuse through the crystal leaving titanium richer and titanium poorer bands called lamellae (see \n\nFigure 6.2). Exsolution is inhibited if the crystals cool rapidly so there are many metastable crystals with non-equilibrium values of titanium substitution in nature.\n\n\n\nFigure 6.1:Phase diagrams for FeTi oxides. The composition is indicated by x or y. There is complete solid solution above the solid lines. Exsolution begins as the temperature cools below the solid curves. a) Titanomagnetite series. [Redrawn from \n\nNagata (1961).] b) Titanohematite series. [Redrawn from \n\nRobinson et al. (2004).]\n\nExsolution is important in paleomagnetism for two reasons. First, the different compositions have very different magnetic properties. Second, the lamellae effectively reduce the magnetic crystal size which we already know has a profound influence on the magnetic stability of the mineral. An example of this is shown in \n\nFigure 6.2b in which the larger crystal is several microns in width, too large to have single domain-like magnetization, yet the smaller magnetite lamellae are indeed small enough and carry a strong stable magnetization \n\nFeinberg et al. (2005).\n\n\n\nFigure 6.2:a) Atomic force micrograph image of magnetite inclusion in clinopyroxene. The topographically low areas are ulvöspinel while the higher areas are magnetite. b) Magnetic force micrograph of magnetic domains (black and white are oppositely magnetized). The ulvöspinel lamellae are essentially non-magnetic and are gray. c) Transmission electron micrograph of ilmenite host with hematite exsolution lamellae. Lamellar size gets smaller with proximity to edge. d) Photomicrograph of titanohematite exsolution lamellae. Dark bands are Ti-rich (high magnetization, low T_c), light grey bands are Ti-poor (low magnetization, high T_c). [a and b are from \n\nFeinberg et al. (2005), c) from \n\nRobinson et al. (2002), d) is modified from S. Haggerty in \n\nButler (1992).]\n\n\n\nFigure 6.3:Ternary diagram for iron-oxides. The solid lines are solid solution series with increasing titanium concentration (x). The dashed lines with arrows indicate the direction of increasing oxidation (z). [Figure redrawn from \n\nButler (1992).]\n\nCompositions of minerals are frequently plotted on ternary diagrams like the one shown in \n\nFigure 6.3. [For help in reading ternary diagrams, please see the Appendix.] The apices of the ternary diagram are Fe^{2+} on the lower left, Fe^{3+} on the lower right and Ti^{4+} on the top. The oxides with these species are FeO (wüstite), Fe_2O_3 (hematite or maghemite depending on structure) and TiO (rutile). Every point on the triangle represents a cation mixture or solution that adds up to one cation (hence the fractional formulae).\n\nEach of the solid arrows in \n\nFigure 6.3 (labelled titanomagnetite and hemoilmenite) represent increasing substitution of titanium into the crystal lattices of magnetite and hematite respectively. The amount of Ti substitution in titanomagnetites is denoted by “x”, while substitution in the hemoilmenites is denoted by “y”. Values for x and y range from 0 (magnetite or hematite) to 1 (ulvöspinel or ilmenite).","type":"content","url":"/chapter6#iron-oxides","position":3},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl3":"Titanomagnetites Fe_{3-x}Ti_xO_4","lvl2":"Iron-oxides"},"type":"lvl3","url":"/chapter6#titanomagnetites-fe-3-x-ti-xo-4","position":4},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl3":"Titanomagnetites Fe_{3-x}Ti_xO_4","lvl2":"Iron-oxides"},"content":"In earlier chapters on rock magnetism, we learned a few things about magnetite. As mentioned in Chapter 4, magnetite (Fe_3O_4) has an inverse spinel structure (AB_2O_4). The oxygen atoms form a face-centered cubic lattice into which cations fit in either octahedral or tetrahedral symmetry. For each unit cell there are four tetrahedral sites (A) and eight octahedral sites (B). To maintain charge balance with the four oxygen ions (O^{2-}), there are two Fe^{3+} ions and one Fe^{2+} ion. Fe^{3+} has five unpaired spins, while Fe^{2+} has four. As discussed in Chapter 3, each unpaired spin contributes a moment of one Bohr magneton (m_b). The divalent iron ions all reside in the octahedral lattice sites, whereas the trivalent iron ions are split evenly between octahedral and tetrahedral sites: Fe^{3+}|Fe^{3+}Fe^{2+}|O_4. The A and B lattice sites are coupled with antiparallel spins and magnetite is ferrimagnetic. Therefore, the net moment of magnetite is (9-5=4) m_b per molecule (at 0 K).\n\n\n\nFigure 6.4:Variation of intrinsic parameters with titanium substitution in the titanomagnetite lattice. X is the degree of substitution from 0 (no Ti) to 1 (100% substitution). a) Variation of the magnetization expressed as Bohr magnetons per unit cell. b) Variation of cell lattice size. c) Variation of Curie temperature. [Data compiled by \n\nO'Reilly (1984).]\n\nTitanomagnetites can occur as primary minerals in igneous rocks. Magnetite, as well as various members of the hemoilmenite series, can also form as a result of high temperature oxidation. In sediments, magnetite often occurs as a detrital component. It can also be produced by bacteria or authigenically during diagenesis.\n\nSubstitution of Ti^{4+}, which has no unpaired spins (see Chapter 3), has a profound effect on the magnetic properties of the resulting titanomagnetite. Ti^{4+} substitutes for a trivalent iron ion. In order to maintain charge balance, another trivalent iron ion turns into a divalent iron ion. The end members of the solid solution series are:\n\nmagnetite\n\nulvöspinel\n\nFe$^{3+}\n\nFe^{3+}Fe^{2+}\n\nx = 0\n\nx = 1\n\n\n\nFigure 6.5:Hematite. a) Photograph of Kidney ore hematite from Michigan by DanielCD. [From \n\ncommons​.wikimedia​.org.] b-c) Two views of the crystal structure of hematite. c-axis is perpendicular to the basal plane. [From \n\nwebmineral.com.]\n\nUlvöspinel is antiferromagnetic because the A and B lattice sites have the same net moment. When x is between 0 and 1, the mineral is called a titanomagnetite. If x is 0.6, for example, the mineral is called TM60 (green dot in \n\nFigure 6.3).\n\nThe profound effect of titanium substitution on the intrinsic properties of titanomagnetite is illustrated in \n\nFigure 6.4. Because Ti^{4+} has no unpaired spins, the saturation magnetization decreases with increasing x (\n\nFigure 6.4a). The cell dimensions increase with increasing x (\n\nFigure 6.4b). As a result of the increased cell dimension, there is a decrease in Curie Temperature (\n\nFigure 6.4c). There is also a slight increase in coercivity (not shown).\n\nThe large M_s of magnetite (see \n\nTable 6.1) means that for deviations from equant grains as small as 10%, the magnetic anisotropy energy becomes dominated by shape. Nonetheless, aspects of the magnetocrystalline anisotropy provide useful diagnostic tests. The magnetocrystalline anisotropy constants are a strong function of temperature. On warming to ~-100°C from near absolute zero, changes in these constants can lead to an abrupt loss of magnetization, which is known loosely as the Verwey transition (see Chapter 4). Identification of the Verwey transition suggests a remanence that is dominated by magnetocrystalline anisotropy. As we shall see, the temperature at which it occurs is sensitive to oxidation and the transition can be completely suppressed by maghemitization (see \n\nDunlop & Özdemir (1997)).\n\nIt should be noted that natural titanomagnetites often contain impurities (usually Al, Mg, Cr). These impurities also affect the magnetic properties. Substitution of 0.1 Al^{3+} into the unit cell of titanomagnetite results in a 25% reduction in M_s and a reduction of the Curie temperature by some 50°C. Substitution of Mg^{2+} into TM60 also results in a lower saturation magnetization with a reduction of some 15%.\n\n\n\nFigure 6.6:Variation of properties with Ti substitution in the titanohematite series. a) Variation of saturation magnetization. b) Variation of Néel Temperature. [Modified from \n\nNagata (1961) and \n\nStacey & Banerjee (1974).]","type":"content","url":"/chapter6#titanomagnetites-fe-3-x-ti-xo-4","position":5},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl3":"Hematite-Ilmenite Fe_{2-y}Ti_yO_3","lvl2":"Iron-oxides"},"type":"lvl3","url":"/chapter6#hematite-ilmenite-fe-2-y-ti-yo-3","position":6},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl3":"Hematite-Ilmenite Fe_{2-y}Ti_yO_3","lvl2":"Iron-oxides"},"content":"Hematite has a corundum structure (see \n\nFigure 6.5). It is rhombohedral with a pseudocleavage (perpendicular to the c axis) and tends to break into flakes. It is antiferromagnetic, with a weak parasitic ferromagnetism resulting from either spin-canting or defect ferromagnetism (see Chapter 3). Because the magnetization is a spin canted antiferromagnetism, the temperature at which this magnetization disappears is called the Néel Temperature instead of the Curie Temperature which is sensu strictu only for ferromagnetic minerals. The Néel temperature for hematite is approximately 685°C.\n\nAbove about -10°C (the Morin transition), the magnetization is constrained by aspects of the crystal structure to lie perpendicular to the c axis or within the basal plane. Below the Morin transition, spin-canting all but disappears and the magnetization is parallel to the c axis. This effect could be used to demagnetize the grains dominated by spin-canting: it does not affect those dominated by defect moments. Most hematites formed at low-temperatures have magnetizations dominated by defect moments, so the remanence of many rocks will not display a Morin transition.\n\n\n\nFigure 6.7:Variation of intrinsic parameters with oxidation in TM60. z is the degree of oxidation. a) Variation of the magnetization. b) Variation of cell lattice size. c) Variation of Curie temperature. [Data compiled by \n\nDunlop & Özdemir (1997).] Inset: A magnetite crystal (~30 μm) undergoing maghemitization. Because of the change in volume, the crystal begins to crack. [From \n\nGapeyev & Tsel'movich (1988) in \n\nDunlop & Özdemir (1997).]\n\nHematite occurs widely in oxidized sediments and dominates the magnetic properties of red beds. It occurs as a high temperature oxidation product in certain igneous rocks. Depending on grain size, among other things, it is either black (specularite) or red (pigmentary). Diagnostic properties of hematite are listed in \n\nTable 6.1.\n\nThe substitution of Ti into the lattice structure of \\alphaFe_2O_3 has an even more profound influence on magnetic properties than for magnetite. For y=0 the magnetization is spin-canted antiferromagnetic, but when y=0.45, the magnetization becomes ferrimagnetic (see \n\nFigure 6.6a). For small amounts of substitution, the Ti and Fe cations are distributed equally among the cation layers. For y>0.45, however, the Ti cations preferentially occupy alternate cation layers. Remembering that the Ti^{4+} ions have no net moment, we can imagine that antiparallel coupling between the two sub-lattices results in ferrimagnetic behavior, as opposed to the equal and opposite style of anti-ferromagnetism.\n\nTitanohematite particles with intermediate values of y have interesting properties from a paleomagnetic point of view. There is a solid solution at high temperatures, but as the temperatures drop the crystals exsolve into titanium rich and poor lamellae (see \n\nFigure 6.2d). \n\nFigure 6.6 shows the variation in saturation magnetization and Néel temperature with Ti substitution. For certain initial liquid compositions, the exsolution lamellae could have Ti-rich bands alternating with Ti-poor bands. If the Ti-rich bands have higher magnetizations, yet lower Curie temperatures than the Ti-poor bands, the Ti-poor bands will become magnetized first. When the Curie temperature of the Ti-rich bands is reached, they will become magnetized in the presence of the demagnetizing field of the Ti-poor bands, hence they will acquire a remanence that is antiparallel to the applied field. Because these bands have higher magnetizations, the net NRM will also be anti-parallel to the applied field and the rock will be self-reversed. This is fortunately very rare in nature.\n\n\n\nFigure 6.8:Effect of maghemitization on Verwey transition. a) Saturation remanence acquired at 10 K observed as it warms up for 37 nm stoichiometric magnetite. b) Same but for partially oxidized magnetite. [Data from \n\nÖzdemir et al. (1993).]","type":"content","url":"/chapter6#hematite-ilmenite-fe-2-y-ti-yo-3","position":7},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl3":"Oxidation of (titano)magnetites to (titano)maghemites","lvl2":"Iron-oxides"},"type":"lvl3","url":"/chapter6#oxidation-of-titano-magnetites-to-titano-maghemites","position":8},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl3":"Oxidation of (titano)magnetites to (titano)maghemites","lvl2":"Iron-oxides"},"content":"Many minerals form under one set of equilibrium conditions (say within a cooling lava flow) and are later subjected to a different set of conditions (sea-floor alteration or surface weathering). They will tend to alter in order to come into equilibrium with the new set of conditions. The new conditions are often more oxidizing than the original conditions and compositions tend to move along the dashed lines in \n\nFigure 6.3. The degree of oxidation is represented by the parameter z.\n\nWhile the solid solution between magnetite and ulvöspinel exists in principle, intergrowths of these two minerals are actually quite rare in nature because the titanomagnetites interact with oxygen in the melt to form intergrowths of low Ti magnetite with ilmenite. This form of oxidation is known as deuteric oxidation.\n\nLow temperature oxidation will tend to transform a single phase spinel (titanomagnetite) into a new single phase spinel (titanomaghemite) by diffusion of Fe^{2+} from the lattice structure of the (titano)magnetite to the surface where it is converted to Fe^{3+}; titanomaghemite is a “cation-deficient” inverse spinel. The inset to \n\nFigure 6.7c shows a magnetite crystal in the process of becoming maghemite. The conversion of the Fe^{2+} ion means a loss in volume which results in characteristic cracking of the surface. There is also a loss in magnetization, a shrinkage of cell size and, along with the tightening unit cell, an increase in Curie Temperature. These trends are shown for TM60 in \n\nFigure 6.7. Maghemitization results in a much reduced Verwey transition (see \n\nFigure 6.8).\n\nThe (titano)maghemite structure is metastable and can invert to form the isochemical, but more stable structure of (titano)hematite, or it can be reduced to form magnetite. The two forms of Fe_2O_3 are distinguished by the symbols \\gamma for maghemite and \\alpha for hematite. Inversion of natural maghemite is usually complete by about 350°C, but it can survive until much higher temperatures (for more details, see \n\nDunlop & Özdemir (1997)). Also, it is common that the outer rim of the magnetite will be oxidized to maghemite, while the inner core remains magnetite.\n\n\n\nFigure 6.9:a) Photograph of goethite. [From \n\nen.wikipedia.org; photo of Eurico Zimbres.] b) Goethite crystal structure. c) Photograph of greigite. [Photo of William Péraud.] d) Greigite crystal structure. e) Photograph of single crystal of pyrrhotite. [Photo of Dan Weinrich.] f) Pyrrhotite crystal structure. [All crystal structure images from \n\nwebmineral.com.]","type":"content","url":"/chapter6#oxidation-of-titano-magnetites-to-titano-maghemites","position":9},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"Iron-oxyhydroxides and iron-sulfides"},"type":"lvl2","url":"/chapter6#iron-oxyhydroxides-and-iron-sulfides","position":10},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"Iron-oxyhydroxides and iron-sulfides"},"content":"Of the many iron oxyhydroxides that occur in any abundance in nature, goethite (\\alphaFeOOH; \n\nFigure 6.9a,b) is the most common magnetic phase. It is antiferromagnetic with what is most likely a defect magnetization. It occurs widely as a weathering product of iron-bearing minerals and as a direct precipitate from iron-bearing solutions. It is metastable under many conditions and dehydrates to hematite with time or elevated temperature. Dehydration is usually complete by about 325°C. It is characterized by a very high coercivity but a low Néel temperature of about 100–150°C. Diagnostic properties of goethite are listed in \n\nTable 6.1.\n\nThere are two iron-sulfides that are important to paleomagnetism: greigite (Fe_3S_4; \n\nFigure 6.9c,d) and pyrrhotite (Fe_7S_8–Fe_{11}S_{12}; \n\nFigure 6.9e,f). These are ferrimagnetic and occur in reducing environments. They both tend to oxidize to various iron oxides leaving paramagnetic pyrite as the sulfide component.\n\nThe Curie temperature of monoclinic pyrrhotite (Fe_7S_8) is about 325°C (see \n\nFigure 6.10b; \n\nTable 6.1). Monoclinic pyrrhotite undergoes a transition at ~35 K, so low temperature measurements can be diagnostic for this phase (see \n\nFigure 6.10a). Hexagonal pyrrhotite undergoes a structural transition from an imperfect antiferromagnet to a ferromagnet with much higher saturation magnetization at about 200°C. During a thermomagnetic experiment, the expansion of the crystal results in a large peak in magnetization just below the Curie Temperature (see \n\nFigure 6.10c). Mixtures of monoclinic and hexagonal pyrrhotite result in the behavior sketched in \n\nFigure 6.10d. The maximum unblocking temperature of greigite is approximately 330°C. Other diagnostic properties of greigite and pyrrhotite are listed in \n\nTable 6.1.\n\n\n\nFigure 6.10:a) Low-temperature transition in monoclinic pyrrhotite. [Data from \n\nSnowball & Torii (1999).] Thermomagnetic curves for b) monoclinic c) hexagonal and d) mixture of b) and c) pyrrhotite. [Data from \n\nDekkers (1988).]","type":"content","url":"/chapter6#iron-oxyhydroxides-and-iron-sulfides","position":11},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"FeTi oxides in igneous rocks"},"type":"lvl2","url":"/chapter6#feti-oxides-in-igneous-rocks","position":12},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"FeTi oxides in igneous rocks"},"content":"The composition and relative proportions of FeTi oxides, crystallizing from a silicate melt depend on a number of factors, including the bulk chemistry of the melt, oxygen fugacity and the cooling rate. The final assemblage may be altered after cooling. FeTi oxides are generally more abundant in mafic volcanic rocks (e.g. basalts) than silicic lavas (e.g., rhyolites). FeTi oxides can be among the first liquidus phases (~1000°C) in silicic melts, but in mafic lavas they generally are among the last phases to form (~1050°C), often with plagioclase and pyroxene.\n\nAlthough there is considerable variability, the Ti (ulvöspinel) content of the titanomagnetite crystallizing from a melt generally is lower in more silicic melts (see solid black lines in \n\nFigure 6.11). Titanomagnetites in tholeiitic lavas generally have 0.5 < x < 0.8 with an initial composition near TM60 (x=0.6) characteristic for much of the oceanic crust. The range of rhombohedral phases (dashed red lines) crystallizing from silicate melts is more limited, 0.05 < y < 0.3 for most lavas.\n\n\n\nFigure 6.11:Occurrence of FeTi oxides in igneous rocks. [Data from \n\nFrost & Lindsley (1991).]\n\nThe final magnetic mineral assemblage in a rock is often strongly influenced by the cooling rate and oxygen fugacity during initial crystallization. As a first approximation, we distinguish slowly cooled rocks (which may undergo solid state exsolution and/or deuteric oxidation) from those in which the oxide minerals were rapidly quenched. As mentioned before, FeTi oxides in slowly cooled igneous rocks can exhibit exsolution lamellae with bands of low and high titanium magnetites if the oxygen fugacity remains unoxidizing. This reaction is very slow, so its effects are rarely seen in nature.\n\nThe typical case in slowly cooled rocks is that the system becomes more oxidizing with increasing differentiation during cooling and crystallization. For example, both the dissociation of magmatic water and the crystallization of silicate phases rich in Fe will act to increase the oxidation state. This will drive compositions to higher z values (see \n\nFigure 6.3). The final assemblage typically consists of ilmenite lamellae and a nearly pure magnetite host because adding O_2 drives the reaction Fe_2TiO_4 + O_2 \\rightleftharpoons Fe_3O_4 to the right. This process is known as oxyexsolution. Under even more oxidizing conditions, these phases may ultimately be replaced by their more oxidized counterparts (e.g., hematite, pseudobrookite).\n\nWeathering at ambient surface conditions or mild hydrothermal alteration may lead to the development of cation deficient (titano)maghemites. This can either occur by addition of oxygen to the spinel phase with a corresponding oxidation of the Fe^{2+} to Fe^{3+} to maintain charge balance, or by the removal of some of the octahedral iron from the crystal structure.\n\n\n\nFigure 6.12:Photomicrographs of bacterial magnetites produced by magnetotactic bacteria. a) Intact magnetosome in living bacterium. [False color image from H. Vali in \n\nMaher & Thompson (1999).] b) Chains recovered from ODP Site 1006D in the Bahamas. [From M. Hounslow in \n\nMaher & Thompson (1999).]","type":"content","url":"/chapter6#feti-oxides-in-igneous-rocks","position":13},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"Magnetic mineralogy of soils and sediments"},"type":"lvl2","url":"/chapter6#magnetic-mineralogy-of-soils-and-sediments","position":14},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"Magnetic mineralogy of soils and sediments"},"content":"Igneous (and metamorphic) rocks are the ultimate source for the components of sedimentary rocks, but biological and low-temperature diagenetic agents work to modify these components and have a significant effect on magnetic mineralogy in sediments. As a result there is a virtual rainbow of magnetic mineralogies found in sediments. (Titano)magnetite coming into the sedimentary environment from an igneous source may experience a change in pH and redox conditions that make it no longer the stable phase, hence it may alter. Also, although the geochemistry of seawater is generally oxidizing with respect to the stability field of magnetite, pronounced changes in the redox state of sediments often occur with increasing depth as a function of the breakdown of organic carbon. Such changes may result in locally strongly reducing environments where magnetite may be dissolved and authigenic sulfides produced. Indeed, changes down sediment cores in the ferrimagnetic mineral content and porewater geochemistry suggest that this process is active in some (most?) marine sedimentary sequences. For example, dissolution of magnetite and/or production of non-magnetic sulfides may be responsible for the oft-seen decrease in various bulk magnetic parameters (e.g., magnetic susceptibility, IRM, ARM, etc.) with depth.\n\nSome of the more spectacular magnetic minerals found in sediments are biogenic magnetites produced by magnetotactic bacteria (see review by \n\nKopp & Kirschvink (2008) and \n\nFigure 6.12). The sizes and shapes of bacterial magnetite, when plotted on the Evans diagram from Chapter 4, suggest that magnetotactic bacteria form magnetite in the single domain grain size range—otherwise extremely rare in nature. It appears that bacterial magnetites are common in sediments, but their role in contributing to the natural remanence is still poorly understood.","type":"content","url":"/chapter6#magnetic-mineralogy-of-soils-and-sediments","position":15},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"Physical properties of magnetic minerals"},"type":"lvl2","url":"/chapter6#physical-properties-of-magnetic-minerals","position":16},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"Physical properties of magnetic minerals"},"content":"Table 6.1:Physical properties of magnetic minerals\n\nProperty\n\nValue\n\nReference\n\nMagnetite: Fe_3O_4\n\n\n\n\n\nDensity\n\n5197 kg m^{-3}\n\nDunlop & Özdemir (1997)\n\nCurie temperature\n\n580°C\n\nDunlop & Özdemir (1997)\n\nSaturation Magnetization\n\n92 Am^2kg^{-1}\n\nO'Reilly (1984)\n\nAnisotropy Constant\n\n-2.6 Jkg^{-1}\n\nDunlop & Özdemir (1997)\n\nVolume susceptibility\n\n~1 SI\n\nO'Reilly (1984)\n\nTypical coercivities\n\n10’s of mT\n\nO'Reilly (1984)\n\nVerwey transition\n\n110-120 K\n\nÖzdemir et al. (1993)\n\nCell edge\n\n0.8396 nm\n\nDunlop & Özdemir (1997)\n\nMaghemite: \\gammaFe_2O_3\n\n\n\n\n\nDensity\n\n5074 kg m^{-3}\n\nDunlop & Özdemir (1997)\n\nCurie temperature\n\n590-675°C\n\nDunlop & Özdemir (1997)\n\nSaturation Magnetization\n\n74 Am^2kg^{-1}\n\nDunlop & Özdemir (1997)\n\nAnisotropy Constant\n\n0.92 Jkg^{-1}\n\nDunlop & Özdemir (1997)\n\nVerwey transition\n\nsuppressed\n\nDunlop & Özdemir (1997)\n\nBreaks down to \\alphaFe_2O_3\n\n250→750°C\n\nDunlop & Özdemir (1997)\n\nTM60: Fe_{2.4}Ti_{0.6}O_4\n\n\n\n\n\nDensity\n\n4939 kg m^{-3}\n\nDunlop & Özdemir (1997)\n\nCurie temperature\n\n150°C\n\nDunlop & Özdemir (1997)\n\nSaturation Magnetization\n\n24 Am^2kg^{-1}\n\nDunlop & Özdemir (1997)\n\nAnisotropy Constant\n\n0.41 Jkg^{-1}\n\nDunlop & Özdemir (1997)\n\nCoercivity\n\n~8 mT\n\nDunlop & Özdemir (1997)\n\nVerwey transition\n\nsuppressed\n\nDunlop & Özdemir (1997)\n\nCell edge\n\n0.8482 nm\n\nDunlop & Özdemir (1997)\n\nHematite: \\alphaFe_2O_3\n\n\n\n\n\nDensity\n\n5271 kg m^{-3}\n\nDunlop & Özdemir (1997)\n\nNéel temperature\n\n675°C\n\nO'Reilly (1984)\n\nSaturation Magnetization\n\n0.4 Am^2kg^{-1}\n\nO'Reilly (1984)\n\nAnisotropy Constant\n\n228 Jkg^{-1}\n\nDunlop & Özdemir (1997)\n\nVolume susceptibility\n\n~1.3 × 10^{-3} SI\n\nO'Reilly (1984)\n\nCoercivities\n\ncan be 10’s of teslas\n\nBanerjee (1971)\n\nMorin Transition\n\n~250-260 K (for > 0.2 μm)\n\nO'Reilly (1984)\n\nGoethite: \\alphaFeOOH\n\n\n\n\n\nDensity\n\n4264 kg m^{-3}\n\nDunlop & Özdemir (1997)\n\nNéel temperature\n\n70→125°C\n\nO'Reilly (1984)\n\nSaturation Magnetization\n\n10^{-3}→1 Am^2kg^{-1}\n\nO'Reilly (1984)\n\nAnisotropy Constant\n\n0.25→2 Jkg^{-1}\n\nDekkers (1989)\n\nVolume susceptibility\n\n~1 × 10^{-3} SI\n\nDekkers (1989)\n\nCoercivities\n\ncan be 10’s of teslas\n\n\n\nBreaks down to hematite\n\n250→400°C\n\n\n\nPyrrhotite: Fe_7S_8\n\n\n\n\n\nDensity\n\n4662 kg m^{-3}\n\nDunlop & Özdemir (1997)\n\nMonoclinic Curie temperature\n\n~325°C\n\nDekkers (1989)\n\nHexagonal Curie temperature\n\n~270°C\n\nDekkers (1988)\n\nSaturation Magnetization\n\n0.4–~20 Am^2kg^{-1}\n\nWorm et al. (1993)\n\nVolume susceptibility\n\n~1 × 10^{-3}→1 SI\n\nCollinson (1983); \n\nO'Reilly (1984)\n\nAnisotropy Constant\n\n20 Jkg^{-1}\n\nO'Reilly (1984)\n\nCoercivities\n\ncan be 100’s of mT\n\nO'Reilly (1984)\n\nLow-T transition\n\n~34 K\n\nDekkers (1989); \n\nRochette et al. (1990)\n\nHexagonal pyrrhotite transition\n\nnear 200°C\n\n\n\nBreaks down to magnetite\n\n~500°C\n\nDunlop & Özdemir (1997)\n\nGreigite: Fe_3S_4\n\n\n\n\n\nDensity\n\n4079 kg m^{-3}\n\nDunlop & Özdemir (1997)\n\nMaximum unblocking temperature\n\n~330°C\n\nRoberts (1995)\n\nSaturation Magnetization\n\n~25 Am^2kg^{-1}\n\nSpender et al. (1972)\n\nAnisotropy Constant\n\n-0.25 Jkg^{-1}\n\nDunlop & Özdemir (1997)\n\nCoercivity\n\n60→>100 mT\n\nRoberts (1995)\n\nM_r/\\chi ratios\n\n~70 × 10^3 Am^{-1}\n\nSnowball & Thompson (1990)\n\nBreaks down to magnetite\n\n~270-350°C\n\nRoberts (1995)\n\nSupplemental Readings: \n\nDunlop & Özdemir (1997), Chapter 3; \n\nKopp & Kirschvink (2008).\n\n\n\nFigure 6.13:Curie Temperature curves for two samples, A and B. [Figure redrawn from \n\nButler (1992).]","type":"content","url":"/chapter6#physical-properties-of-magnetic-minerals","position":17},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"Problems"},"type":"lvl2","url":"/chapter6#problems","position":18},{"hierarchy":{"lvl1":"Chapter 6: Magnetic Mineralogy","lvl2":"Problems"},"content":"Problem 1\n\nYou measured Curie Temperature curves for two samples A and B as shown in \n\nFigure 6.13. Based on your knowledge of Curie Temperatures, what is the likely magnetic mineralogy for each sample?\n\nProblem 2\n\nThe data in demag.dat in the Chapter_6 data directory are thermal demagnetization data for a specimen that had a 2 T field exposed along x, a 0.4 T field exposed along y and a 0.12 T field exposed along z. The sample was then heated to a particular temperature step (°C) and cooled in zero magnetic field, allowing all grains that become superparamagnetic at temperatures lower than the treatment temperature to become randomized. After each treatment step, the magnetic vector was measured. The column headings are: Treatment temperature (C), Intensity, Declination, Inclination.\n\na) Write a python program to read the data in and convert the declination, inclination and intensity to cartesian components.\n\nb) Modify your program to normalize the intensities to that measured at 20°C.\n\nc) Extend the program to plot the x and y components as a function of temperature.\n\nd) Based on your understanding of coercivity and Curie temperatures, what is carrying the x and y components?\n\n\n\nFigure 6.14:a) Thermomagnetic run of mineral whereby magnetization (normalized by the initial value) is measured as a function of temperature. The red line is the heating curve and the blue line is the cooling curve. b) Electron microprobe data from FeTi oxides (dots in yellow field) plotted on TiO_2-FeO-Fe_2O_3 ternary diagram. [Figure redrawn from \n\nButler (1992).]\n\nProblem 3\n\nFerromagnetic minerals in two rock samples are known to be FeTi oxides and are found to have the properties described below. Using this information and looking up the properties of FeTi oxides described in the text, identify the ferromagnetic minerals. For titanomagnetite or titanohematite, approximate the compositional parameter x.\n\na) Strong-field thermomagnetic analysis indicates a dominant Curie temperature T_c = 420°C. Subjecting the specimen to increasingly larger fields to measure successive isothermal remanences (see Chapter 5) reveals a coercivity spectrum with a coercivity of less than 300 mT. What is this ferromagnetic mineral?\n\nb) Strong-field thermomagnetic analysis (used for measuring the Curie temperature) shows the behavior in \n\nFigure 6.14a with Curie temperature T_c = 200°C. In addition, electron microprobe data indicates abundances of FeO, Fe_2O_3, and TiO shown in \n\nFigure 6.14b. Unfortunately, electron microprobe data are not very effective in determining the Fe_2O_3:FeO ratio (placement from left to right in the TiO-FeO-Fe_2O_3 ternary diagram). Accordingly, there is much uncertainty in the Fe_2O_3:FeO ratio indicated by the microprobe data. But microprobe data are effective in determining the TiO:(Fe_2O_3 + FeO) ratio (placement from bottom to top in the TiO-FeO-Fe_2O_3 ternary diagram). With this information, identify the ferromagnetic mineral.","type":"content","url":"/chapter6#problems","position":19},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized"},"type":"lvl1","url":"/chapter7","position":0},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized"},"content":"Background: read \n\nWidom (2002), Chapter 1.\n\nThe key to the acquisition of magnetic remanence is magnetic anisotropy energy, the dependence of magnetic energy on direction of magnetization within the crystal (see Chapter 4). It is magnetic anisotropy energy that controls the probability of magnetic grains changing their moments from one easy direction to another. Without it, the magnetic moments of individual grains would swing freely and could not retain a “memory” of the ancient field direction.\n\nAnisotropy energy controls relaxation time, a concept briefly introduced in Chapter 4 where we defined it as a time constant for decay of the magnetization of an assemblage of magnetic grains when placed in a null field. \n\nEquation 4.17 predicted exponential decay with relaxation time \\tau being the time it takes for the initial magnetization to decay to 1/e of its initial value. Relaxation time reflects the probability of magnetic moments jumping over the anisotropy energy barrier between easy axes. Therefore, to preserve a record of an ancient geomagnetic field, there must be a way that the relaxation time changes from short (such that the magnetization is in equilibrium with the ambient geomagnetic field) to long (such that the magnetization is “frozen”, or blocked, for geologically significant periods of time).\n\nBefore we begin a more detailed look at the processes governing remanence acquisition, it is helpful to review briefly what is meant by “equilibrium” in physics and chemistry. Eager students are encouraged to read the background material recommended in the “BACKGROUND” list at the beginning of the chapter. In the following, we will go through the bare bones of statistical mechanics necessary to understand natural remanence.","type":"content","url":"/chapter7","position":1},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"The concept of dynamic equilibrium"},"type":"lvl2","url":"/chapter7#the-concept-of-dynamic-equilibrium","position":2},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"The concept of dynamic equilibrium"},"content":"We live in a world that is in constant motion down to the atomic level. The state of the things is constantly changing, but, looking at the big picture, things often seem to stay the same. Imagine for a moment a grassy field full of sheep and a fence running down the middle. The sheep can jump over the fence at will to get flowers on the other side and occasionally they do so. Over time, because the two sides of the fence are pretty much the same, the same number of sheep jump over in both directions, so if you were to count sheep on either side, the numbers would stay about the same.\n\n\n\nFigure 7.1:Illustration of dynamic equilibrium. If conditions on either side of the fence are equally pleasant, an equal number of sheep will be on either side of the fence, despite the fact that sheep are constantly jumping over the fence. If one side is preferable (sunny rather than rainy), there will tend to be more sheep on the nicer side.\n\nNow think about what would happen if it were raining on one side of the fence. The sheep would jump more quickly back over the fence from the rainy side to the sunny side than the other way around. You might find that over time, there were more sheep on the sunny side than on the rainy side (see \n\nFigure 7.1). If you are still awake after all this sheep counting, you have begun to understand the concept of dynamic equilibrium.\n\nReturning to magnetism, a magnet with uniaxial anisotropy in the absence of a magnetic field will tend to be magnetized in one of several possible “easy” directions (see Chapter 4). For the purpose of this discussion, let us consider the case of uniaxial anisotropy, in which there are only two easy directions in each magnetic grain. In order to “jump over the fence” (the anisotropy energy) and get from one easy axis to another, a magnetic particle must have thermal energy in excess of the anisotropy energy. According to the Boltzmann distribution law, the probability of a given particle having an energy E is proportional to e^{-E/kT} where kT is the thermal energy (see Chapter 4). Therefore, it may be that at a certain time, a particular magnetic grain has enough thermal energy for the electronic spins to overcome the energy barrier and flip the sense of magnetization from one easy axis to another.\n\nIf we had a collection of magnetized particles with some initial statistical alignment of moments giving a net remanence M_o, (more sheep on one side than the other), the random “fence jumping” by magnetic moments from one easy axis to another over time will eventually lead to the case where there is no preference and the net moment will have decayed to zero (although the individual grain moments remain at saturation). This approach to equilibrium magnetization (M_e) is the theoretical underpinning of \n\nEquation 4.17 (plotted in \n\nFigure 7.2a) and is the essence of what is known as Néel Theory.\n\n\n\nFigure 7.2:a) Magnetic relaxation in an assemblage of single domain ferromagnetic grains. The initial magnetization M_o decays to 1/e of its original strength in time \\tau. b) Relaxation times of single domain grains on a plot of grain volume, v, against an anisotropy energy constant (K), for a given temperature. Grains with short relaxation times plot toward the lower left and are in equilibrium with the magnetic field (they are superparamagnetic). Grains with long relaxation times plot toward the upper right; their moments are blocked, preserving the magnetization for geologically significant times. Inset shows the effect of temperature on the relaxation time curves which move toward the right and up with increasing temperature, changing “blocked” remanences to unblocked ones.","type":"content","url":"/chapter7#the-concept-of-dynamic-equilibrium","position":3},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Essential Néel theory"},"type":"lvl2","url":"/chapter7#essential-n-el-theory","position":4},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Essential Néel theory"},"content":"The theoretical basis for how ancient magnetic fields might be preserved was established over fifty years ago with the work of Nobel prize winner Louis Néel \n\nNéel (1949)\n\nNéel (1955). In the introduction to this chapter, we suggested that the mechanism which controls the approach to magnetic equilibrium is relaxation time. In the sheep analogy this would be the frequency of fence jumping. We defined relaxation time by \n\nEquation 4.18 in Chapter 4, sometimes called the Néel equation, which relates \\tau to volume v, the anisotropy constant (K) and absolute temperature (T).\n\nRelaxation time is controlled by the competition between anisotropy energy Kv and thermal energy, so will be constant at a given temperature with constant Kv. Iso-\\taus of equal relaxation time are curves in v-K space. \n\nFigure 7.2b shows the family of curves with \\taus ranging from ~100 seconds to the age of the Earth. The inset to \n\nFigure 7.2b illustrates the effect of temperature on the iso-\\taus, which move up and to the right with increasing temperature. This behavior gives us a clue as to how a rise in temperature could change a “blocked” remanence at 0°C (273K) (one that is stable for long periods of time) to an unblocked one. In fact, \n\nFigure 7.2b (and the inset) suggests two other ways of manipulating the approach to equilibrium besides temperature: by changing the time span of observation and by changing grain volume. Each of these mechanisms represents a different mode of remanence acquisition (thermal, viscous, and chemical remanences respectively). Naturally acquired remanences are generally referred to as natural remanent magnetizations or NRMs. In this chapter we will introduce these and other forms of NRM and how they are acquired. We will also introduce useful unnatural remanences where appropriate.\n\nIn the “sheep in the rain” scenario, jumping over the fence into the sun would occur more frequently than jumping into the rain. It is also true that the energy barrier for magnetic particles to flip into the direction of the applied field \\H requires less energy than to flip the other way, so relaxation time must also be a function of the applied field. This tendency is reflected in the more general form of the Néel equation:\\tau = \\frac{1}{C} \\exp \\frac{Kv}{kT} \\left[ 1 - \\frac{H}{H_c} \\right]^2.\n\nIn this chapter we are concerned mainly with magnetic remanences acquired in the presence of the Earth’s magnetic field, which is tiny compared to the coercivity of the minerals in question and so we can neglect the effect of H on \\tau in the next few sections.\n\nIn \n\nEquation 7.1, the product Kv is an energy barrier to the rotation of \\m and we will call it the blocking energy. High blocking energies will promote more stable magnetizations. We learned in Chapter 4 that K for uniaxial shape anisotropy, K_u, is related to the coercivity H_c (the field required to flip the magnetization) by:H_c = \\frac{2K_u}{\\mu_o M_s},\n\nwhere M_s is the saturation magnetization. Substituting for K_u in \n\nEquation 4.18 from Chapter 4 we get:\\tau = \\frac{1}{C} \\exp \\frac{\\mu_o H_c M_s v}{2kT},\n\nwhere M_s is itself a strong function of temperature. The temperature dependence of saturation magnetization can be approximated by:M_s(T) = M_s(0) \\left(1 - \\frac{T}{T_c}\\right)^\\gamma\n\nwhere T_c is the Curie temperature and \\gamma is an empirical exponent (typically ~0.38 for magnetite). We can see from \n\nEquation 7.3 that relaxation time is a function of magnetization, as well as volume, coercivity and temperature, properties that we will return to later in the chapter and in future chapters throughout the course.\n\n\n\nFigure 7.3:Lines of equal blocking energy in plot of grain volume, v, against the anisotropy energy density, K. Lines of equal blocking energy (product Kv) are also lines of equal relaxation time, \\tau, at a given temperature (here assumed to be room temperature). Contours are for a hypothetical population of magnetic grains. Grains with short \\tau plot toward the lower left. Grains with long \\tau plot toward the upper right; superparamagnetic grains with \\tau < 100s plot to the left or below the “superparamagnetic line” when \\tau \\simeq 100s. Stable single domain grains with \\tau > 100s plot above or to right of superparamagnetic line.\n\nIt is instructive to plot distributions of grains on the v-K diagrams as shown in \n\nFigure 7.3. By definition, superparamagnetic grains are those grains whose remanence relaxes quickly. A convenient critical relaxation time, for purposes of laboratory experiments may be taken as ~100 s. Effective paleomagnetic recorders must have relaxation times on the order of geological time. So it might be more appropriate to choose \\taus of the age of the Earth (4.5 Gyr) as the relevant relaxation for geological time scales.\n\nWe will now consider various mechanisms by which rocks can become magnetized. The first mechanism, viscous remanent magnetization, is simply a consequence of \n\nEquation 4.18 in Chapter 4 and \n\nFigure 7.2a. Later, we will explore the role of temperature and grain volume in blocking of thermal and chemical remanences. We will finish this chapter with other remanences which are either rare or non-existent in nature but are nonetheless useful in paleomagnetism.","type":"content","url":"/chapter7#essential-n-el-theory","position":5},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Viscous remanent magnetization"},"type":"lvl2","url":"/chapter7#sect-vrm","position":6},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Viscous remanent magnetization"},"content":"Placing a magnetic particle at an angle \\theta to an external magnetic field results in a magnetostatic energy E_m of -\\m \\cdot \\B = -mB\\cos \\theta, which is at a minimum when the moment is aligned with the field (see Chapters 1 and 5). Given an arbitrary \\theta, the difference in E_m between the two easy directions is given by:\\Delta E = 2(\\m \\cdot \\B) = 2mB \\cos \\theta.\n\nBecause of the energy of the applied field E_m, the energy necessary to flip the moment from a direction with a high angle to the external field to the other direction with a lower angle is less than the energy necessary to flip the other way around. Therefore, a given particle will tend to spend more time with its moment at a favorable angle to the applied field than in the other direction. Moreover, the Boltzmann distribution law tells us that the longer we wait, the more likely it is for a given magnetic grain to have the energy to overcome the barrier and flip its moment. That is why over time the net magnetization of assemblages of magnetic particles will tend to grow (or decay) to some equilibrium magnetization M_e.\n\nWe can visualize what happens in \n\nFigure 7.3. Let us place an assemblage of magnetic grains with some initial magnetization M_o in a magnetic field. At a given time span of observation (\\tau), particles with that relaxation time are likely to have sufficient energy to overcome the energy barriers. In a given assemblage of blocking energies (shown as the contours), some grains will be tending toward equilibrium with the external field (those to the left and below the blocking energy line) while some will tend to remain fixed (those to the right of the line). As the time span of observation increases, the critical blocking energy line migrates up and to the right (moving from 100 s, to 1 Myr, and so on) and whatever initial magnetic state the population was in will be progressively re-magnetized in the external field.\n\n\n\nFigure 7.4:Magnetization versus time for a) Saturation remanence placed in zero field. b) Zero initial magnetization placed in a field. c) Magnetization placed in an antiparallel field.\n\nIn \n\nFigure 7.4 we consider a few different scenarios for M_o and the applied field. First, the already familiar case when a specimen with a net magnetization (M_o) is placed in zero external field; the magnetization will decay to zero as in \n\nFigure 7.4a. Conversely, if a specimen with zero initial remanence is put into a magnetic field, the magnetization M(t) will grow to M_e by the complement of the decay equation:M(t) = M_e(1-e^{-t/\\tau}),\n\nas shown in \n\nFigure 7.4b. The magnetization that is acquired in this isochemical, isothermal fashion is termed viscous remanent magnetization or VRM and the equilibrium magnetization M_e is a function of the external field B.\n\nThe general case, in which the initial magnetization of a specimen is nonzero and the equilibrium magnetization is of arbitrary orientation to the initial remanence, the equation can be written as:\\M(t) = \\M_o + (\\M_e-\\M_o)(1-e^{-t/\\tau}) = \\M_e + (\\M_o-\\M_e) \\cdot e^{-t/\\tau},\n\nwhich grows (or decays) exponentially from \\M_o \\rightarrow \\M_e as t \\rightarrow \\infty. The rate is not only controlled by \\tau, but also by the degree to which the magnetization is out of equilibrium (see \n\nFigure 7.4c).\n\n\n\nFigure 7.5:Migration of the relaxation times of a population of magnetic grains from a) low anisotropy energy at high temperature to b) high anisotropy energy at lower temperatures and the resulting change in relaxation times. The relaxation time curves also migrate up and to the right with lower thermal energy. Any particle initially to the right or above the superparamagnetic line would acquire a TRM its anisotropy energy density migrated across the line by cooling. Note that the anisotropy energy density (K from Chapter 4) itself is a function of temperature through its dependence on magnetization, so a given population of grains will change with changing temperature, migrating to the left with higher temperature as magnetization goes down.\n\nSome temporally short data sets appear to follow the relation M(t) \\propto \\log(t) and Néel \n\nNéel (1949)\n\nNéel (1955) suggested that VRM = S log t. Such a relationship suggests infinite remanence as t \\rightarrow \\infty, so cannot be true over a long period of time. S log t behavior can generally only be observed over a restricted time interval and closely spaced, long-term observations do not show linear log(t)-behavior, but are all curved in log(t) space. When under-sampled, these time series can appear segmented, leading to interpretations of several quasi-linear features (multiple values of S), when in fact the time series are not linear at all.\n\nVRM is a function of time and the relationship between the remanence vector and the applied field. When the relaxation time is short (say a few hundred seconds), the magnetization is essentially in equilibrium with the applied magnetic field hence is superparamagnetic. Because relaxation time is also a strong function of temperature, VRM will grow more rapidly at higher temperature. As noted in Chapter 4 there is a very sharply defined range of temperatures over which \\tau increases from geologically short to geologically long time scales. In the next section, we consider the magnetization acquired by manipulating relaxation time by changing temperature: thermal remanent magnetization (TRM).\n\n\n\nFigure 7.6:Variation of relaxation time versus temperature for magnetite ellipsoids of different widths (all with length to width ratios of 1.3:1).","type":"content","url":"/chapter7#sect-vrm","position":7},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Thermal remanent magnetization"},"type":"lvl2","url":"/chapter7#sect-trm","position":8},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Thermal remanent magnetization"},"content":"The v-K diagram shown in \n\nFigure 7.5 illustrates how TRM can be blocked. In \n\nFigure 7.5a we have a population of magnetic grains with varying volumes and anisotropies. Raising temperature works in two ways on these grains. First, the relaxation time depends on thermal energy, so higher temperatures will result in lower blocking temperatures. Second, anisotropy energy depends on the square of magnetization (Chapter 4). Elevated temperature reduces magnetization, so the anisotropy energy will be depressed relative to lower temperatures. In the diagram, this means that not only do the relaxation time curves move with changing temperature, but the anisotropy energies of the population of grains change as well. This means that a population of grains that are superparamagnetic at high temperature (\n\nFigure 7.5a) could be “blocked” as cooling causes the grains to “walk” through the superparamagnetic threshold into a region of magnetic stability (\n\nFigure 7.5b).\n\nThe key to Néel theory is that very small changes in conditions (temperature, volume, anisotropy energy) can result in enormous changes in relaxation time. In order to work out how relaxation time varies with temperature, we need to know how saturation magnetization varies with temperature. We found in Chapter 3 that calculating M_s(T) exactly is a rather messy process. If we take a reasonable value for \\gamma in \n\nEquation 7.4 from the data in Chapter 3 or \\gamma \\simeq 0.38 and M_s = 480 kAm^{-1} (from Chapter 6) we can calculate the variation of relaxation time as a function of temperature for ellipsoidal grains of various widths using \n\nEquation 7.3 (see \n\nFigure 7.6). At room temperature, a 25 nm ellipsoid of magnetite (length to width ratio of 1.3:1) would have a relaxation time of billions of years, while at 300°C, the grain would be superparamagnetic.\n\nThe sharpness of the relationship between relaxation time and temperature allows us to define a temperature above which a grain is superparamagnetic and able to come into magnetic equilibrium with an applied field and below which it is effectively blocked. The temperature at which \\tau is equal to a few hundred seconds is defined as the blocking temperature or T_b. At or above the blocking temperature, but below the Curie Temperature, a grain will be superparamagnetic. Cooling below T_b increases the relaxation time sharply, so the magnetization is effectively blocked and the rock acquires a thermal remanent magnetization or TRM.\n\n\n\nFigure 7.7:a) Picture of lava flow courtesy of Daniel Staudigel. b) While the lava is still well above the Curie temperature, crystals start to form, but are non-magnetic. c) Below the Curie temperature but above the blocking temperature, certain minerals become magnetic, but their moments continually flip among the easy axes with a statistical preference for the applied magnetic field. As the lava cools down, the moments become fixed, preserving a thermal remanence. [b) and c) modified from animation of Genevieve Tauxe.] [Figure from \n\nTauxe & Yamazaki (2007).]\n\nNow let us put some of these concepts into practice. Consider a lava flow which has just been extruded (\n\nFigure 7.7a). Upon meeting the chilly air (or water), molten lava solidifies quickly into rock. While the rock is above the Curie Temperature, there is no remanent magnetization; thermal energy dominates the system and the system behaves as a paramagnet. As the rock cools through the Curie Temperature of its magnetic phase, exchange energy becomes more important and the magnetic minerals become ferromagnetic. The magnetization, however, is free to track the prevailing magnetic field because anisotropy energy is still less important than the magnetostatic energy. The magnetic grains are superparamagnetic and the magnetization is in magnetic equilibrium with the ambient field.\n\nThe magnetic moments in the lava flow tend to flop from one easy direction to another, with a slight statistical bias toward the direction with the minimum angle to the applied field (\n\nFigure 7.7c). Thus, the equilibrium magnetization of superparamagnetic grains is not fully aligned, but only slightly aligned, and the degree of alignment is a linear function of the applied field for low fields like the Earth’s. The magnetization approaches saturation at higher fields (from ~0.2 T to several tesla, depending on the details of the source of anisotropy energy).\n\nRecalling the energy difference between the two easy axes of a magnetic particle in the presence of a magnetic field (\n\nEquation 7.5), we can estimate the fraction of saturation for an equilibrium magnetization at a given temperature. Applying the Boltzmann distribution law to the theory of thermal remanence, we take \\Delta E from \n\nEquation 7.5 to be 2mB\\cos \\theta, and the two states to be the two directions along the easy axis, one maximally parallel to and the other antiparallel to the applied field B. The total number of particles N equals the sum of those aligned maximally parallel n_+ and those aligned maximally antiparallel n_-. So from the Boltzmann distribution we have:\\frac{n_+}{n_-} = e^{2mB\\cos \\theta/kT}.\n\nThe magnetization of such a population, with the moments fully aligned is at saturation, or M_s. The strength of magnetization at a given temperature M(T) would be the net moment or n_+-n_-. So it follows that:\\frac{M(T)}{M_s} = \\frac{n_+ - n_-}{n_+ + n_-},\n\nWith a little work this can be transformed into:\\frac{1 - \\exp[-2mB\\cos \\theta / kT]}{1 + \\exp[-2mB\\cos \\theta / kT]},\n\nwhich in turn can be boiled down to:\\frac{M(T)}{M_s} = \\tanh \\frac{mB \\cos \\theta}{kT}.\n\nNow imagine that the process of cooling in the lava continues. The thermal energy will continue to decrease until the magnetic anisotropy energy becomes important enough to “freeze in” the magnetic moment wherever it happens to be. Thus, as the particles cool through their “blocking” temperatures (T_b), the moments become fixed with respect to further changes in field and to get the final magnetization for randomly oriented grains, we integrate over \\theta or:\\frac{M_{TRM}}{M_s} = \\int_0^{90} \\tanh \\frac{m_oB\\cos \\theta}{kT} \\cos \\theta \\sin \\theta \\, d\\theta,\n\nwhere m_o is the grain moment at the blocking temperature.\n\n\n\nFigure 7.8:Relationship of TRM with respect to the applied field for different assemblages of magnetite grains. a) Theoretical calculations of TRM acquisition for different assemblages of randomly oriented non-interacting single domain ellipsoids of magnetite. b) Experimentally determined TRM acquisition in three natural specimens. [Redrawn from \n\nSelkin et al. (2007).]\n\nWe show the theoretical behavior of TRM as a function of applied field for different assemblages of particles in \n\nFigure 7.8a. This plot was constructed assuming ellipsoidal particles whose saturation magnetization varied according to \n\nEquation 7.4 from Chapter 3 with \\gamma=0.38. For small, equant particles, TRM is approximately linear with applied field for values of B as small as the Earth’s (~20-65 μT). However, the more elongate and the larger the particle, the more non-linear the theoretically predicted TRM behaves. This non-linear behavior has been experimentally verified by \n\nSelkin et al. (2007) for geologically important materials (see \n\nFigure 7.8b).\n\n\n\nFigure 7.9:Distribution of blocking temperatures of a typical basaltic specimen. The solid line labeled TRM indicates the amount of TRM remaining after step heating to increasingly higher temperature. The colored blocks labeled PTRM shows the amount of TRM blocked within corresponding temperature intervals.\n\nThe exact distribution of blocking temperatures depends on the distribution of grain sizes and shapes in the rock and is routinely determined in paleomagnetic studies. By heating a rock in zero field to some temperature T, grains with relaxation times that are superparamagnetic at that temperature become randomized, a process used in so-called thermal demagnetization which will be discussed further in Chapter 9. Thermal demagnetization allows us to determine the portion of TRM that is blocked within successive blocking temperature intervals. A typical example is shown in \n\nFigure 7.9. The total TRM can be broken into portions acquired in distinct temperature intervals. The portion of TRM blocked in any particular blocking temperature window is referred to as partial TRM, often abbreviated pTRM. Each pTRM is a vector quantity, and for single domain remanences, the total TRM is the vector sum of the pTRMs contributed by all blocking temperature windows:\\text{TRM} = \\sum_i^n \\text{pTRM}(T_{bi}).\n\nAccording to Néel theory for single domains, individual pTRMs depend only on the magnetic field during cooling through their respective blocking temperature intervals and are not affected by magnetic fields applied during cooling through lower temperature intervals. This is the law of additivity of pTRM. Another useful feature of pTRMs in single domain grains is that their blocking temperatures are the same as the temperature at which the remanence is unblocked, the so-called unblocking temperature (T_{ub}). This is the law of reciprocity. While it may seem intuitively obvious that T_b would be the same as T_{ub}, it is actually only true for single domain grains and fails spectacularly for multi-domain grains and even grains whose remanences are in the vortex state.\n\nAs an example of the laws of additivity and reciprocity of pTRM, again consider our lava flow. It originally cooled to produce a TRM that is the vector sum of all pTRMs with T_b distributed from T_c to room temperature. If the magnetic field was constant during the original cooling, all pTRMs would be in the same direction. Now consider that this rock is subsequently reheated for even a short time to a temperature, T_r, intermediate between room temperature and the Curie temperature and then cooled in a different magnetizing field. All pTRMs with T_{ub} < T_r will record the new magnetic field direction. However, neglecting time-temperature effects to be considered later, the pTRMs with T_{ub} > T_r will retain the TRM record of the original magnetizing field. This ability to strip away components of magnetization held by grains with low unblocking temperatures while leaving the higher T_{ub} grains unaffected is a fundamental element of the thermal demagnetization technique to be discussed in later chapters.\n\n\n\nFigure 7.10:Dependence of intensity of TRM on particle diameter of magnetite. Magnetite particles were dispersed in a non-magnetic matrix; the intensity of TRM is determined per unit volume of magnetite and normalized to the maximum TRM observed to allow comparison between experiments that used varying concentrations of dispersed magnetite; the magnetizing field was 100 μT. [Data compiled by \n\nDunlop & Özdemir (1997).]\n\nPerhaps the most severe simplification in the above model of TRM acquisition is that it considers only single-domain grains. Given the restricted range of grain size and shape distributions for stable SD grains of magnetite or titanomagnetite (see Chapter 4), at most a small percentage of grains in a typical igneous rock are truly SD. The question then arises as to whether larger grains can acquire TRM.\n\nFigure 7.10 shows the particle size dependence of TRM acquired by magnetite in a magnetizing field 100 μT. Note that it is a log-log plot and efficiency of TRM acquisition very low in the grain-size range from 1 μm to about 10 μm. However, grains in 1-2 μm range do acquire TRM that can be stable against time decay and against demagnetization by later magnetic fields. This observation is the source of the term pseudo-single domain (PSD; see also Chapter 5) which characterizes the behavior of grains that are too large to be truly single domain, yet do exhibit stability unexpected for grains with domain walls (MD grains). The physics of PSD grains is much more complicated than for SD grains and is not fully understood (see \n\nSection 5.3 for a brief discussion.)\n\nFor grains larger than a few microns, the acquisition of TRM is very inefficient. In addition, TRM in these larger grains can be quite unstable; they are prone to acquire viscous magnetization. SD and PSD grains are the effective carriers of TRM, while larger MD grains are likely to carry a component of magnetization acquired long after original cooling.\n\nRapidly cooled volcanic rocks generally have grain-size distributions with a major portion of the distribution within SD and PSD ranges. Also deuteric oxidation of volcanic rocks can produce intergrowth grains with effective magnetic grain size less than the magnetic grains that crystallized from the igneous melt. Thus, volcanic rocks are commonly observed to possess fairly strong and stable TRM. A typical intensity of TRM in a basalt flow is 1 Am^{-1}. Because grain size depends in part on cooling rate of the igneous body, rapidly cooled extrusive rocks are frequently preferable to slowly cooled intrusive rocks. However, exsolution processes can break what would have been unsuitable MD magnetic grains into ideal strips of SD-like particles (see Chapter 6) so there is no universal rule as to which rocks will behave in the ideal single domain manner.\n\n\n\nFigure 7.11:Migration of the blocking energy of grains by increasing volume. The relaxation times of a population of magnetic grains from a) short relaxation times when the particles are small to b) long relaxation times when the grains have grown through their blocking volumes.","type":"content","url":"/chapter7#sect-trm","position":9},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Chemical remanent magnetization"},"type":"lvl2","url":"/chapter7#sect-crm","position":10},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Chemical remanent magnetization"},"content":"Equation 7.3 shows that blocking energy depends on volume. This means that relaxation time could change from very short to very long by increasing the size of the grain (see \n\nFigure 7.11). Chemical changes that form ferromagnetic minerals below their blocking temperatures which then grow in a magnetizing field result in acquisition of a chemical remanent magnetization or CRM. Chemical reactions involving ferromagnetic minerals include a) alteration of a pre-existing mineral (possibly also ferromagnetic) to a ferromagnetic mineral—alteration chemical remanence (aCRM)—or b) precipitation of a ferromagnetic mineral from solution—grain-growth CRM (gCRM).\n\n\n\nFigure 7.12:Grain growth CRM. a) Red beds of the Chinji Formation, Siwaliks, Pakistan. The red soil horizons have a CRM carried by pigmentary hematite. b) Initial state of non-magnetic matrix. c) Formation of superparamagnetic minerals with a statistical alignment with the ambient magnetic field (shown in blue).\n\nMagnetic mineralogy can change after a rock is formed in response to changing chemical environments. Red beds (see \n\nFigure 7.12a), a dominant sedimentary facies in earlier times, are red because pigmentary hematite grew at some point after deposition. Hematite is a magnetic phase and the magnetic remanence it carries when grown at low temperatures is an example of gCRM.\n\nMagnetite is an example of a magnetic phase which is generally out of chemical equilibrium in many environments on the Earth’s surface. It tends to oxidize to another magnetic phase (maghemite) during weathering. As it changes state, the iron oxide may change its magnetic moment, acquiring an aCRM.\n\nThe relationship of the new born CRM to the ambient magnetic field can be complicated. It may be largely controlled by the prior magnetic phase whence it came, it may be strongly influenced by the external magnetic field, or it may be some combination of these factors. We will begin with the simplest form of CRM—the gCRM.\n\nInspection of \n\nEquation 7.3 for relaxation time reveals that it is a strong function of grain volume. A similar theoretical framework can be built for remanence acquired by grains growing in a magnetic field as for those cooling in a magnetic field. As a starting point for our treatment, consider a non-magnetic porous matrix, say a sandstone. As ground water percolates through the sandstone, it begins to precipitate tiny grains of a magnetic mineral (\n\nFigure 7.12c). Each crystal is completely isolated from its neighbors. For very small grains, the thermal energy dominates the system and they are superparamagnetic. When volume becomes sufficient for magnetic anisotropy energy to overcome the thermal energy, the grain moment is blocked and can remain out of equilibrium with the magnetic field for geologically significant time periods. Keeping temperature constant, there is a critical blocking volume v_b below which a grain maintains equilibrium with the applied field and above which it does not. We can find this blocking volume by solving for v in the Néel equation:v_b = \\frac{kT\\ln(C\\tau)}{K_u}.\n\nThe magnetization acquired during grain growth is controlled by the alignment of grain moments at the time that they grow through the blocking volume. Based on these principles, CRM should behave very similarly to TRM.\n\nThere have been a few experiments carried out with an eye to testing the grain growth CRM model and although the theory predicts the zeroth order results quite well (that a simple CRM parallels the field and is proportional to it in intensity), the details are not well explained, primarily because the magnetic field affects the growth of magnetic crystals and the results are not exactly analogous to TRM conditions (see e.g. \n\nStokking & Tauxe (1990)). Moreover, gCRMs acquired in changing fields can be much more complicated than a simple single generation, single field gCRM \n\nStokking & Tauxe (1990).\n\nAlteration CRM can also be much more complicated than simple gCRM in a single field. Suffice it to say that the reliability of CRM for recording the external field must be verified (as with any magnetic remanence) with geological field tests and other techniques as described in future chapters.\n\n\n\nFigure 7.13:Depositional remanence versus applied field for redeposited glacial varves. B_o was the field in the lab. [Data from \n\nJohnson et al. (1948); figure from \n\nTauxe (1993).]","type":"content","url":"/chapter7#sect-crm","position":11},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Detrital remanent magnetization"},"type":"lvl2","url":"/chapter7#sect-drm","position":12},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Detrital remanent magnetization"},"content":"Sediments become magnetized in quite a different manner from igneous bodies. Detrital grains are already magnetized, unlike igneous rocks which crystallize above their Curie temperatures. Magnetic particles that can rotate freely will turn into the direction of the applied field just as compass needles do. The net magnetization of such particles, if locked in place can result in a depositional remanent magnetization (DRM). Sediments are also subject to post-depositional modification through the action of organisms, compaction, diagenesis and the acquisition of VRM all of which will affect the magnetization. This magnetization is usually called post-depositional remanent magnetization or pDRM. In the following, we will consider the syn-depositional processes of physical alignment of magnetic particles in viscous fluids (giving rise to the primary DRM).","type":"content","url":"/chapter7#sect-drm","position":13},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl3":"Physical alignment of magnetic moments in viscous fluids","lvl2":"Detrital remanent magnetization"},"type":"lvl3","url":"/chapter7#physical-alignment-of-magnetic-moments-in-viscous-fluids","position":14},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl3":"Physical alignment of magnetic moments in viscous fluids","lvl2":"Detrital remanent magnetization"},"content":"The theoretical and experimental foundation for DRM is less complete than for TRM. Placing a magnetic moment \\bf m in an applied field \\bf B results in a torque \\Gamma on the particle {\\bf \\Gamma} = {\\bf m} \\times {\\bf B} = mB\\sin \\theta, where \\theta is the angle between the moment and the magnetic field vector. In a fluid like water, the torque is opposed by the viscous drag and inertia so the equation of motion governing the approach to alignment is:I \\frac{d^2 \\theta}{dt^2} = -\\lambda \\frac{d \\theta}{dt} - m B \\sin \\theta,\n\nwhere \\lambda is the viscosity coefficient opposing the motion of the particle through the fluid and I is the moment of inertia. Neglecting the inertial term (which is orders of magnitude less important than the other terms) we have:\\tan \\frac{\\theta}{2} = \\tan \\frac{\\theta_o}{2} e^{-m B t/\\lambda},\n\nwhere \\theta_o is the initial angle between {\\bf m} and {\\bf B} \n\nNagata (1961). By setting \\lambda = 8\\pi r^3 \\eta where r is the particle radius and \\eta to the viscosity of water (~10^{-3} kg m^{-1}s^{-1}), the time constant \\Upsilon of \n\nEquation 7.16 over which an initial \\theta_o reduces to 1/e of its value would be:\\Upsilon = \\frac{\\lambda}{mB} = \\frac{6 \\eta}{MB},\n\nwhere M is the volume normalized magnetization.\n\nPlugging in reasonable values for \\eta, M and B and assuming isolated magnetic particles yields a time constant that is extremely short (microseconds). The simple theory of unconstrained rotation of magnetic particles in water as developed by \n\nNagata (1961) predicts that sediments with isolated magnetic particles should have magnetic moments that are fully aligned and insensitive to changes in magnetic field strength; DRM should be at saturation. Yet even from the earliest days of laboratory redeposition experiments (e.g., \n\nJohnson et al. (1948); see \n\nFigure 7.13a) we have known that depositional remanence (DRM) can have a strong field dependence and that DRMs are generally far less than saturation remanences (~0.1%). Much of the research on DRM has focussed on explaining the strong field dependence observed for laboratory redepositional DRM.\n\n\n\nFigure 7.14:a) Schematic drawing of traditional view of the journey of magnetic particles from the water column to burial in a non-flocculating (freshwater) environment. Magnetic particles are black. b) View of depositional remanence in a flocculating (marine) environment. [Figure from \n\nTauxe & Yamazaki (2007).]\n\nThe observation that DRM is usually orders of magnitude less than saturation and that it appears to be sensitive to changing geomagnetic field strengths implies that the time constant of alignment is much longer than predicted by \n\nEquation 7.17. Either there is a disruption of alignment by some mechanism, or we have underestimated \\Upsilon somehow.\n\nCollinson (1965) invoked Brownian motion to disrupt alignment. Reasonable parameter assumptions suggest that particles smaller than about 100 nm could be affected by Brownian motion suggesting a possible role in DRM of isolated magnetite grains free to rotate in water. The problem with this suggestion is that such small particles take an extremely long time to settle. Also, in almost all natural waters, magnetite particles will adhere to clay particles making isolated magnetic particles in nature unlikely (see, e.g., \n\nKatari & Tauxe (2000)).\n\nTo increase \\Upsilon, one can either assume a larger viscosity than that of pure water, or decrease magnetization by for example, using values for M much lower than the saturation magnetizations of common magnetic minerals (e.g., \n\nCollinson (1965)) or padding the magnetic particles with non-magnetic “fluff” through the process of flocculation \n\nShcherbakov & Shcherbakova (1983). Using the viscosity in the sediment itself in \n\nEquation 7.17 fails to explain laboratory remanences that are demonstrably “fixed” after settling—the viscosity of the mud appears to be too high to allow post-depositional re-alignment, yet these sediments exhibit field dependence (e.g., \n\nTauxe et al. (2006)). Alternatively, one could increase \\Upsilon by assuming a reduced value for M. However, even using the magnetization of hematite, which is two orders of magnitude lower than magnetite, results in values for \\Upsilon that are still less than a second.\n\nIn saline environments, sedimentary particles tend to flocculate. For magnetic particles embedded in a non-magnetic matrix, the magnetic field must turn the entire particle and the net magnetization of the floc must be used in \n\nEquation 7.17.\n\n\n\nFigure 7.15:a) Numerical simulations of Brownian remanent magnetization (BRM) for various sizes of magnetite. b) BRM simulated for distribution of particle sizes of magnetite shown in inset. [Figure from \n\nTauxe & Yamazaki (2007).]\n\nThe tendency to flocculate increases with increasing salinity. There are therefore two completely different systems when discussing DRM: ones in which magnetic particles remain essentially isolated or embedded in very small flocs (e.g., in freshwater lakes; see \n\nFigure 7.14a) and ones in which flocculation plays a role (e.g., marine environments; see \n\nFigure 7.14b). For the case of magnetite in freshwater, Brownian motion may reduce DRM efficiency and give rise to the dependence on B. In saline waters, however, the most important control on DRM is the size of the flocs in which the magnetic particles are embedded. In the following we briefly explore these two very different environments.","type":"content","url":"/chapter7#physical-alignment-of-magnetic-moments-in-viscous-fluids","position":15},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl4":"Non-flocculating environments","lvl3":"Physical alignment of magnetic moments in viscous fluids","lvl2":"Detrital remanent magnetization"},"type":"lvl4","url":"/chapter7#non-flocculating-environments","position":16},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl4":"Non-flocculating environments","lvl3":"Physical alignment of magnetic moments in viscous fluids","lvl2":"Detrital remanent magnetization"},"content":"In freshwater we expect to have relatively unflocculated particles whose magnetic moments are presumably a saturation remanence. Although, even in fresh water, the magnetic particles are likely to be attached to clays through van der Waals attraction the clays themselves have no great mutual attraction. It is possible, therefore that magnetic particles could be subject to Brownian motion. Here we outline the theory to investigate the behavior of DRM that would be expected from a Brownian motion mechanism (henceforth a Brownian remanent magnetization or BRM).\n\nTo estimate the size of particles affected by Brownian motion, \n\nCollinson (1965) used the equation:\\frac{1}{2} mB\\phi^2 = \\frac{1}{2} kT,\n\nwhere \\phi is the Brownian deflection about the applied field direction (in radians), k is Boltzmann’s constant (1.38 × 10^{-23} JK^{-1}) and T is the temperature in kelvin. The effect of viscous drag on particles may also be important when the magnetic moments of the particles are low (see \n\nCoffey et al. (1996) for a complete derivation), for which we have:\\frac{\\phi^2}{\\delta} = \\frac{kT}{4\\pi \\eta r^3},\n\nwhere \\delta is the time span of observation (say, 1 second). According to this relationship, weakly magnetized particles smaller than about a micron will be strongly affected by Brownian motion. Particles that have a substantial magnetic moment however, will be partially stabilized (according to \n\nEquation 7.18) and might remain unaffected by Brownian motion to smaller particle sizes (e.g., 0.1 μm). In the case of isolated particles of magnetite, therefore, we should use \n\nEquation 7.18 and BRM should follow the Langevin equation for paramagnetic gases, i.e.:\\frac{BRM}{sIRM} = \\coth \\left( \\frac{mB}{kT} \\right) - \\frac{kT}{mB}.\n\nHere the quantity sIRM is a saturation isothermal remanence (M_r in Chapter 5) and is the moment acquired when all the magnetic particles are aligned to the maximum extent possible. To get an idea of how BRMs would behave, we first find m from M(r) [here we use the results from micromagnetic modeling (see Chapter 4)]. Then, we evaluate \n\nEquation 7.20 as a function of B for a given particle size (see \n\nFigure 7.15a). We can also assume any distribution of particle sizes (e.g., that shown as the inset to \n\nFigure 7.15b), and predict BRM/sIRM for the distribution (blue line in \n\nFigure 7.15b). It is interesting to note that BRMs are almost never linear with the applied field unless the particle sizes are very small.\n\nBRMs are fixed when the particles are no longer free to move. The fixing of this magnetization presumably occurs during consolidation, at a depth (known as the lock-in depth) where the porosity of the sediment reduces to the point that the particles are pinned (see \n\nFigure 7.14a). Below that, the magnetization may be further affected by compaction (e.g., \n\nDeamer & Kodama (1990)) and diagenesis (e.g., \n\nRoberts (1995)).\n\n\n\nFigure 7.16:a) Results of numerical experiments of the flocculation model using the parameters: l=0.2 m and the viscosity of water. M/M_o is the DRM expressed as a fraction of saturation, holding \\bar m constant and varying B. For a given field strength, particles are either at saturation or randomly oriented, except for within a very narrow size range. b) Same as a) but plotted versus applied field (B). [Figures from \n\nTauxe et al. (2006).]","type":"content","url":"/chapter7#non-flocculating-environments","position":17},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl4":"Flocculating environments","lvl3":"Physical alignment of magnetic moments in viscous fluids","lvl2":"Detrital remanent magnetization"},"type":"lvl4","url":"/chapter7#sect-flocs","position":18},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl4":"Flocculating environments","lvl3":"Physical alignment of magnetic moments in viscous fluids","lvl2":"Detrital remanent magnetization"},"content":"Equation 7.16 predicts that a magnetic moment \\bf m making an initial angle \\theta_o with the applied field \\bf B will make an angle \\theta with the field after time t. From this, we can make a simple numerical model to predict the DRM for an initially randomly oriented assemblage of magnetic moments, after time t [or the equivalent settling length l using some settling law (e.g., \n\nGibbs (1985); see \n\nKatari & Bloxham (2001))]. In \n\nFigure 7.16a and b, we show the DRM curves predicted by \n\nTauxe et al. (2006) for simple flocs with a single magnetite grain in each as a function of magnetic field and radius.\n\nIn general, the magnetic flocs are either nearly aligned with the magnetic field, or nearly random with only a narrow band of floc sizes in between the two states for a given value of B. Increasing B increases the size for which particles can rotate into the field, giving rise to the dependence of DRM intensity on applied field strength. Taking a given particle size and evaluating DRM as a function of the applied field (\n\nFigure 7.16b) predicts the opposite behavior for DRM than the Brownian motion approach (\n\nFigure 7.15) in that the larger the floc size, the weaker the DRM and also the more linear with respect to the applied field. Brownian motion, therefore, predicts low DRM efficiency for the smallest particles increasing to near saturation values for particles around 0.1 μm while composite floc theory predicts decreased DRM efficiency for larger floc sizes.\n\n\n\nFigure 7.17:Results of settling experiments as a function of field (B) in a flocculating environment. The assumed mean and standard deviations of truncated log-normal distributions for floc radii are shown in the legends and are indicated using the different line styles in the figure. [Figure from \n\nTauxe & Yamazaki (2007) after \n\nTauxe et al. (2006).]\n\nThe flocculation model of DRM makes specific predictions which can in principle be tested if the model parameters can be estimated or controlled. \n\nTauxe et al. (2006) tested the flocculation hypothesis by dispersing natural sediments in settling tubes to which varying amounts of NaCl had been introduced. Prior to dispersal, each specimen of mud was given a saturation remanence. They measured DRM as a function of salinity (and therefore floc size) and the applied field (see \n\nFigure 7.17). In general their results suggested the following: 1) the higher the salinity, the lower the net moment and the faster the particles settled, 2) the higher the applied field, the higher the net moment, although a saturation DRM appeared to be nearly achieved in the 1 ppt NaCl set of tubes by 30 μT (\n\nFigure 7.17), 3) the relationship of DRM to B was far from linear with applied field in all cases, and 4) the saturation DRM was less than the saturation IRM so the simplest idea of one floc/one magnetic particle failed to explain the data.\n\nIn nature, flocs are formed by coalescing of “fundamental flocs” into composite flocs. Each fundamental floc would have tiny magnetic particles adhering to them and would have the sIRM imparted prior to settling. As the composite flocs grow by chance encounters with other flocs, the net moment of the composite floc will be the vector sum of the moments of the fundamental flocs. \n\nTauxe et al. (2006) used the composite floc hypothesis to model experimental DRMs (see examples in \n\nFigure 7.17); model predictions were in excellent agreement with the redeposition data.","type":"content","url":"/chapter7#sect-flocs","position":19},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl3":"Post-depositional processes","lvl2":"Detrital remanent magnetization"},"type":"lvl3","url":"/chapter7#post-depositional-processes","position":20},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl3":"Post-depositional processes","lvl2":"Detrital remanent magnetization"},"content":"It appears that by combining the effects of Brownian motion for non-flocculating environments and a composite floc model for flocculating environments we are on the verge of a quantitative physical theory that can account for the acquisition of depositional remanence near the sediment/water interface. The DRM will be fixed when no further physical rotation of the magnetic particles in response to the geomagnetic field is possible. The depth at which moments are pinned is called the lock-in depth. In the “standard model” of depositional remanence (DRM) acquisition (see, e.g., \n\nVerosub (1977)) detrital remanence is acquired by locking in different grains over a range of depths. This phased lock-in leads to both significant smoothing and to an offset between the sediment/water interface and the fixing of the DRM. Many practitioners of paleomagnetism still adhere to this concept of DRM which stems from the early laboratory redeposition experiments which were carried out under non-flocculating conditions, however. As summarized by \n\nTauxe et al. (2006), the evidence for substantial smoothing and a deep (>10 cm) lock in remains weak.\n\nPhysical rotation of particles in response to compaction can also change the magnetic remanence. As sediments lose water and consolidate, compaction can have a strong effect on DRM intensity (e.g., \n\nAnson & Kodama (1987)). Consolidation is a continuous process starting from the sediment water interface when sedimentary particles first gel (see, e.g., \n\nFigure 7.14b) and continuing until the sediment is completely compacted, perhaps as deep as hundreds of meters. The effect on magnetic remanence depends on volume loss during compaction which depends largely on clay content, so clay rich sediments will have the largest effect.\n\nOther processes not involving post-depositional physical rotation of magnetic particles including “viscous” (in the sense of magnetic viscosity) remagnetization and diagenetic alteration resulting in a chemical remanence may also modify the DRM. All of these processes influence the intensity of remanence and hamper our efforts to decipher the original geomagnetic signal.","type":"content","url":"/chapter7#post-depositional-processes","position":21},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl3":"Inclination Error","lvl2":"Detrital remanent magnetization"},"type":"lvl3","url":"/chapter7#inclination-error","position":22},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl3":"Inclination Error","lvl2":"Detrital remanent magnetization"},"content":"\n\nFigure 7.18:Applied field inclination versus remanent inclination for redeposited river sediments. Best fit line is with f=0.55. [Data from \n\nTauxe & Kent (1984).]\n\nSome sedimentary remanences show a remanence vector that is generally shallower than the applied field, a phenomenon known as inclination error. We show the results of a typical laboratory redeposition experiment \n\nTauxe & Kent (1984) in \n\nFigure 7.18. The tangent of the observed inclination is usually some fraction (~0.4-0.6) of the tangent of the applied field \n\nKing (1955). Thus, inclination error is at a maximum at 45° and is negligible at high and low inclinations. \n\nTauxe & Kent (1984) also demonstrated a strong link between DRM efficiency and inclination error. Sediments exhibiting inclination error have the strongest remanences in horizontal fields and the weakest in vertical fields.\n\nInterestingly, many natural sediments (e.g. deep sea or slowly deposited lake sediments) display no inclination error. The worst culprits appear to be sediments whose NRM is carried by detrital hematite, a flakey particle with a small saturation remanence.\n\n\n\nFigure 7.19:Outcrop photo showing sampling locations and charred stump of tree that was hit by lightning in foreground. b) Impulse field required to reproduce the NRM intensity as an IRM, plotted as a function of distance from the tree shown in a). Dashed line is best-fit to the data assuming that the tree at the center of the photo was the site of a remagnetizing line current (lightning bolt) of 300,000 Amps. [Figures from \n\nTauxe et al. (2003).]","type":"content","url":"/chapter7#inclination-error","position":23},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Isothermal remanent magnetization"},"type":"lvl2","url":"/chapter7#sect-irm","position":24},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Isothermal remanent magnetization"},"content":"Examination of \n\nEquations 7.1 and \n\n7.3 reveals an interesting dependence of relaxation time on the coercivity of magnetic particles. We can coax the magnetization of otherwise firmly entrenched particles to follow an applied field, if that field is larger than the coercivity. Exposing a particle to a large magnetic field, will allow magnetic particles whose coercivity is below that field to flip their magnetic moments to a direction at a more favorable angle to the applied field, resulting in a gain in magnetic remanence in that direction. This type of magnetic remanence is called an isothermal remanent magnetization or IRM (see Chapters 4 and 5).\n\nIRM is unfortunately a naturally occurring remanence. When lightning strikes in the neighborhood, rocks can become either partially or entirely remagnetized (see \n\nFigure 7.19). These magnetizations often mask the primary magnetization (TRM or DRM), but can sometimes be removed.\n\nIRMs can also be useful. The magnitude is sensitive to the magnetic mineralogy, concentration and grain size and properties of IRMs are used for a variety of purposes, some of which we will discuss in Chapters 8 and 10. In anticipation of those chapters, we will briefly introduce some of properties of laboratory acquired IRMs.\n\n\n\nFigure 7.20:Acquisition of IRM by exposure to large magnetic fields. After saturation, the remanence remaining is M_r. One can then turn the sample around and apply smaller fields in the opposite direction to determine the field necessary to reduce the net remanence to zero. Also shown are two methods of estimating coercivity of remanence (H_{cr}'' and H_{cr}'''; see Appendix for summary).\n\nIn \n\nFigure 7.20 we illustrate the behavior of an initially demagnetized specimen as it is subjected to increasing impulse fields. The maximum IRM achieved is known as sIRM (saturation IRM) or M_r (and sometimes M_{rs}). After saturation, the specimen can be turned around and subjected to increasingly large back-fields. The back-field sufficient to remagnetize half of the moments (resulting in a net remanence of zero) is the coercivity of remanence (H_{cr} or \\mu_o H_{cr} depending on the magnetic units). Alternatively, we could use the magnetic field required to impart an IRM that is half the intensity of the saturation remanence (H'''_{cr}). We call this the H_{1/2} method.\n\nBy now we have encountered four different methods for estimating the coercivity of remanence. Each of these requires a monogenetic populations of grains and will give meaningless numbers if there are several different minerals or grain size populations in the specimen. The “ascending loop intercept method” also assumes uniaxial single domain particles. So differences between, for example the H_{cr} estimate and H_{cr}' could provide clues about departures from that assumption.","type":"content","url":"/chapter7#sect-irm","position":25},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Thermo-viscous remanent magnetization"},"type":"lvl2","url":"/chapter7#thermo-viscous-remanent-magnetization","position":26},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Thermo-viscous remanent magnetization"},"content":"Sometimes rocks are exposed to elevated temperatures for long periods of time (for example during deep burial). The grains with relaxation times (at the elevated temperature) shorter than the exposure time may have acquired a so-called thermo-viscous remanent magnetization (TVRM). To erase this remanence, the rock must be heated in the laboratory (in zero field) hot enough and long enough. We cannot wait for geologically meaningful periods of time, so we must estimate what the effective blocking temperature of the TVRM component will be on laboratory time scales. To do this, we follow the logic of \n\nPullaiah et al. (1975). If we hold H_c, M_s and v constant in \n\nEquation 7.3, we could calculate the relationship of \\tau to temperature by:T_1 \\ln C \\tau_1 = T_2 \\ln C \\tau_2.\n\nBut H_c and M_s are also functions of temperature and a more appropriate equation would be:\\frac{T_1 \\ln C \\tau_1}{M_s(T_1) H_c(T_1)} = \\frac{T_2 \\ln C \\tau_2}{M_s(T_2) H_c(T_2)}.\n\nFor uniaxial anisotropy, H_c(T) \\simeq \\Delta N M_s for magnetite, so H_c varies linearly with M_s. Exploiting this property, we can simplify \n\nEquation 7.22 to:\\frac{T_1 \\ln C \\tau_1}{M_s^2(T_1)} = \\frac{T_2 \\ln C \\tau_2}{M_s^2(T_2)}.\n\nNow all we need is the variation of saturation magnetization with temperature. As previously noted, this is not perfectly known. However, using the approximate relationship from Chapter 3 of M_s(T) (\\gamma=0.38 in \n\nEquation 7.4 and assuming T_c=580°C as in Chapter 6), we can draw the plot shown in \n\nFigure 7.21a for \\tau versus T_b. This plot is different in detail from that of \n\nPullaiah et al. (1975) because of the difference in assumed M_s(T) behavior.\n\nThe theoretical treatment for hematite is different than for magnetite because the dominant source of anisotropy is either a defect moment or magnetocrystalline anisotropy, and the relationship of coercivity with temperature is different than for shape anisotropy. In fact, this relationship for hematite is very poorly constrained. \n\nPullaiah et al. (1975) assumed H_c(T) \\propto M_s^3(T) from which they derived:\\frac{T_1 \\ln C \\tau_1}{M_s^4(T_1)} = \\frac{T_2 \\ln C \\tau_2}{M_s^4(T_2)}.\n\nUsing experimental values of blocking temperature for hematite, they calculated nomograms for hematite similar to that shown in \n\nFigure 7.21b.\n\n\n\nFigure 7.21:Theoretical nomogram relating relaxation time and blocking temperature. a) magnetite and b) hematite.\n\nCurves like those shown in \n\nFigure 7.21 allow us to predict what the blocking temperature of a viscous magnetization acquired over many years will be under laboratory conditions (relaxation times of hundreds of seconds). There are many assumptions built into the plot shown in \n\nFigure 7.21 and some discussion in the literature (see \n\nDunlop & Özdemir (1997) for a good summary). Because of the sensitivity to the M_s(T) behavior and the even more poorly constrained (at least for hematite) H_c(T) behavior, these plots should be used with caution.","type":"content","url":"/chapter7#thermo-viscous-remanent-magnetization","position":27},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Natural remanent magnetization"},"type":"lvl2","url":"/chapter7#natural-remanent-magnetization","position":28},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Natural remanent magnetization"},"content":"A rock collected from a geological formation has a magnetic remanence which may have been acquired by a variety of mechanisms some of which we have described. The remanence of this rock is called simply a natural remanent magnetization in order to avoid a genetic connotation in the absence of other compelling evidence. The NRM is often a combination of several components, each with its own history. The NRM must be picked apart and the various components carefully analyzed before origin can be ascribed. The procedures for doing this are described in later chapters.\n\n\n\nFigure 7.22:Acquisition of ARM in alternating magnetic field. A total ARM is acquired if the DC field is switched on throughout the experiment (red dashed line) and a partial ARM (pARM) is acquired if the field is switched on only for part of the experiment (blue dash-dot line).","type":"content","url":"/chapter7#natural-remanent-magnetization","position":29},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Artificial remanences"},"type":"lvl2","url":"/chapter7#sect-arm","position":30},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Artificial remanences"},"content":"Another way to magnetize rocks (although not in nature) is to subject a sample to an alternating field (see \n\nFigure 7.22). Particles whose coercivity is lower than the peak oscillating field will flip and flop along with the field. These entrained moments will become stuck as the peak field gradually decays below the coercivities of individual grains. Assuming that there is a range of coercivities in the sample, the low stability grains will be stuck half along one direction of the alternating field and half along the other direction; the net contribution to the remanence will be zero. This is the principle of so-called alternating field (AF) demagnetization which we will discuss in later chapters.\n\nIf there is a small DC bias field superposed on the alternating field, then there will be a statistical preference in the remagnetized grains for the direction of the bias field, analogous to TRM acquired during cooling. This net magnetization is termed the anhysteretic remanent magnetization or ARM. By analogy to partial thermal remanence, one can impart a partial anhysteretic remanence (pARM) by only turning on the DC field for part of the AF cycle (solid blue line in \n\nFigure 7.22). Also, by normalizing the magnetization (volume normalized with units of Am^{-1}) by the DC field (also converted to Am^{-1}), one has the dimensionless parameter known as ARM susceptibility (\\chi_{ARM}). This parameter assumes that ARM is linearly related to the inducing field so that \\chi_{ARM} is independent of the applied field. This is of course only true for small DC fields and may not be true for the fields used in most laboratories (50-100 μT).\n\nA related remanence known as the gyromagnetic remanent magnetization or GRM is a somewhat mysterious remanence that is acquired by stationary specimens in moving fields or by rotating specimens in either steady or moving fields. It is most frequently observed as a component of magnetization acquired during alternating field demagnetization that is perpendicular to the last axis of demagnetization. It was originally thought to arise from the gyroscopic response of SD moments to the torque of an applied field which, in anisotropic distributions of SD moments resulted in a net moment perpendicular to the applied field \n\nStephenson (1981). But, truly uniaxial single domain particles will have no net remanence if demagnetized along all three axes, no matter how anisotropic the distribution of easy axes is. More recently, \n\nPotter & Stephenson (2005) hypothesized that small deviations from the uniaxial constraint for small acicular magnetic particles could explain the behavior. They performed experiments on elongate particles of maghemite (1 μm in length and 0.22 μm in diameter) and confirmed that the non-ideal (not strictly uniaxial) behavior could explain the GRM. They referred to these particles as being single domain, and while they may not have had domain walls, it is likely that such large particles were in fact in the size range that exhibit vortex remanent states (see Chapter 4). It is therefore likely that anisotropic distributions of vortex state particles is the cause of GRM.\n\nSupplemental Readings: \n\nDunlop & Özdemir (1997), Chapters 8, 10, 11, 13.","type":"content","url":"/chapter7#sect-arm","position":31},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Problems"},"type":"lvl2","url":"/chapter7#problems","position":32},{"hierarchy":{"lvl1":"Chapter 7: How Rocks Get and Stay Magnetized","lvl2":"Problems"},"content":"Problem 1\n\nSD grains of hematite (\\alphaFe_2O_3) are precipitating from solution at a temperature of 280K. The coercivity is \\mu_o H_c = 1 T. Use what you need from \n\nTable 6.1 from Chapter 6 and find the diameter of a spherical hematite particle with a relaxation time of 100 seconds.\n\nProblem 2\n\nIn the text, you were given a brief discussion of the time required for a magnetic grain to become substantially aligned with the magnetic field in a viscous fluid. For water at room temperature, \\eta is approximately \n\n10-3 m^{-1} kg s^{-1}. Calculate the time constant of alignment for saturation values of magnetization for both magnetite and hematite in water. [HINT: use values listed in \n\nTable 6.1 from Chapter 6.]\n\nProblem 3\n\nSometimes rocks are exposed to elevated temperatures for long periods of time (for example during deep burial). The grains with relaxation times (at the elevated temperature) shorter than the exposure time will have acquired a so-called thermo-viscous remanence. In order to demagnetize this remanence on laboratory time scales of, say, 100 seconds, we need to know the blocking temperature on laboratory time scales.\n\na) Use the curves in \n\nFigure 7.21a to determine the laboratory blocking temperature of a VRM acquired since the last reversal (0.78 Ma) by a rock remaining at 20°C for magnetite. Do the same for a rock buried for 30 Ma to a depth at temperature 250°C.\n\nb) Hydrothermal activity elevates the temperature of a red sandstone to 225°C for a time interval of 1000 yr and results in formation of thermoviscous remanent magnetization (TVRM). If hematite is the exclusive ferromagnetic mineral in this red sandstone, approximately what temperature of thermal demagnetization is required to unblock (remove) this TVRM? The time at maximum temperature during thermal demagnetization is approximately 30 min.\n\nProblem 4\n\nRelaxation time is controlled by saturation magnetization, coercivity, volume and temperature. Write a program that will draw curves for a given relaxation time for coercivity (on the X axis) versus grain volume (on the y axis). Plot out curves for 100 sec, 1 Myr and 1 Gyr for magnetite and for hematite. Use coercivities from 1 mT to 100 mT.","type":"content","url":"/chapter7#problems","position":33},{"hierarchy":{"lvl1":"Essentials of Paleomagnetism"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Essentials of Paleomagnetism"},"content":"This is a modern, interactive version of Essentials of Paleomagnetism by \n\nLisa Tauxe with edits and additions by \n\nNick Swanson-Hysell. It is being ported over from the web book version that is available online at \n\nEarthRef.org for which the source files are available on \n\nGithub.","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Essentials of Paleomagnetism","lvl2":"About This Edition"},"type":"lvl2","url":"/#about-this-edition","position":2},{"hierarchy":{"lvl1":"Essentials of Paleomagnetism","lvl2":"About This Edition"},"content":"This JupyterBook edition aims to bring the content of the original textbook into an interactive web format with:\n\nInteractive figures enable 3D visualizations and data exploration\n\nExecutable code demonstrating key concepts with Python\n\nModern web rendering of equations and cross-references\n\nMyST Markdown for rich scientific document authoring","type":"content","url":"/#about-this-edition","position":3},{"hierarchy":{"lvl1":"Essentials of Paleomagnetism","lvl2":"Chapters"},"type":"lvl2","url":"/#chapters","position":4},{"hierarchy":{"lvl1":"Essentials of Paleomagnetism","lvl2":"Chapters"},"content":"Essentials of Paleomagnetism\n\nChapters\n\nChapter 4: Magnetic Anisotropy and Domains\n\nChapter 5: Magnetic Hysteresis\n\nChapter 6: Magnetic Mineralogy\n\nChapter 7: How Rocks Get and Stay Magnetized\n\nLicensed under \n\nCC-BY-4.0.","type":"content","url":"/#chapters","position":5}]}